{"entries":[{"definition":"Speaking maliciously or slanderously about a person who is absent.  ","word":"backbiting","see_also":null,"production_notes":null},{"definition":"Author of the Brahma Sutras.  ","word":"Badarayana (Badarayana)","see_also":["Brahma Sutra"],"production_notes":null},{"definition":"A name and traditional murti, or image, of Ganesha meaning the \"little (or young) one.\" He holds five kinds of sweets: banana, mango, sugar cane, jackfruit and modaka. ","word":"Bala Ganapati","see_also":["Brahma Sutra"],"production_notes":null},{"definition":"\"Initial establishing.\" The religious rites of firmly determining and blessing the site of a new temple. ","word":"balasthapana","see_also":["Brahma Sutra"],"production_notes":null},{"definition":"\"Offering place.\" An inverted lotus-shaped stone atop a pedestal situated near the temple flagpole, dhvajastambha. Here devotees are to leave all negative thoughts as they enter the temple.   ","word":"balipitha","see_also":["Brahma Sutra"],"production_notes":null},{"definition":"To stop abruptly and refuse to go on.    ","word":"balk","see_also":["Brahma Sutra"],"production_notes":null},{"definition":"\"Lord of Ballala\" [after the name of a young devotee]. The Ganesha murti enshrined at the Pali Temple of Maharashtra. ","word":"Ballaleshvara","see_also":["Brahma Sutra"],"production_notes":null},{"definition":"A stabilizing weight, usually on a boat.  ","word":"ballast","see_also":["Brahma Sutra"],"production_notes":null},{"definition":"Deadly harm, misfortune. A cause of death, destruction, or ruin.    ","word":"bane","see_also":["Brahma Sutra"],"production_notes":null},{"definition":"ficus indicus (vata in Sanskrit), symbolizes Hinduism, which branches out in all directions, draws from many roots, spreads shade far and wide, yet stems from one great trunk. Siva as Silent Sage sits beneath it.    ","word":"Banyan tree","see_also":["Brahma Sutra"],"production_notes":null},{"definition":"A member of an evangelical Protestant church of congregational polity, following the reformed tradition in worship, and believing in individual freedom, in the separation of church and state, and in baptism of voluntary, conscious believers.  ","word":"Baptist","see_also":["Brahma Sutra"],"production_notes":null},{"definition":"A singer or reciter of epic poems.   ","word":"bard","see_also":["Brahma Sutra"],"production_notes":null},{"definition":"A Tibetan term for an intermediate state between death and further destiny of the soul.    ","word":"bardo","see_also":["Brahma Sutra"],"production_notes":null},{"definition":"A 12th-century philosopher, poet and prime minister who reformed and revived Vira Saivism in Karnataka.  ","word":"Basavanna","see_also":["Vira Saivism"],"production_notes":null},{"definition":"To enjoy pleasant warmth, sunshine, praise or blessing.  ","word":"bask","see_also":["Vira Saivism"],"production_notes":null},{"definition":"A name of Siva used in Indonesia.  ","word":"Batara","see_also":["Siva"],"production_notes":null},{"definition":"A book of laws associated with the Krishna Yajur Veda and governing studentship, marriage, household rituals, civil law, etc. It is followed by brahmins of Southwest India.  ","word":"Baudhayana Dharma Shastra","see_also":["Dharma Shastra","Kalpa Vedanga"],"production_notes":null},{"definition":"Abbreviation (equivalent to BC, \"before Christ) for \"before common era,\" referring to dating prior to the year one in the Western (Gregorian) calendar, which is now in universal secular use. Thus, 300 BCE was 300 years before the turn of the millennium. Cf: ce.  ","word":"bce","see_also":["Dharma Shastra","Kalpa Vedanga"],"production_notes":null},{"definition":"Supreme blessedness or happiness.    ","word":"beatitude","see_also":["Dharma Shastra","Kalpa Vedanga"],"production_notes":null},{"definition":"Darkening as if with clouds; obscuring.    ","word":"beclouding","see_also":["Dharma Shastra","Kalpa Vedanga"],"production_notes":null},{"definition":"Solid rock beneath the soil; firm foundation.  ","word":"bedrock","see_also":["Dharma Shastra","Kalpa Vedanga"],"production_notes":null},{"definition":"Given with ill will or reluctance. ","word":"begrudgingly","see_also":["Dharma Shastra","Kalpa Vedanga"],"production_notes":null},{"definition":"To be necessary, proper or befitting.    ","word":"behoove","see_also":["Dharma Shastra","Kalpa Vedanga"],"production_notes":null},{"definition":"When capitalized, being refers to God's essential divine nature -- Pure Consciousness, Absolute Reality and Primal Soul (God's nature as a divine Person). Lower case being refers to the essential nature of a person, that within which never changes; existence.  ","word":"Being","see_also":["Siva","Kalpa Vedanga"],"production_notes":null},{"definition":"A blessing, especially a spoken one.  ","word":"benediction","see_also":["blessing","Kalpa Vedanga"],"production_notes":null},{"definition":"Disposition to do good; charitable, kindly.  ","word":"benevolence","see_also":["yama-niyama","Kalpa Vedanga"],"production_notes":null},{"definition":"Good, kindly, doing no harm.  ","word":"benign","see_also":["ahimsa","Kalpa Vedanga"],"production_notes":null},{"definition":"Deprived of something.  ","word":"bereft","see_also":["ahimsa","Kalpa Vedanga"],"production_notes":null},{"definition":"To ask of someone earnestly; solicit with fervor; beg.    ","word":"beseech (besought)","see_also":["ahimsa","Kalpa Vedanga"],"production_notes":null},{"definition":"To offer graciously as a gift.  ","word":"bestow","see_also":["dana","Kalpa Vedanga"],"production_notes":null},{"definition":"The final testing of new computer software, performed by persons other than software developers, before it is released for sale.  ","word":"beta testing","see_also":["dana","Kalpa Vedanga"],"production_notes":null},{"definition":"To indicate, show; offer as a sign of the future; symbolize.    ","word":"betoken","see_also":["dana","Kalpa Vedanga"],"production_notes":null},{"definition":"Mutual pledge to marry; engagement. In Sanskrit, vagdana or nishchitartha.  ","word":"betrothal","see_also":["samskaras of adulthood","Kalpa Vedanga"],"production_notes":null},{"definition":"To baffle or confuse through something puzzling or unexplained.   ","word":"bewilder","see_also":["samskaras of adulthood","Kalpa Vedanga"],"production_notes":null},{"definition":"\"Bestower\" of fortune. A God of the Rig Veda; Lord of wealth, prowess and happiness.  ","word":"Bhaga","see_also":["purushartha","Rig Veda","wealth"],"production_notes":null},{"definition":"\"Song of the Lord.\" One of the most popular of Hindu writings, a conversation between Lord Krishna and Arjuna on the brink of the great battle at Kurukshetra. In this central episode of the epic Mahabharata (part of the sixth book), Krishna illumines the warrior-prince Arjuna on yoga, asceticism, dharma and the manifold spiritual path.  ","word":"Bhagavad Gita","see_also":["Itihasa","Mahabharata","wealth"],"production_notes":null},{"definition":"\"Possessor of fortune;\" gracious Lord. Relating to God or a God; holy, sacred, divine.\" Pertaining to Vishnu or Krishna. From bhaga, \"Bestower, gracious lord; patron.\" The name of a sect of Vaishnavism which arose in the Western part of India after 600 BCE. A highly devotional monotheistic faith worshiping God as Krishna, Vasudeva or Vasudeva-Krishna. It is believed by scholars to have been one of five religions (along with the Ekantika, Narayaniya, Vaikhanasa and Satvata) that blended to form the Pancharatra religion prevalent around Mathura ca 300 BCE. Today, the term Bhagavata is often used to refer to the Vaishnavite religion as a whole.  ","word":"Bhagavata","see_also":["Pancharatra","Vaishnavism","wealth"],"production_notes":null},{"definition":"Also known as Shrimad Bhagavatam, a work of 18,000 stanzas. A major Purana and primary Vaishnava scripture, from oral tradition, written down ca 800. It provides the stories of all incarnations of Vishnu, filled with the bhakti, inner current of devotion.  ","word":"Bhagavata Purana","see_also":["Purana","Vaishnavism","wealth"],"production_notes":null},{"definition":"\"He of broken tusk.\" An epithet of loving Ganesha. ","word":"Bhagnadanta","see_also":["Purana","Vaishnavism","wealth"],"production_notes":null},{"definition":"\"Terrifying.\" Lord Siva as the fiery protector. He carries and is represented by a trishula (trident), a symbol often enshrined as guardian at the entrance to Siva temples.  ","word":"Bhairava","see_also":["Siva","trishula","wealth"],"production_notes":null},{"definition":"Spiritual song. Individual or group singing of devotional songs, hymns and chants. See also: kirtana. ","word":"bhajana","see_also":["Siva","trishula","wealth"],"production_notes":null},{"definition":"(Tamil: Bhaktar.) \"Devotee.\" A worshiper. One who is surrendered to the Divine. ","word":"bhakta","see_also":["bhakti","bhakti yoga","devotee","guru bhakti"],"production_notes":null},{"definition":"\"Devotion.\" Surrender to God, Gods or guru. Bhakti extends from the simplest expression of devotion to the ego-decimating principle of prapatti, which is total surrender. Bhakti is the foundation of all denominations of Hinduism, as well as yoga schools throughout the world.  ","word":"bhakti","see_also":["bhakti yoga","darshana","prapatti","prasada","sacrifice","surrender","yajna"],"production_notes":null},{"definition":"\"Dear to devotees\" is a popular murti, unique in that He holds a coconut and a bowl of pudding, mango and banana. ","word":"Bhakti Ganapati","see_also":["bhakti yoga","darshana","prapatti","prasada","sacrifice","surrender","yajna"],"production_notes":null},{"definition":"\"Union through devotion.\" Bhakti yoga is the practice of devotional disciplines, worship, prayer, chanting and singing with the aim of awakening love in the heart and opening oneself to God's grace. Bhakti may be directed toward God, Gods or one's spiritual preceptor. Bhakti yoga seeks communion and ever closer rapport with the Divine, developing qualities that make communion possible, such as love, selflessness and purity. Saint Sambandar described bhakti as religion's essence and the surest means to divine union and liberation. He advised heartfelt worship, unstinting devotion and complete surrender to God in humble, committed service. From the beginning efforts of bhakti to advanced devotion, called prapatti, self-effacement is an integral part of Hindu, even all Indian, culture. Bhakti yoga is embodied in Patanjali's Yoga Darshana in the second limb, niyamas (observances), as devotion (Ishvarapranidhana). Bhakti yoga is practiced in many Hindu schools, and highly developed in Vaishnavism as a spiritual path in itself, leading to perfection and liberation. In Saiva Siddhanta, its cultivation is the primary focus during the kriya pada (stage of worship).  ","word":"bhakti yoga","see_also":["bhakti","prapatti","sacrifice","surrender","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Posture.\" The position of the limbs, as of a murti. ","word":"bhangima","see_also":["bhakti","prapatti","sacrifice","surrender","yajna","surrender","yajna"],"production_notes":null},{"definition":"The ancient and original name of Indian lands and the constitutional name of independent India (Bharat in Hindi). Also, Bharatavarsha \"land of Bharata,\" a legendary monarch and sage.  ","word":"Bharata","see_also":["bhakti","prapatti","sacrifice","surrender","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"He who supports, maintains, bears a burden.\" The ancient, original name of India and its constitutional name in Hindi: Bharatavarsha \"land of Bharat,\" a legendary monarch and sage.   ","word":"Bharata (Bharata)","see_also":["bhakti","prapatti","sacrifice","surrender","yajna","surrender","yajna"],"production_notes":null},{"definition":"One of the ancient dance forms of India dating back to the second century BCE. This dance type originated in the Hindu temples of Southern India and is one of the most graceful and sophisticated dance styles. ","word":"Bharatanatyam","see_also":["bhakti","prapatti","sacrifice","surrender","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Land of Bharat,\" India.  ","word":"Bharatkhand","see_also":["bhakti","prapatti","sacrifice","surrender","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Talking over, discussion.\" Commentary on a text. Hindu philosophies are largely founded upon the interpretations, or bhashyas, of primary scripture. Other types of commentaries include: vritti, a brief note on aphorisms; tippani, like a vritti but less formal, explains difficult words or phrases; varttika, a critical study and elaboration of a bhashya; and tika or vyakhyana, an explanation of a bhashya or shastra in simpler language.  ","word":"bhashya","see_also":["bhakti","prapatti","sacrifice","surrender","yajna","surrender","yajna"],"production_notes":null},{"definition":"Philosopher (ca 950). His Bhaskarabhashya, a commentary on the Brahma Sutras, was the first elaborate criticism of Sankara's Advaitic doctrine of avidya-maya.  ","word":"Bhaskara","see_also":["Sankara","Vedanta","Vishishtadvaita","surrender","yajna","surrender","yajna"],"production_notes":null},{"definition":"Concentrated feeling, emotion, mature bhakti. ","word":"bhava","see_also":["Sankara","Vedanta","Vishishtadvaita","surrender","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Mark of existence.\" Siva beyond space and time.  ","word":"Bhavalinga","see_also":["atattva","Parashiva","Sivalinga","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Difference-nondifference.\" A term in Vedanta which means that soul and world are identical with and yet different from God, in the same way that the waves of an ocean can be seen as being nondifferent from the ocean, yet they are not the ocean, only a part of it.  ","word":"bhedabheda","see_also":["Vedanta","Parashiva","Sivalinga","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"A Buddhist monk, or any of the first disciples of Buddha.  ","word":"bhikku","see_also":["Vedanta","Parashiva","Sivalinga","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Land of pleasure,\" referring to the world.    ","word":"Bhogabhumi","see_also":["Vedanta","Parashiva","Sivalinga","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"One of the 18 siddhas of Saiva tradition, an alchemist and tantrika yogi, associated with the Palani Hills Murugan temple in South India, for which he created the Dandayuthapaniswami murti from nine poisonous metals. Bhogar is believed by some to still reside there in a cave. Chinese historical records suggest that he came from China.   ","word":"Bhogar Rishi","see_also":["Vedanta","Parashiva","Sivalinga","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"A Saivite king, poet, artist and theologian of Gujarat (1018-1060). Author of Tattvaprakasha. Renowned for establishing a systematic, monistic Saiva Siddhanta, and creating India's then largest artificial lake, 250 miles in length, called Bhojpur.  ","word":"Bhojadeva Paramara (Paramara)","see_also":["Tatparyadipika","Parashiva","Sivalinga","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Food-blessing chant.\" As each meal is served, reciting the food-blessing chant, silently or aloud as a group, is an expression of gratitude, an acknowledgement of food's ultimate source and an invocation of spiritual benefits. Its recitation prepares one for partaking of the Supreme Lord's abundance, which should occur in the right state of mind and emotion. Food, the magical source of prana, is an umbilical connection to the cosmos, the lifeline of embodied souls, nature's means of nourishment. This chant is given in the spirit of a beggar humbly seeking alms. Water -- a pranic bridge between the subtle and physical universes -- is used in four ways in preparing to eat. First the mouth is rinsed. Then water is used to rinse the banana leaf or plate. Water from one's drinking cup is poured into the right hand to rinse it, as food is, whenever possible, taken with the hand, rather than with chopsticks or fork and spoon. Finally, water is sprinkled in a circle around the food with the right hand, creating a force field of purification and protection and invoking harmony of all five bodily pranas. In the South of India, a little bit from each food item is placed on the upper left corner of the plate as an offering to Ganesha before taking one's first bite.  ","word":"Bhojana Mantra","see_also":["Tatparyadipika","Parashiva","Sivalinga","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Servant's way.\" One of the five Vira Saiva codes of conduct.  ","word":"bhrityachara","see_also":["Panchachara","Parashiva","Sivalinga","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Worldly enjoyment.\"    ","word":"bhukti","see_also":["Panchachara","Parashiva","Sivalinga","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Earth world.\" The physical plane. The physical world perceived through the five senses. Also called the First World.   ","word":"Bhuloka","see_also":["loka","Parashiva","Sivalinga","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Earth; ground; soil.\" Preface; introduction to a book. From bhu, \"to become, exist; arise, come into being.\"  ","word":"bhumika","see_also":["loka","Parashiva","Sivalinga","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Plane of atmosphere.\" The second of the seven upper worlds, realm of svadhishtana chakra, consisting of the two astral regions closest to the physical plane: Pitriloka, \"world of ancestors,\" and Pretaloka, \"world of the departed.\"  ","word":"Bhuvarloka","see_also":["loka","Parashiva","Sivalinga","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"Of or characterized by sexual attraction for members of both genders.  ","word":"bi-sexual","see_also":["heterosexual","homosexual","sexuality","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"A theory that the universe -- time, space and matter -- originated approximately 20 billion years ago from the explosive expansion of a \"singularity.\"    ","word":"Big Bang","see_also":["heterosexual","homosexual","sexuality","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Seed syllable.\" A Sanskrit sound associated with a specific Deity used for invocation during mystic rites.    ","word":"bija mantra","see_also":["heterosexual","homosexual","sexuality","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"A king in Karnataka associated with the life of Basavanna.  ","word":"Bijjala","see_also":["heterosexual","homosexual","sexuality","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"Wood-apple (or bael) tree, Aegle marmelos, sacred to Lord Siva. Its leaves, picked in threes, are offered in the worship of the Sivalinga. The delicious fruit when unripe is used medicinally.   ","word":"bilva","see_also":["heterosexual","homosexual","sexuality","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"A drop, small particle, dot.\" 1) The seed or source of creation. In the 36 tattvas, the nucleus or first particle of transcendent light, technically called Parabindu, corresponding to the Shakti tattva. Scientists say the whole universe just before the big bang could fit on the head of a pin -- a tremendous point of energy -- that is Parabindu. 2) Small dot worn on the forehead between the eyebrows, or in the middle of the forehead, made of red powder (kunkuma), sandalpaste, clay, cosmetics or other substance. It is a sign that one is a Hindu. Mystically, it represents the \"third eye,\" or the \"mind's eye,\" which sees things that the physical eyes cannot see. The forehead dot is a reminder to use and cultivate one's spiritual vision, to perceive and understand life's inner workings, as well as to look into the past to see the future. The bindu is also a beauty mark worn by Hindu women, the color red generally a sign of marriage, black often worn before marriage to ward off the evil eye, kudrishti or papadrishti. The bindu is known as pottu in Tamil. Bindu is also a term for semen.  ","word":"bindu","see_also":["tattva","tilaka","sexuality","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"The science of relating physics to biological processes and phenomena.    ","word":"biophysics","see_also":["tattva","tilaka","sexuality","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"Janmapatrika. An astrological map of the sky drawn for a person's moment and place of birth. Also known as rashi chakra or zodiac wheel, it is the basis for interpreting the traits of individuals and the experiences, prarabdha karmas, they will go through in life.  ","word":"birth chart","see_also":["jyotisha","karma","sexuality","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":null,"word":"birthstar","see_also":["nakshatra","karma","sexuality","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"Payment extorted to prevent disclosure of information that would bring disgrace or ruin if made public.  ","word":"blackmail","see_also":["nakshatra","karma","sexuality","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"Good wishes; benediction. Seeking and giving blessings is extremely central in Hindu life, nurtured in the precepts of karunya (grace), shakti (energy), darshana (encountering\/seeing the divine), prasada (blessed offerings), puja (invocation), tirthayatra (pilgrimage), diksha (initiation), shaktipata (descent of grace), samskaras (rites of passage), sannidhya (holy presence) and sadhana (inner-attunement disciplines). ","word":"blessing","see_also":["nakshatra","karma","sexuality","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":null,"word":"boddhisattva","see_also":["nirvani","upadeshi","sexuality","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Mentor, teacher.\" One who awakens or catalyzes knowing; a religious instructor or catalyst.   ","word":"bodhaka","see_also":["nirvani","upadeshi","sexuality","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Wise methods; ways of wisdom.\"  ","word":"bodhi tantra","see_also":["sadhana","tantra","sexuality","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Lord of wisdom\" or \"chief among the awakened ones.\" The current abbot of Kauai's Hindu Monastery, 163rd Jagadacharya of the Nandinatha Sampradaya's Kailasa Parampara. Bodhinatha was ordained by his satguru, Satguru Sivaya Subramuniyaswami, on October 21, 2001, the tenth evening of the extraordinary renaissance master's 32-day prayopavesha fast, which he undertook upon learning he had terminal cancer. Gurudeva had designated Bodhinatha, the senior monk of his order, as his successor in 1995, and from that time on gradually turned over to him the responsibilities of that esteemed religious post.  Born in Berkeley, California, on October 15, 1942, Bodhinatha began spiritual studies in 1960 with the Self Realization Fellowship and the Vedanta Society with a deep interest in monastic life. He met Gurudeva at the Mountain Desert Monastery in September, 1964, in Virginia City, Nevada, stating at this first meeting his desire to realize God. Gurudeva had him serve at the San Francisco monastery on weekends, and, after completing college, Bodhinatha entered the monastery in June, 1965.     ","word":"Bodhinatha Veylanswami","see_also":["sadhana","tantra","sexuality","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":null,"word":"bodies","see_also":["kosha","sharira","soul","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"Commonly, the fluids of the body, an English equivalent of the ayurvedic term dosha, which names three fundamental interbalancing principles or constituents of the human constitution.  ","word":"bodily humor","see_also":["ayurveda","dosha","soul","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"  ","word":"bond (bondage)","see_also":["evolution of the soul","mala","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"Asthisanchaya. Part of Hindu funeral rites. About twelve hours after cremation, family men return to the cremation site to collect the remains. Water is first sprinkled on the ashes to separate the black ash of the wood from the fine, white ash of the body. The white ash and bones (up to four inches long, called \"flowers\") are collected in a tray or brass pot. Some Hindus send the ashes and bones to India for deposition in the Ganges. Or they may be put into any ocean or river. Arrangements can be made with crematoriums in the East or West for the family to personally gather the ashes and \"flowers.\"  ","word":"bone-gathering","see_also":["cremation","samskaras of adulthood","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"Varadana. A welcome blessing, a gracious benefit received. An unexpected gift or bonus.  ","word":"boon","see_also":["grace","samskaras of adulthood","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"Generously and copiously giving.    ","word":"bounteous","see_also":["grace","samskaras of adulthood","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"Giving abundantly and without restraint; plentiful. ","word":"bountiful","see_also":["grace","samskaras of adulthood","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"The name of God in His aspect of Creator. Saivites consider Brahma, Vishnu and Rudra to be three of five aspects of Siva. Smartas group Brahma, Vishnu and Siva as a holy trinity in which Siva is the destroyer. Brahma the Creator is not to be confused with 1) Brahman, the Transcendent Supreme of the Upanishads; 2) Brahmana, Vedic texts; 3) brahmana, the Hindu priest caste (also spelled brahmin).  ","word":"Brahma","see_also":["Brahman","Parameshvara","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"God's hour.\" A very favorable time for sadhana. It is traditional to arise before this period, bathe and begin one's morning worship. Brahma muhurta is defined as roughly 1.5 hours, the last muhurta of the night in the 8-muhurta system. It is understood as comprising the final three muhurtas of the night in 15 or 16-muhurta systems, equalling 144 minutes or 135 minutes respectively.  ","word":"brahma muhurta","see_also":["muhurta","Parameshvara","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"A lengthy 13th-century commentary on the Brahma Sutras by Srikantha to establish a Vedic base for the Saivite qualified nondualism called Siva Advaita.  ","word":"Brahma Sutra Bhashya","see_also":["Siva Advaita","Vedanta","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"Also known as the Vedanta Sutras, composed by Badarayana (perhaps as early as 400 BCE) as the first known systematic exposition of Upanishadic thought. Its 550 aphorisms are so brief as to be virtually unintelligible without commentary. It was through interpretations of this text, as well as the Upanishads themselves and the Bhagavad Gita, that later schools of Vedanta expressed and formulated their own views of the Upanishadic tenets. A third name for this important work is Shariraka Sutras, \"aphorisms on the embodied\" soul.  ","word":"Brahma Sutra(s)","see_also":["Upanishad","Vedanta","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"Sankara's explanation of one of the three major treatises on Vedanta philosophy.  ","word":"Brahma Sutra, Shankara Bhashya","see_also":["Smarta","Vedanta","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"He who is moving in God.\" An unmarried male spiritual aspirant who practices continence, observes religious disciplines, including sadhana, devotion and service and who may be under simple vows. Also names one in the student stage (age 12 -- 24, or until marriage).  ","word":"brahmachari","see_also":["ashrama dharma","Vedanta","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"An unmarried female spiritual aspirant who practices continence, observes certain disciplines, often relating to devotion, service and teaching children, and who may be under simple vows.   ","word":"brahmacharini","see_also":["ashrama dharma","Vedanta","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"An unmarried female spiritual aspirant who practices continence, observes certain disciplines, often relating to devotion, service and teaching children, and who may be under simple vows.   ","word":"brahmacharini","see_also":["ashrama dharma","Vedanta","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Godly conduct.\" Brahmachariya, among the ethical restraints known as the yamas, means sexual purity--the restraint of lust and other aspects of the instinctive nature. In its strictest application, brahmachariya is celibacy, complete sexual abstinence, as practiced by monastics and advised for all persons prior to marriage. Thus, the first phase of life, until age twenty-five, is called the brahmachariya ashrama, a time of studentship and transmutation of sexual energies into intellectual and spiritual concerns. In a broader sense, householders practice the sexual purity of brahmachariya by remaining faithful in marriage.   ","word":"brahmachariya","see_also":["ashrama dharma","Vedanta","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Path to God,\" or \"moving in God.\" Sexual purity -- restraint of lust and the instinctive nature.  ","word":"brahmacharya","see_also":["yama-niyama","Vedanta","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":null,"word":"brahmacharya ashrama","see_also":["ashrama dharma","Vedanta","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Celibacy vow.\" The verbal pledge given before members of one's religious community to remain chaste until marriage, for a specified period of time, or for life. Often taken by Hindu youth at age 12 upon entering the brahmacharya ashrama, the vrata may also be taken by Hindu men and women later in life, such as upon entrance into the sannyasa ashrama or after the death of a spouse.  It also includes restraining the base instincts of anger, jealousy, greed, selfishness, etc.  ","word":"brahmacharya vrata","see_also":["ashrama dharma","brahmacharya","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"The door to the seven chakras and the Narakaloka just below the muladhara. In order for the higher chakras to come into power, this door must be shut, making it impossible for fears, hatreds, angers and jealousies to arise. Sadhana and right thought, word and deed are among the aids in this accomplishment. ","word":"Brahmadhvara","see_also":["Naraka","brahmacharya","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"The realm of sahasrara chakra, it is the highest of the seven upper worlds.  ","word":"Brahmaloka","see_also":["sahasrara chakra","brahmacharya","pasha","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Supreme Being; Expansive Spirit.\" From the root brih, \"to grow, increase, expand.\" Name of God or Supreme Deity in the Vedas, where He is described as 1) the Transcendent Absolute, 2) the all-pervading energy and 3) the Supreme Lord or Primal Soul. These three correspond to Siva in His three perfections. Thus, Saivites know Brahman and Siva to be one and the same God: -- Nirguna Brahman, God \"without qualities\" (guna), i.e., formless, Absolute Reality, Parabrahman, or Parasiva -- totally transcending guna (quality), manifest existence and even Parashakti, all of which exhibit perceivable qualities;  -- Saguna Brahman, God \"with qualities;\" Siva in His perfections of Parashakti and Parameshvara -- God as superconscious, omnipresent, all-knowing, all-loving and all-powerful. The term Brahman is not to be confused with 1) Brahma, the Creator God; 2) Brahmana, Vedic texts, nor with 3) brahmana, Hindu priest caste (English spelling: brahmin).  ","word":"Brahman","see_also":["Parameshvara","Parashakti","Parashiva","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Knower of God.\" 1) One of four primary sections of each Veda; concerned mainly with details of yajna, or sacrificial fire worship, and specific duties and rules of conduct for priests, but also rich in philosophical lore. 2) The first of the four varnas, or social classes, comprising pious souls of exceptional learning, including priests, educators and humanity's visionary guides. Also spelled brahmin.  ","word":"Brahmana","see_also":["brahmin","varna dharma","Vedas","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Divine artisan.\" Lord of the Holy Word.  ","word":"Brahmanaspati","see_also":["brahmin","varna dharma","Vedas","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Egg of God,\" or \"Cosmic egg.\" The cosmos; inner and outer universe.  ","word":"Brahmanda","see_also":["loka","three worlds","world","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Door of Brahman.\"  ","word":"Brahmarandhra","see_also":["door of Brahman","three worlds","world","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Knowledge or realization of God.\"    ","word":"Brahmavidya","see_also":["door of Brahman","three worlds","world","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Mature\" or \"evolved\" soul. The class of pious souls of exceptional learning. From Brahman, \"growth, expansion, evolution, development, swelling of the spirit or soul.\" The mature soul is the exemplar of wisdom, tolerance, forbearance and humility.  ","word":"brahmin (brahmana)","see_also":["varna dharma","three worlds","world","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"The hereditary religious practices of the Vedic brahmins, such as reciting mantras, and personal rules for daily living.   ","word":"brahminical tradition","see_also":["varna dharma","three worlds","world","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"God's principal festival.\" Each temple has one most important festival of the year which is its major celebration, called Brahmotsava, often a ten-day event.  ","word":"Brahmotsava","see_also":["festival","temple","world","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"Older plural of brother; often used for brothers in religion.     ","word":"brethren","see_also":["festival","temple","world","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"One of the major Upanishads, part of the Shatapatha Brahmana of the Yajur Veda. Ascribed to Sage Yajnavalkya, it teaches modes of worship, meditation and the identity of the individual self with the Supreme Self.  ","word":"Brihadaranyaka Upanishad","see_also":["Upanishad","temple","world","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Lord of Prayer.\" Vedic preceptor of the Gods and Lord of the Word, sometimes identified with Lord Ganesha. Also the name of a great exponent of Saiva Siddhanta (ca 900). ","word":"Brihaspati","see_also":["Ganesha","temple","world","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Extended family.\" Also called mahakutumba.  ","word":"brihatkutumba","see_also":["extended family","joint family","world","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"The Enlightened.\" Usually the title of Siddhartha Gautama (ca 624 --544 BCE), a prince born of the Shakya clan -- a Saivite Hindu tribe in eastern India on the Nepalese border. He renounced the world and became a monk. After his enlightenment he preached the doctrines upon which his followers later founded Buddhism. See also: Buddhism. ","word":"Buddha","see_also":["extended family","joint family","world","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Intellect, reason, logic.\" The intellectual or disciplined mind. Buddhi is characterized by discrimination (viveka), voluntary restraint (vairagya), cultivation of calmness (shanti), contentment (santosha) and forbearance (kshama). It is a faculty of manomaya kosha, the instinctive-intellectual sheath.  ","word":"buddhi","see_also":["intellectual mind","kosha","mind (individual)","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Wisdom and attainment (or fulfillment);\" names of the two symbolic consorts of Lord Ganesha. ","word":"Buddhi and Siddhi","see_also":["intellectual mind","kosha","mind (individual)","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"\"Intellectual mind.\"  ","word":"buddhi chitta","see_also":["buddhi","intellectual mind","mind (individual)","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"The religion based on the teachings of Siddhartha Gautama, known as the Buddha (ca 624 -- 544 BCE). He refuted the idea of man having an immortal soul and did not preach of any Supreme Deity. Instead he taught that man should seek to overcome greed, hatred and delusion and attain enlightenment through realizing the Four Noble Truths and following the Eightfold Path. Buddhism arose out of Hinduism as an inspired reform movement which rejected the caste system and the sanctity of the Vedas. It is thus classed as nastika, \"unbeliever,\" and is not part of Hinduism. Buddhism eventually migrated out of India, the country of its origin, and now enjoys a following of over 350 million, mostly in Asia. Prominent among its holy books is the Dhammapada.  ","word":"Buddhism","see_also":["Buddha","intellectual mind","mind (individual)","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"Relating to Buddhism, the religion based on the teachings of Siddhartha Gautama, known as the Buddha.  ","word":"Buddhist","see_also":["Buddhism","intellectual mind","mind (individual)","Vira Saivism","yajna","surrender","yajna"],"production_notes":null},{"definition":"Light, weightless; elated, happy, optimistic.     ","word":"buoyant, buoyed","see_also":["Buddhism","intellectual mind","mind (individual)","Vira Saivism","yajna","surrender","yajna"],"production_notes":null}],"results":121}