{"entries":[{"definition":"Abbreviation for circa -- Latin for \"approximately\" -- used with dates that are not precise, e.g., ca 650, \"around the year 650.\"   ","word":"ca","see_also":null,"production_notes":null},{"definition":"Rectangular panels of woven palm fronds used as roof, wall and fencing material. ","word":"cajan","see_also":null,"production_notes":null},{"definition":"Quality, station or ability of a person.    ","word":"caliber","see_also":null,"production_notes":null},{"definition":"Unfeeling, not sensitive, lacking compassion or pity.  ","word":"callous","see_also":["yama-niyama"],"production_notes":null},{"definition":"Karpura. An aromatic white crystalline solid derived from the wood of camphor trees (or prepared synthetically from pinene), prized as fuel in temple arati lamps.  ","word":"camphor","see_also":["arati","puja"],"production_notes":null},{"definition":"To provide an outlet or channel for.  ","word":"canalize","see_also":["arati","puja"],"production_notes":null},{"definition":"Disease characterized by the aberrant growth of cells.    ","word":"cancer","see_also":["arati","puja"],"production_notes":null},{"definition":"The religious laws governing a sect or a religion. Body of accepted or authorized scriptures.  ","word":"canon","see_also":["arati","puja"],"production_notes":null},{"definition":"Near, or relating to the heart.    ","word":"cardiac","see_also":["arati","puja"],"production_notes":null},{"definition":"Of primary importance; paramount.  ","word":"cardinal","see_also":["arati","puja"],"production_notes":null},{"definition":"Also spelled karnatic. One of the world's oldest and richest musical traditions dating back to Sama Veda, carnatic music denotes the classical style of South India which evolved from ancient Hindu traditions and was relatively unaffected by the Muslim influences that, since the late twelfth and early thirteenth centuries, characterized the Hindustani music of northern India.  ","word":"Carnatic (vocal) music","see_also":["arati","puja"],"production_notes":null},{"definition":"A hierarchical system, called varna dharma (or jati dharma), established in India in ancient times, which determined the privileges, status, rights and duties of the many occupational groups, wherein status is determined by heredity. There are four main classes (varnas) -- brahmin, kshatriya, vaishya and shudra -- and innumerable castes, called jati. The four varnas are as follows. -- brahmin (brahmana): \"Mature, evolved soul.\" Scholarly, pious souls of exceptional learning. Hindu scriptures traditionally invest the brahmin class with the responsibility of religious leadership, including teaching and priestly duties. -- kshatriya: \"Governing; endowed with sovereignty.\" Lawmakers and law enforcers and military, also known as rajanya. -- vaishya: \"Landowner, merchant.\" Businessmen, financiers, industrialists; employers. Those engaged in business, commerce and agriculture. -- shudra: \"Worker, servant.\" Skilled artisans and laborers. ","word":"caste","see_also":["arati","puja"],"production_notes":null},{"definition":"A person or thing acting as a stimulus upon another, whose presence brings about change. Difficulties can be a catalyst for spiritual unfoldment. Catalyst is sometimes used to name a teacher or facilitator.  ","word":"catalyst","see_also":["arati","puja"],"production_notes":null},{"definition":"The faith, doctrine, system and practice of the Catholic Church, a major Christian denomination.    ","word":"Catholicism","see_also":["arati","puja"],"production_notes":null},{"definition":"Karana sharira, the inmost body; the soul form, also called anandamaya kosha, \"bliss sheath,\" and actinic causal body.  ","word":"causal body","see_also":["kosha","soul"],"production_notes":null},{"definition":"Karana chitta. Superconscious mind.  ","word":"causal mind","see_also":["mind (five states)","soul"],"production_notes":null},{"definition":"The highest realm of existence, Sivaloka.","word":"causal plane","see_also":["loka","soul"],"production_notes":null},{"definition":"Karana. Anything which produces an effect, a result. -- efficient cause: (nimitta karana) That which directly produces the effect; that which conceives, makes, shapes, etc., such as the potter who fashions a clay pot, or God who creates the world. -- material cause:  (upadana karana) The matter from which the effect is formed, as the clay which is shaped into a pot, or God as primal substance becoming the world.   -- instrumental cause:  (sahakari karana) That which serves as a means, mechanism or tool in producing the effect, such as the potter's wheel, necessary for making a pot, or God's generative Shakti.  ","word":"cause","see_also":["maya","tattva"],"production_notes":null},{"definition":"To burn or sear so as to remove unwanted tissue, or to seal a wound.    ","word":"cauterize","see_also":["maya","tattva"],"production_notes":null},{"definition":"The region where the brain stem enters the skull from the spine, associated with the pineal gland and the ajna chakra.    ","word":"cavernous plexus","see_also":["maya","tattva"],"production_notes":null},{"definition":"Abbreviation for \"Common Era.\" Equivalent to the abbreviation AD (anno Domini, \"in the Lord's year\"). Following a date, it indicates that the year in question comes after the year one in the Western, or Gregorian (originally Christian) calender system. E.g., 300 CE is 300 years after the beginning of this era. Cf: bce.  ","word":"ce","see_also":["maya","tattva"],"production_notes":null},{"definition":"A person who performs a religious rite. ","word":"celebrant","see_also":["maya","tattva"],"production_notes":null},{"definition":"\"Of the sky or heavens.\" Of or relating to the heavenly regions or beings. Highly refined, divine.   ","word":"celestial","see_also":["maya","tattva"],"production_notes":null},{"definition":"Complete sexual abstinence. Also the state of a person who has vowed to remain unmarried and abstinent. Celibacy is abstinence from the eight degrees of sexual activity: fantasy (smarana), glorification (kirtana), flirtation (keli), glances (prekshana), secret talk (guhya bhashana), longing (kama samkalpa), rendezvous (adhyavasaya) and intercourse (kriya nivritti).  ","word":"celibacy","see_also":["brahmachari","ojas","tejas","transmutation","yama-niyama"],"production_notes":null},{"definition":"A member of a monastery community.  ","word":"cenobite","see_also":["brahmachari","ojas","tejas","transmutation","yama-niyama"],"production_notes":null},{"definition":"Belonging to a monastery community.  ","word":"cenobitic","see_also":["brahmachari","ojas","tejas","transmutation","yama-niyama"],"production_notes":null},{"definition":"The number 1 followed by 600 zeros. An unimaginably large figure.   ","word":"centillion","see_also":["brahmachari","ojas","tejas","transmutation","yama-niyama"],"production_notes":null},{"definition":"Relating to the brain.    ","word":"cerebral","see_also":["brahmachari","ojas","tejas","transmutation","yama-niyama"],"production_notes":null},{"definition":"From the Latin caerimonia, \"awe; reverent rite.\" A formal rite established by custom or authority as proper to special occasions.    ","word":"ceremony","see_also":["brahmachari","ojas","tejas","transmutation","yama-niyama"],"production_notes":null},{"definition":"An abbreviation for Latin confer, meaning \"compare.\"   ","word":"cf","see_also":["brahmachari","ojas","tejas","transmutation","yama-niyama"],"production_notes":null},{"definition":"\"Spirit, consciousness,\" especially \"higher consciousness;\" \"Supreme Being.\"A widely used term, often preceded by modifiers, e.g., sakshi chaitanya, \"witness consciousness,\" or bhakti chaitanya, \"devotional consciousness,\" or Sivachaitanya, \"God consciousness.\"  ","word":"chaitanya","see_also":["chitta","consciousness","mind (five states)","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"A renowned Vaishnava saint (1485 -- 1534), revered today especially in Bengal and Orissa, remembered for his ecstatic states of devotion. He taught a dualistic philosophy in which bhakti (devotion) to the divine couple Radha and Krishna is the only means to liberation. Practice revolves mainly around kirtana, devotional singing and dancing. He gave prominence to the Gaudiya Vaishnava sect, of which several branches thrive today, including ISKCON.  ","word":"Chaitanya, Sri","see_also":["Krishna","Vaishnavism","Vedanta","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"\"Wheel.\" A) In iconography, a disk-shaped weapon among the insignia of loving Ganesha (and of Lord Vishnu as well). It is a symbol of the sun and of the mind. Wielded as a weapon, it is the intellect divinely empowered. B) Metaphysically, any of the nerve plexuses or centers of force and consciousness located within the inner bodies of man. In the physical body there are corresponding nerve plexuses, ganglia and glands. The seven principal chakras can be seen psychically as colorful, multi-petaled wheels or lotuses. They are situated along the spinal cord from the base to the cranial chamber. Additionally, seven chakras, barely visible, exist below the spine. They are seats of instinctive consciousness, the origin of jealousy, hatred, envy, guilt, sorrow,etc. They constitute the lower or hellish world, called Naraka or patala. Thus there are 14 major chakras in all. The seven upper chakras, from lowest to highest, are: 1) muladhara (base of spine): memory, time and space; 2) svadhishthana (below navel): reason; 3) manipura (solar plexus): willpower; 4) anahata (heart center): direct cognition; 5) vishuddha (throat): divine love; 6) ajna (third eye): divine sight; 7) sahasrara (crown of head): illumination, Godliness.The seven lower chakras, from highest to lowest, are 1) atala (hips): fear and lust; 2) vitala (thighs): raging anger; 3) sutala (knees): retaliatory jealousy; 4) talatala (calves): prolonged mental confusion; 5) rasatala (ankles): selfishness; 6) mahatala (feet): absence of conscience; 7) patala (located in the soles of the feet): murder and malice. ","word":"chakra","see_also":["Krishna","Vaishnavism","Vedanta","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"\"Circle,\" \"an assembly.\" A circle or gathering of devotees, seated clockwise according to age or seniority in their fellowship. This clear acknowledgement of heirarchy by all parties helps keeps associations and interactions harmonious, as the lines of responsibility, respect of elders and nurturing of those younger than oneself are clear. When such a group sit together, they send their pranas, positive energies, clockwise around the circle for the upliftment of all.  ","word":"chakravala","see_also":["Krishna","Vaishnavism","Vedanta","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"An ornate cup or goblet.  ","word":"chalice","see_also":["Krishna","Vaishnavism","Vedanta","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"Indian dynasty (450 -- 1189) in the Punjab area. Buddhism and Saivism were prominent, the Buddhist Cave frescoes at Ajanta were completed and the art of Hindu temple building was advanced.  ","word":"Chalukya","see_also":["Krishna","Vaishnavism","Vedanta","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"Fly-whisk fan. ","word":"chamara","see_also":["Krishna","Vaishnavism","Vedanta","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"\"Sandalwood paste.\" One of the sacred substances offered during puja and afterwards distributed to devotees as a sacrament (prasada).   ","word":"chandana","see_also":["Krishna","Vaishnavism","Vedanta","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"\"The moon.\" Of central importance in Hindu astrology and in the calculation of the festival calendar. Considered the ruler of emotion.    ","word":"chandra","see_also":["Krishna","Vaishnavism","Vedanta","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"the practice of serving as a medium through which a spirit guide communicates with living persons.  ","word":"channeling","see_also":["Krishna","Vaishnavism","Vedanta","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"Great disorder and confusion.     ","word":"chaos","see_also":["Krishna","Vaishnavism","Vedanta","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"\"Good\" or \"sweet voice\" or \"word.\" Indian philosopher (ca 600 BCE) who gave the name to the school of uncompromising materialism. One of the great skeptics of all time.  ","word":"Charvaka","see_also":["nastika","Vaishnavism","Vedanta","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"\"Conduct stage.\" Stage of service and character building. ","word":"charya","see_also":["pada","Saiva Siddhanta","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":null,"word":"charya marga","see_also":["charya pada","Saiva Siddhanta","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"\"Conduct stage.\" Stage of service and character building","word":"charya pada","see_also":["pada","Saiva Siddhanta","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"A virtual place to participate in a real-time computer-to-computer teletype conversation over a network.  ","word":"chat room","see_also":["pada","Saiva Siddhanta","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"\"Four dharmas:\" rita, ashrama dharma, varna dharma and svadharma.  ","word":"chaturdharma","see_also":["dharma","Saiva Siddhanta","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"\"Disciple.\" (Hindi.) A disciple of a guru; synonym for the Sanskrit shishya. The feminine equivalent is chelina or cheli.    ","word":"chela","see_also":["dharma","Saiva Siddhanta","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"Another name for Chellappaswami.","word":"Chellappan","see_also":["Chellappaswami","Saiva Siddhanta","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"\"Beloved father.\" (Also known as Chellapaguru.) Reclusive siddha and 160th satguru (1840-1915) of the Nandinatha Sampradaya's Kailasa Parampara. Lived on Sri Lanka's Jaffna peninsula near Nallur Kandaswami Temple in a small hut where today there is a small samadhi shrine. Among his disciples was Sage Yogaswami, whom he trained intensely for five years and initiated as his successor. ","word":"Chellappaswami","see_also":["Kailasa Parampara","Natha Sampradaya","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"\"Little Basavanna.\" The 12th-century theologian who systematized the religious doctrine of Vira Saivism.   ","word":"Chennabasavanna","see_also":["Kailasa Parampara","Natha Sampradaya","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"An ethnic group of South India and Sri Lanka of the vaishya (merchant) caste.  ","word":"Chettiar","see_also":["vaishya","caste","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"Auxiliary Vedic texts on the metrical rules of poetic composition. Chhanda, meter, is among four linguistic skills taught for mastery of the Vedas and the rites of yajna. Chhandas means \"metrical lore,\" or \"prosedy.\" The most important text on Chhandas is the Chhanda Shastra, ascribed to Pingala (ca 200 BCE).  ","word":"Chhandas Vedanga","see_also":["Vedanga","caste","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"One of the major Upanishads, it consists of eight chapters of the Chhandogya Brahmana of the Sama Veda. It teaches the origin and significance of Aum, the importance of the Sama Veda, the Self, meditation and life after death.","word":"Chhandogya Upanishad","see_also":["Upanishad","caste","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"\"Dagger.\" A rare weapon among Ganesha's insignia. Its sharp blade is like the \"razor's edge,\" the narrow path spiritual aspirants must walk. ","word":"chhuri","see_also":["Upanishad","caste","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"\"Hall of Consciousness.\" A very famous South Indian Siva Nataraja temple.  ","word":"Chidambaram","see_also":["Nataraja","caste","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"King of Vellore, an area near Chennai (1559 -- 1579), patron and disciple of Appaya Dikshita.   ","word":"Chinna Bomman","see_also":["Nataraja","caste","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"\"Jewel of consciousness.\" The Ganesha murti enshrined at the Thevoor Temple near Pune, Maharashtra. ","word":"Chintamani","see_also":["Nataraja","caste","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"A modern health system which holds that disease results from a lack of normal nerve function and which employs adjustment of body structures, such as the spinal column, as the means of restoration, thus relieving pain, discomfort and disease which result from improper skeletal alignment.  ","word":"chiropractic","see_also":["Nataraja","caste","Saivism","Siva consciousness","yama-niyama"],"production_notes":null},{"definition":"\"Consciousness,\" or \"awareness.\" Philosophically, \"pure awareness; transcendent consciousness,\" as in Sat-chit-ananda. In mundane usage, chit means \"perception; consciousness.\"  ","word":"chit","see_also":["awareness","chitta","consciousness","mind (universal)","sakshin"],"production_notes":null},{"definition":"\"Hall of consciousness.\"  ","word":"chitsabha","see_also":["Nataraja","chitta","consciousness","mind (universal)","sakshin"],"production_notes":null},{"definition":"\"Mind; consciousness.\" Mind-stuff. On the personal level, it is that in which mental impressions and experiences are recorded. Seat of the conscious, subconscious and superconscious states, and of the threefold mental faculty, called antahkarana, consisting of buddhi, manas and ahamkara.  ","word":"chitta","see_also":["awareness","consciousness","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"A substance used in refrigeration and air conditioning appliances that is known to deplete Earth's stratospheric ozone layer and is, in some countries, now illegal and being phased out.  ","word":"chlorofluorocarbons","see_also":["awareness","consciousness","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"(Bengali) A long loose men's shirt, similar to the kurta or kafni.  ","word":"choga","see_also":["awareness","consciousness","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":null,"word":"Christ","see_also":["Jesus Christ","consciousness","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"A follower of the religion based on the life and teachings of Jesus Christ. The second of the three Abrahamic religions, Judaism, Christianity and Islam.  ","word":"Christian","see_also":["Jesus Christ","consciousness","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":null,"word":"Christian-Judaic","see_also":["Judaic-Christian","consciousness","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"A detailed, narrative report.  ","word":"chronicle","see_also":["Judaic-Christian","consciousness","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"\"Head-shaving sacrament.\"  ","word":"chudakarana","see_also":["See samskara","consciousness","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"A milky fluid comprised of lymph and emulsified fat extracted from chyme during digestion and passed to the bloodstream through the thoracic duct.   ","word":"chyle","see_also":["See samskara","consciousness","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"The thick semifluid mass of partly digested food that is passed from the stomach to the duodenum.     ","word":"chyme","see_also":["See samskara","consciousness","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"The natural cycle of biological activity or function over an approximate 24-hour period, as well as the movement of subtle energy throughout the body as it is influenced by the rising and setting of the sun. Traditional Chinese medicine establishes that chi, or vital energy, moves from one major meridian to another every two hours, repeating every 24 hours: 11PM-1AM: gall bladder; 1-3AM: liver (during the time of deepest sleep, the liver is most actively cleansing the blood); 3-5AM: lung (in traditional cultures, people wake up and take the first breath of the day during this period); 5-7AM: large intestine (depending upon the quantity of food taken during the day, the first bowel movement usually occurs during this period); 7-9AM: stomach (breakfast is usually taken during this period); 9-11 AM: spleen; 11AM-1PM: heart; 1-3 PM: small intestine (lunch is usually digested during this period); 3-5PM: bladder; 5-7PM: kidney; 7-9PM: pericardium; 9-11PM: san jiao (\"triple warmer\"). ","word":"circadian rhythm","see_also":["acupuncture","meridian","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Pradakshina. Walking around, usually clockwise.  ","word":"circumambulation","see_also":["pradakshina","puja","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Fortress, usually situated on a height.  ","word":"citadel","see_also":["pradakshina","puja","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"A yellow-orange crystal; a light to moderate olive color.    ","word":"citrine","see_also":["pradakshina","puja","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"\"Clear-hearing.\" Psychic or divine hearing, divyashravana. The ability to hear the inner currents of the nervous system, the Aum and other mystic tones. Hearing in one's mind the words of inner-plane beings or earthly beings not physically present. Also, hearing the nada-nadi shakti through the day or while in meditation.  ","word":"clairaudience","see_also":["clairvoyance","nada","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"\"Clear-seeing.\" Psychic or divine sight, divyadrishti. The ability to look into the inner worlds and see auras, chakras, nadis, thought forms, non-physical people and subtle forces. The ability to see from afar or into the past or future -- avadhijnana, \"knowing beyond limits.\" Also the ability to separate the light that illumines one's thoughts from the forms the light illumines. Also, duradarshana, \"far-seeing,\" the modern Sanskrit term for television in India. Duradarshin names a seer or prophet.  ","word":"clairvoyance","see_also":["akasha","nada","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Inner light at a high level of intensity, very clear and pure. When experienced fully, it is seen to be permeating all of existence, the universal substance of all form, inner and outer, pure consciousness, Satchidananda.This experience, repeated at regular intervals, can yield \"a knowing greater than you could acquire at any university or institute of higher learning.\"  ","word":"clear white light","see_also":["See Siva consciousness","tattva","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"A disposition to show mercy or leniency, especially towards an offender or enemy.  ","word":"clemency","see_also":["See Siva consciousness","tattva","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"A much overused expression.  ","word":"cliche","see_also":["See Siva consciousness","tattva","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Secluded, as in a monastery.  ","word":"cloistered","see_also":["See Siva consciousness","tattva","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Of crude quality; gross, rough cut. Not fine or refined.  ","word":"coarse","see_also":["See Siva consciousness","tattva","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Existing together in the same place or time.  ","word":"coexistent","see_also":["See Siva consciousness","tattva","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Knowing; perception. Knowledge reached through intuitive, superconscious faculties rather than through intellect alone.    ","word":"cognition","see_also":["See Siva consciousness","tattva","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Vijnanamaya kosha. The most refined sheath of the astral, or subtle, body (sukshma sharira). It is the sheath of higher thought and cognition.  ","word":"cognitive body","see_also":["astral body","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Informed or aware of something.    ","word":"cognizant","see_also":["astral body","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"The ability to perceive or become aware of knowledge through observation. A term coined by Satguru Sivaya Subramuniyaswami in 1950.    ","word":"cognizantability","see_also":["astral body","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Taking notice of something.    ","word":"cognize","see_also":["astral body","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Clinging together; not disintegrating.    ","word":"cohesive","see_also":["astral body","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Made up; artificed; invented.  ","word":"coined","see_also":["astral body","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Anything that honors the memory of a departed person or past event.  ","word":"commemorative","see_also":["shraddha","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Beginning.  ","word":"commencement","see_also":["shraddha","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"To give an order or power for something to be made or done.  ","word":"commission","see_also":["shraddha","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Dedication or engagement to a long-term course of action.   ","word":"commitment","see_also":["shraddha","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"To communicate closely, sharing thoughts, feelings or prayers in an intimate way. To be in close rapport.  ","word":"commune","see_also":["shraddha","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"The social and economic system which emerged around the turn of the 20th century in present-day Russia as \"a hypothetical stage of socialism, as formulated by Marx, Engels, Lenin and others, to be characterized by a classless and stateless society and the equal distribution of economic goods and to be achieved by revolutionary and dictatorial, rather than gradualistic, means\" (Webster's Dictionary). Communism is proudly atheistic and seeks to liberate mankind from superstition and \"spiritual bondage.\"  ","word":"communism","see_also":["shraddha","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Capable of combining well; getting along, harmonious.  ","word":"compatible","see_also":["shraddha","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"To make up for; reward for; give an equivalent of; recompense.   ","word":"compensate","see_also":["shraddha","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Self-satisfied and unconcerned.  ","word":"complacent","see_also":["shraddha","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"An element; one of the parts constituting a whole.    ","word":"component","see_also":["shraddha","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Understand; grasp.    ","word":"comprehend","see_also":["shraddha","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Including much or all.    ","word":"comprehensive","see_also":["shraddha","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"To consist of; be composed of.  ","word":"comprise","see_also":["shraddha","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"A settlement in which each side gives up some demands or makes concessions; a weakening, as of one's principles. ","word":"compromise","see_also":["shraddha","kosha","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":null,"word":"concealing grace","see_also":["grace","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"A regarding of oneself with often excessive favor. A high opinion of one's own abilities or worth. Also egoism or vanity.    ","word":"conceit","see_also":["grace","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"To form or develop an idea, thought, belief or attitude.    ","word":"conceive","see_also":["grace","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Uninterrupted and sustained attention.","word":"concentration","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"An idea or thought, especially a generalized or abstract idea.    ","word":"concept","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Power to imagine, conceive or create. Moment when a pregnancy is begun, a new earthly body generated.  -- the point of conception; the apex of creation: The simple instant that precedes any creative impulse and is therefore the source and summit of the powers of creation or manifestation. To become conscious of the point of conception is a great siddhi. ","word":"conception","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"A secret or confidential meeting.    ","word":"conclave","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Accompanying a condition or circumstance.   ","word":"concomitant","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Harmony and agreement; peaceful relations.  ","word":"concord","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Strong disapproval; severe reproof; strong censure.    ","word":"condemnation","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"To permit, tolerate or overlook.  ","word":"condone","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"To give or grant, especially an honor or privilege.  ","word":"confer","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"An admission, acknowledgement; as of guilt or wrongdoing.    ","word":"confession","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Keeping confidences, or information told in trust, secret; not divulging private or secret matters.  ","word":"confidentiality","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Boundary, limits, border. To restrict or keep within limits.    ","word":"confine(s)","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"A large, destructive fire.  ","word":"conflagration","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"To be in accord or agreement with.  ","word":"conform","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Action in accordance with customs, rules, prevailing opinion.  ","word":"conformity","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Chinese philosopher and teacher (552-479 BCE), founder of the Confucianist faith, whose Analects contain a collection of his sayings and dialogues. His teachings on social ethics are the basis of Chinese education and religion.  ","word":"Confucius","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"To solidify by, or as if by, freezing. To coagulate, jell.  ","word":"congeal","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Overcrowded, overfilled, clogged.    ","word":"congested","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"A group of things put together.    ","word":"conglomerate","see_also":["raja yoga","tirodhana shakti","mind (individual)","mind (universal)","sakshin"],"production_notes":null},{"definition":"Worship done as a group, such as synchronized singing, community prayers or other participatory worship by individuals sharing a strict membership in a particular organization, with no other religious affiliations. Hindu worship is strongly congregational within ashramas and tightly organized societies, but usually noncongregational in the general laity.  ","word":"congregational worship","see_also":["bhajana","kirtana","puja","yajna","sakshin"],"production_notes":null},{"definition":"Bring to mind, call up or evoke.    ","word":"conjure","see_also":["bhajana","kirtana","puja","yajna","sakshin"],"production_notes":null},{"definition":"An idea or meaning suggested by or associated with a word or thing.    ","word":"connotation","see_also":["bhajana","kirtana","puja","yajna","sakshin"],"production_notes":null},{"definition":"Act or process of overcoming, defeating and subjugation.  ","word":"conquest","see_also":["bhajana","kirtana","puja","yajna","sakshin"],"production_notes":null},{"definition":"The inner sense of right and wrong, sometimes called \"the knowing voice of the soul.\" However, the conscience is affected by the individual's training and belief patterns, and is therefore not necessarily a perfect reflection of dharma. In Sanskrit the conscience is known as antaryamin, \"inner guide,\" or dharmabuddhi, \"moral wisdom.\" Other terms are sadasadvichara shakti, \"good-bad reflective power\" and samjnana, \"right conception.\" It is the subconscious of the person -- the sum total of past impressions and training -- that defines the creedal structure and colors the conscience and either clearly reflects or distorts superconscious wisdom. If the subconscious has been impressed with Western beliefs, for example, of Christianity, Judaism, existentialism or materialism, the conscience will be different than when schooled in the Vedic dharma of Shaktism, Smartism, Saivism or Vaishnavism. This psychological law has to do with the superconscious mind working through the subconscious (an interface known as the subsuperconscious) and explains why the dharma of one's sampradaya must be fully learned as a young child for the conscience to be free of conflict. The Sanatana Dharma, fully and correctly understood, provides the purest possible educational creedal structure, building a subconscious that is a clear, unobstructing channel for superconscious wisdom, the soul's innate intelligence, to be expressed through the conscience. Conscience is thus the sum of two things: the superconscious knowing (which is the same in all people) and the creedal belief structure through which the superconscious flows. This explains why people in different cultures have different consciences.  ","word":"conscience","see_also":["creed","dharma","mind (individual)","yajna","sakshin"],"production_notes":null},{"definition":"Aware, sentient, able to feel and think; the ordinary waking state.   ","word":"conscious","see_also":["creed","dharma","mind (individual)","yajna","sakshin"],"production_notes":null},{"definition":"The everyday, thinking state of mind. We function in the conscious mind during most of our waking hours. One of the five states of mind: conscious, subconscious, sub-subconscious, sub-superconscious & superconscious.   ","word":"conscious mind","see_also":["mind","dharma","mind (individual)","yajna","sakshin"],"production_notes":null},{"definition":"Perception, awareness, apprehension. There are many layers or levels of consciousness ranging from the ordinary, every-day consciousness of our body and mind to omniscient states of superconsciousness. Consciousness aware only of itself is Pure Consciousness.   ","word":"consciousness","see_also":["mind","dharma","mind (individual)","yajna","sakshin"],"production_notes":null},{"definition":"Perception, awareness, apprehension. There are many layers or levels of consciousness ranging from the ordinary, every-day consciousness of our body and mind to omniscient states of superconsciousness. Consciousness aware only of itself is Pure Consciousness.   ","word":"consciousness","see_also":["mind","dharma","mind (individual)","yajna","sakshin"],"production_notes":null},{"definition":"To declare holy, or designate for sacred or religious use.   ","word":"consecrate","see_also":["mind","dharma","mind (individual)","yajna","sakshin"],"production_notes":null},{"definition":"A temple duly and fully established in all three worlds through formal religious ceremony known as kumbhabisheka.   ","word":"consecrated temple","see_also":["mind","dharma","mind (individual)","yajna","sakshin"],"production_notes":null},{"definition":"Government or management by intelligent cooperation, based on a shared vision and adherence to dharma. Ahimsa, nonhurtfulness -- spiritually, physically, emotionally and mentally -- is the keynote of this tribal\/family system of rule.  ","word":"consensualocracy","see_also":["mind","dharma","mind (individual)","yajna","sakshin"],"production_notes":null},{"definition":"Accord; agreement; approval, especially to a proposal.  ","word":"consent","see_also":["mind","dharma","mind (individual)","yajna","sakshin"],"production_notes":null},{"definition":"To make someone feel less sad or disappointed. To comfort.  ","word":"console","see_also":["mind","dharma","mind (individual)","yajna","sakshin"],"production_notes":null},{"definition":"To make stronger by bringing several things into a single whole.  ","word":"consolidate","see_also":["mind","dharma","mind (individual)","yajna","sakshin"],"production_notes":null},{"definition":"Spouse, especially of a king or queen, God or Goddess. Among the Gods there are actually no sexes or sexual distinctions, though in mythological folk narratives Hinduism traditionally represents these great beings in elaborate anthropomorphic depictions. Concepts of matrimony and human-like family units among the Gods are derived from educational intentions to illustrate the way people should and should not live.  ","word":"consort","see_also":["Shakti","dharma","mind (individual)","yajna","sakshin"],"production_notes":null},{"definition":"An element, piece, part or component.    ","word":"constituent","see_also":["Shakti","dharma","mind (individual)","yajna","sakshin"],"production_notes":null},{"definition":"Explain the meaning of; interpret in a certain way.    ","word":"construe","see_also":["Shakti","dharma","mind (individual)","yajna","sakshin"],"production_notes":null},{"definition":"Perfect; complete in every way.  ","word":"consummate","see_also":["Shakti","dharma","mind (individual)","yajna","sakshin"],"production_notes":null},{"definition":"Religious or mystical absorption beyond meditation.  ","word":"contemplation","see_also":["enstasy","raja yoga","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"Inclined toward a spiritual, religious, meditative way of life. ","word":"contemplative","see_also":["enstasy","raja yoga","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"Attitude that considers someone or something as low, worthless. ","word":"contempt","see_also":["enstasy","raja yoga","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"To hold as a belief or assert as fact, especially against scepticism or counter arguments.  ","word":"contend","see_also":["enstasy","raja yoga","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"Striving in controversy or debate.    ","word":"contention","see_also":["enstasy","raja yoga","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"Likely to cause or involving intense debate; quarrelsome.    ","word":"contentious","see_also":["enstasy","raja yoga","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"Restraint, moderation or, most strictly, total abstinence from sexual activity.  ","word":"continence (continent)","see_also":["brahmacharya","raja yoga","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"A continuous whole, quantity, or series; something whose parts cannot be separated or separately discerned.    ","word":"continuum","see_also":["brahmacharya","raja yoga","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"A statement in opposition to another; denial; a condition in which things tend to be contrary to each other. ","word":"contradiction","see_also":["brahmacharya","raja yoga","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"A paradoxical problem, riddle or mystery.    ","word":"conundrum","see_also":["brahmacharya","raja yoga","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"An adverb used to introduce a concept with terms similar to a previous one, but in reversed order or sense.  ","word":"conversely","see_also":["brahmacharya","raja yoga","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"Entering Hinduism has traditionally required little more than accepting and living the beliefs and codes of Hindus. This remains the basic factor of adoption, although there are, and always have been, formal ceremonies recognizing an individual's entrance into the religion, particularly the namakarana, or naming rite. The most obvious sign of true sincerity of adoption or conversion is the total abandoning of the former name and the choosing of the Hindu name, usually a theophoric name derived from the name of a God or Goddess, and then making it legal on one's passport, identity card, social security card and driver's license. This name is used at all times, under all circumstances, particularly with family and friends. This is severance. This is adoption. This is embracing Hinduism. This is conversion. This is true sincerity and considered by born members as the most honorable and trusted testimony of those who choose to join the global congregation of the world's oldest religion. Many temples in India and other countries will ask to see the passport or other legally valid identification before admitting devotees of non-Indian origin for more than casual worship. It requires nothing more than a genuine commitment to the faith. Belief is the keynote of religious conviction, and the beliefs vary greatly among the different religions of the world. What we believe forms our attitudes, shapes our lives and molds our destiny. To choose one's beliefs is to choose one's religion. Those who find themselves at home with the beliefs of Hinduism are, on a simple level, Hindu. Formally entering a new religion, however, is a serious decision. Particularly for those with prior religious ties it is sometimes painful and always challenging.  The acceptance of outsiders into the Hindu fold has occurred for thousands of years. As Swami Vivekananda once said, \"Born aliens have been converted in the past by crowds, and the process is still going on.\" Dr. S. Radhakrishnan confirms the swami's views in a brief passage from his well known book The Hindu View of Life: \"In a sense, Hinduism may be regarded as the first example in the world of a missionary religion. Only its missionary spirit is different from that associated with the proselytizing creeds. It did not regard it as its mission to convert humanity to any one opinion. For what counts is conduct and not belief. Worshipers of different Gods and followers of different rites were taken into the Hindu fold. The ancient practice of vratyastoma, described fully in the Tandya Brahmana, shows that not only individuals but whole tribes were absorbed into Hinduism. Many modern sects accept outsiders. Dvala's Smriti lays down rules for the simple purification of people forcibly converted to other faiths, or of womenfolk defiled and confined for years, and even of people who, for worldly advantage, embrace other faiths.\"  ","word":"conversion to Hinduism","see_also":["Hindu","Hinduism","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"To change from one religion or philosophy to another. A person who has so changed.","word":"convert","see_also":["Hindu","Hinduism","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"A transfer of something; a vehicle.  ","word":"conveyance","see_also":["Hindu","Hinduism","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"British navigator and explorer (1728-1779) who commanded major voyages exploring and claiming many islands of the Pacific Ocean for England in her Christian Colonialist campaign.  ","word":"Cook, Captain James","see_also":["Hindu","Hinduism","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"To contend with on equal terms. To face or deal with difficulties.    ","word":"cope","see_also":["Hindu","Hinduism","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"A natural consequence or effect.    ","word":"corollary","see_also":["Hindu","Hinduism","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"Universal; vast. Of or relating to the cosmos or entire universe.   ","word":"cosmic","see_also":["Hindu","Hinduism","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"One of the infinitely recurring periods of the universe, comprising its creation, preservation and dissolution. These cycles are measured in periods of progressive ages, called yugas. Satya (or Krita), Treta, Dvapara and Kali are the names of these four divisions, and they repeat themselves in that order, with the Satya Yuga being the longest and the Kali Yuga the shortest. The comparison is often made of these ages with the cycles of the day: Satya Yuga being morning until noon, the period of greatest light or enlightenment, Treta Yuga afternoon, Dvapara evening, and Kali Yuga the darkest part of the night. Four yugas equal one mahayuga. Theories vary, but by traditional astronomical calculation, a mahayuga equals 4,320,000 solar years (or 12,000 \"divine years\" (one divine year is 360 solar years) -- with the Satya Yuga lasting 1,728,000 years, Treta Yuga 1,296,000 years, Dvapara Yuga 864,000 years, and Kali Yuga 432,000 years. Mankind is now experiencing the Kali Yuga, which began at midnight, February 18, 3102 BCE (year one on the Hindu calendar [see Hindu Timeline]) and will end in approximately 427,000 years. (By another reckoning, one mahayuga equals approximately two million solar years.) A dissolution called laya occurs at the end of each mahayuga, when the physical world is destroyed by flood and fire. Each destructive period is followed by the succession of creation (srishti), evolution or preservation (sthiti) and dissolution (laya). A summary of the periods in the cosmic cycles: *1 mahayuga = 4,320,000 years (four yugas) *71 mahayugas = 1 manvantara or manu (we are in the 28th mahayuga) *14 manvantaras = 1 kalpa or day of Brahma (we are in the 7th manvantara) *2 kalpas = 1 ahoratra or day and night of Brahma *360 ahoratras = 1 year of Brahma *100 Brahma years = 309,173,760,000,000 years, one \"lifetime\" of Brahma, *or the universe, (we are in Brahma Year 51 of the current cycle.  At the end of every kalpa or day of Brahma a greater dissolution, called pralaya (or kalpanta, \"end of an eon\"), occurs when both the physical and subtle worlds are absorbed into the causal world, where souls rest until the next kalpa begins. This state of withdrawal or \"night of Brahma,\" continues for the length of an entire kalpa until creation again issues forth. After 36,000 of these dissolutions and creations there is a total, universal annihilation, mahapralaya, when all three worlds, all time, form and space, are withdrawn into God Siva. After a period of total withdrawal a new universe or lifespan of Brahma begins. This entire cycle repeats infinitely. This view of cosmic time is recorded in the Puranas and the Dharma Shastras.  ","word":"cosmic cycle","see_also":["mahapralaya","Hinduism","samadhi","yajna","sakshin"],"production_notes":null},{"definition":null,"word":"Cosmic Dance","see_also":["Nataraja","Hinduism","samadhi","yajna","sakshin"],"production_notes":null},{"definition":"Purusha or Parameshvara. Primal Soul. The Universal Being; Personal God.  ","word":"Cosmic Soul","see_also":["Parameshvara","Primal Soul","purusha","Siva","sakshin"],"production_notes":null},{"definition":"\"Cosmos-knowledge.\" The area of metaphysics pertaining to the origin and structure of the universe. Hindu cosmology includes both inner and outer worlds of existence.  ","word":"cosmology","see_also":["tattva","Primal Soul","purusha","Siva","sakshin"],"production_notes":null},{"definition":"The universe, or whole of creation, especially with reference to its order, harmony and completeness.  ","word":"cosmos","see_also":["Brahmanda","loka","tattva","three worlds","sakshin"],"production_notes":null},{"definition":"A binding agreement to do or keep from doing certain things.   ","word":"covenant","see_also":["Brahmanda","loka","tattva","three worlds","sakshin"],"production_notes":null},{"definition":"To want ardently, especially something belonging to another. To envy.  ","word":"covet","see_also":["Brahmanda","loka","tattva","three worlds","sakshin"],"production_notes":null},{"definition":"The ajna, or third-eye center, and the sahasrara, at the top of the head near the pineal and pituitary glands.  ","word":"cranial chakras","see_also":["chakra","loka","tattva","three worlds","sakshin"],"production_notes":null},{"definition":"The skull.    ","word":"cranium","see_also":["chakra","loka","tattva","three worlds","sakshin"],"production_notes":null},{"definition":"A small space, interstice, nook and cranny.    ","word":"cranny","see_also":["chakra","loka","tattva","three worlds","sakshin"],"production_notes":null},{"definition":"The act of creating, especially bringing the world into ordered existence. Also, all of created existence, the cosmos. Creation, according to the monistic-theistic view, is an emanation or extension of God, the Creator. It is Himself in another form, and not inherently something other than Him.  ","word":"creation","see_also":["cause","tattva","tattva","three worlds","sakshin"],"production_notes":null},{"definition":"He who brings about creation. Siva as one of His five powers.  ","word":"creator","see_also":["creation","Nataraja","Parameshvara","three worlds","sakshin"],"production_notes":null},{"definition":"Shraddha dharana. An authoritative formulation of the beliefs of a religion, a community and, by extension, an individual. A creed is meant to summarize the specific teachings or articles of faith, to embody and thus protect and transmit the beliefs. Creeds have arisen historically when a religion was transplanted from its country or region of origin to a new culture. Saiva Siddhanta Church's creed has twelve beliefs and an Affirmation of Faith.   ","word":"creed","see_also":["conscience","Nataraja","Parameshvara","three worlds","sakshin"],"production_notes":null},{"definition":"Dahana. Burning of the dead. Cremation is the traditional system of disposing of bodily remains, having the positive effect of releasing the soul most quickly from any lingering attachment to the earth plane. In modern times, cremation facilities are widely available in nearly every country, though gas-fueled chambers generally take the place of the customary wood pyre. Embalming, commonly practiced even if the body is to be cremated, is ill-advised, as it injures the astral body and can actually be felt by the departed soul, as would an autopsy. Should it be necessary to preserve the body a few days to allow time for relatives to arrive, it is recommended that dry ice surround the body and that the coffin be kept closed. Arrangements for this service should be made well in advance with the mortuary. Note that the remains of enlightened masters are sometimes buried or sealed in a special tomb called a samadhi. This is done in acknowledgement of the extraordinary attainment of such a soul, whose very body, having become holy, is revered as a sacred presence, sannidhya, and which not infrequently becomes the spiritual seed of a temple or place of pilgrimage.  ","word":"cremation","see_also":["bone-gathering","death","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"Any one of numerous mixed, usually subliterary, languages, such as the French creoles spoken in Louisiana or Mauritius. ","word":"creole","see_also":["bone-gathering","death","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"A gradual increase of force or intensity.  ","word":"crescendo","see_also":["bone-gathering","death","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"A narrow opening or crack.  ","word":"crevice","see_also":["bone-gathering","death","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"A deep to vivid purplish red.    ","word":"crimson","see_also":["bone-gathering","death","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"To retreat, bend or crouch in an attitude of fear, especially from something dangerous or painful.  ","word":"cringe","see_also":["bone-gathering","death","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"Sahasrara chakra. The thousand-petaled cranial center of divine consciousness.  ","word":"crown chakra","see_also":["chakra","sahasrara chakra","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"From crux. Essential; decisive; critical.  ","word":"crucial","see_also":["chakra","sahasrara chakra","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"Raw. Not prepared or refined. Lacking grace, tact or taste. Uncultured.  ","word":"crude","see_also":["chakra","sahasrara chakra","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"The essential, deciding or difficult point. Latin \"cross.\" Originally a mark indicating a difficult textual problem in books.    ","word":"crux","see_also":["chakra","sahasrara chakra","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"An underground vault or chamber, often used as a burial place.    ","word":"crypt","see_also":["chakra","sahasrara chakra","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"A mineral, especially a transparent form of quartz, having a crystalline structure.  ","word":"crystal","see_also":["chakra","sahasrara chakra","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"An occult practice for divining the future by gazing into a crystal ball.    ","word":"crystal-gazing","see_also":["chakra","sahasrara chakra","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"To take on a definite, precise, and usually permanent form.  ","word":"crystallize","see_also":["chakra","sahasrara chakra","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"To bring to the highest point, to the greatest intensity, or to completion.    ","word":"culminate","see_also":["chakra","sahasrara chakra","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"Development or refinement of intellect, emotions, interests, manners, and tastes. The ideals, customs, skills and arts of a people or group that are transmitted from one generation to another. Culture is refined living that arises in a peaceful, stable society. Hindu culture arises directly out of worship in the temples. The music, the dance, the art, the subtleties of mannerism and interraction between people all have their source in the humble devotion to the Lord, living in the higher, spiritual nature, grounded in the security of the immortal Self within.   ","word":"culture","see_also":["chakra","sahasrara chakra","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"Difficult to handle due to weight or bulk.    ","word":"cumbersome","see_also":["chakra","sahasrara chakra","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"(Marie Sklodowska Curie, 1867-1934): a Polish chemist and physicist, born in Warsaw. In France, she and her husband Pierre discovered polonium and radium, jointly earning the 1903 Nobel prize in Physics. In 1911 she received the Nobel Prize in Chemistry, becoming the first person to be awarded a second Nobel Prize.  ","word":"Curie, Madame","see_also":["chakra","sahasrara chakra","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"The theoretical study of communication and control processes in biological, mechanical, and electronic systems, especially the comparison of these processes in biological and artificial systems.    ","word":"cybernetics","see_also":["chakra","sahasrara chakra","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"the electronic medium of computer networks in which online communication takes place; the Internet or Web.  ","word":"cyberspace","see_also":["chakra","sahasrara chakra","reincarnation","sannidhya","sakshin"],"production_notes":null},{"definition":"Scornful of motives or integrity; skeptical of others' sincerity.     ","word":"cynical","see_also":["chakra","sahasrara chakra","reincarnation","sannidhya","sakshin"],"production_notes":null}],"results":197}