{"entries":[{"definition":"Pomegranate. ","word":"dadima","see_also":null,"production_notes":null},{"definition":"A fee or honorarium given to a priest at the completion of any rite; also a gift given to gurus as a token of appreciation for their infinite spiritual blessings.  ","word":"dakshina","see_also":null,"production_notes":null},{"definition":"\"South-facing form.\" Lord Siva depicted sitting under a banyan tree, silently teaching four rishis at His feet.  ","word":"Dakshinamurti","see_also":null,"production_notes":null},{"definition":"\"Southern way.\" Names the half-year, ayana, beginning with summer solstice, when the sun begins its apparent southward journey. ","word":"dakshinayana","see_also":null,"production_notes":null},{"definition":"The traditional high priest of Tibetan Buddhism, or Lamaism, a spiritual and political authority. The term is Mongolian: dalai, ocean + blama, chief, \"preceptor with oceanic wisdom.\" An honorary title bestowed by the Mongolian prince Altan Khan on the third head of the Gelukpa school in 1578.  ","word":"Dalai Lama","see_also":null,"production_notes":null},{"definition":"The thin-waisted rattle drum of Siva Nataraja. It is the symbol of Divine Creation, which begins with the soundless sound, paranada, whence arises the mantra Aum.  ","word":"damaru","see_also":["Nataraja","Siva","Aum"],"production_notes":null},{"definition":"\"House master(s).\" An honorific title for husband and wife as the dual masters and sovereign guides of the Hindu home (dama).  ","word":"dampati","see_also":["grihastha dharma","Siva","Aum"],"production_notes":null},{"definition":"\"Giving.\" A traditional niyama, ethical practice, dana is charity, giving creatively without thought of reward, including tithing and feeding the poor.   ","word":"dana","see_also":["yama","niyama","Aum"],"production_notes":null},{"definition":null,"word":"dance","see_also":["Nataraja","tandava","Aum"],"production_notes":null},{"definition":"The first book in Gurudeva's Master Course trilogy. Subtitled Hinduism's Contemporary Catechism, Dancing is a remarkable sourcebook expounding the Saivite Hindu outlook on life in the form of questions and answers. It covers every subject on Saivism, especially the philosophical depths, answers seekers' questions on the nature of God and the Gods, the soul, dharma, life's ultimate goal, Hindu denominations, theology, the satguru, temple worship, karma, spiritual unfoldment, the inner worlds, good and evil, the duties of family life, monastic life and more. It is clearly written and lavishly illustrated, expertly woven with 600 verses from the Vedas, Agamas and other holy texts, 165 South Indian paintings, 40 original graphics, a 40-page timeline of India's history and a 190-page lexicon of English, Sanskrit and Tamil. Released in 1997.  ","word":"Dancing with Siva","see_also":["Nataraja","tandava","Aum"],"production_notes":null},{"definition":"\"Stick,\" or \"staff of support.\" The staff carried by a sadhu or sannyasin, representing the tapas which he has taken as his only support, and the vivifying of sushumna and consequent Realization he seeks. Danda also connotes \"penalty or sanction.\" This sign of authority is one of the emblems of loving Ganesha.  ","word":"danda","see_also":["sannyasin","tandava","Aum"],"production_notes":null},{"definition":"\"Vision, sight.\" Seeing the Divine. Beholding, with inner or outer vision, a temple image, Deity, holy person or place, with the desire to inwardly contact and receive the grace and blessings of the venerated being or beings. Even beholding a photograph in the proper spirit is a form of darshana. Not only does the devotee seek to see the Divine, but to be seen as well, to stand humbly in the awakened gaze of the holy one, even if for an instant, such as in a crowded temple when thousands of worshipers file quickly past the enshrined Lord. Gods and gurus are thus said to \"give\" darshana, and devotees \"take\" darshana, with the eyes being the mystic locus through which energy is exchanged. This direct, personal two-sided apprehension is a central and highly sought-after experience of Hindu faith. Also: \"point of view,\" doctrine or philosophy.    ","word":"darshan (darshana)","see_also":["shad darshana","sound","Aum"],"production_notes":null},{"definition":"Theory of evolution developed by Charles Darwin (1809 -- 1882) stating that plant and animal species develop or evolve from earlier forms due to hereditary transmission of variations that enhance the organism's adaptability and chances of survival.  ","word":"Darwin's theory","see_also":["evolution of the soul","nonhuman birth","Aum"],"production_notes":null},{"definition":"\"Servant's path.\"  ","word":"dasa marga","see_also":["pada","nonhuman birth","Aum"],"production_notes":null},{"definition":"Ten spiritual experiences of the soul in its path toward liberation, as found in the University of Madras Tamil Lexicon. 1) Tattuvarupam: the cognition of the operation of the 36 tattvas; 2) Tattuvatarisanam: the realization that the 36 tattvas are the outcome of maya; 3) Tattuvasutti: the soul's experience of no longer being influenced by the 36 tattvas and knowing itself to be an entity different from them; 4) Anmarupam: the soul's discovery, when free of impurity, that its form is intelligence; 5) Anmatarisanam: the soul's perception that it cannot act independently of Siva; 6) Anmasutti: the soul's self-effacement and establishment in divine grace; 7) Sivarupam: the clear understanding that Siva, by His five gracious functions, cleanses the soul of the three malas and bestows liberation; 8) Sivatarisanam: the soul's cognition of its limitations and perception of the divine wisdom that, of its own accord, bestows grace; 9) Sivayogam: the soul's realization of the omnitude of Siva and setting itself in tune with Him without losing its individuality; 10) Sivapokam: the merger of the soul's individuality in Siva, the Supreme Being.    ","word":"Dasakariyam","see_also":["pada","nonhuman birth","Aum"],"production_notes":null},{"definition":"\"One-tenth-part vow.\" A promise that tithers make before God, Gods and their family or peers to tithe regularly each month, for a specified time, or for life. See also: dashamamsha.  ","word":"dashama bhaga vrata","see_also":["pada","nonhuman birth","Aum"],"production_notes":null},{"definition":"\"One-tenth sharing.\" The traditional Hindu practice of tithing, giving one-tenth of one's income to a religious institution. It was formerly widespread in India. In ancient times the term makimai was used in Tamil Nadu. See also: dashama bhaga vrata.  ","word":"dashamamsha","see_also":["pada","nonhuman birth","Aum"],"production_notes":null},{"definition":"\"Ten names.\" Ten monastic orders organized by Adi Sankara (ca 800): Aranya, Vana, Giri, Parvata, Sagara, Tirtha, Ashrama, Bharati, Puri and Sarasvati. Also refers to sannyasins of these orders, each of whom bears his order's name, with ananda often attached to the religious name. For example, Ramananda Tirtha. Traditionally, each order is associated with one of the main Shankaracharya pithas, or centers.  ","word":"Dashanami","see_also":["Sankara","Shankaracharya pitha","Smarta Sampradaya"],"production_notes":null},{"definition":"Not intimidated or discouraged; fearless.  ","word":"dauntless","see_also":["Sankara","Shankaracharya pitha","Smarta Sampradaya"],"production_notes":null},{"definition":"\"Mental pain, dejection, anxiety, sorrow, depression, melancholy and despair.\"  ","word":"daurmanasya","see_also":["chakra","Shankaracharya pitha","Smarta Sampradaya"],"production_notes":null},{"definition":"One kalpa, or period, in the infinitely recurring periods of the universe's creation, preservation and dissolution. One day of Brahma is equal to 994 mahayugas (a mahayuga is one cycle of the four yugas: Satya, Treta, Dvapara and Kali). This is calculated as 4,294,080,000 years. After each day of Brahman occurs a pralaya (or kalpanta, \"end of an eon\"), when both the physical and subtle worlds are absorbed into the causal world. This state of withdrawal, or \"night of Brahma,\" continues for the length of an entire kalpa until creation again issues forth. ","word":"day of Brahma","see_also":["chakra","Shankaracharya pitha","Smarta Sampradaya"],"production_notes":null},{"definition":"\"Compassion.\" Among the traditional yamas, moral restraints, daya is conquering callous, cruel and insensitive feelings toward all beings.   ","word":"daya","see_also":["chakra","Shankaracharya pitha","Smarta Sampradaya"],"production_notes":null},{"definition":"\"Compassion.\" Among the traditional yamas, moral restraints, daya is conquering callous, cruel and insensitive feelings toward all beings.   ","word":"daya","see_also":["chakra","Shankaracharya pitha","Smarta Sampradaya"],"production_notes":null},{"definition":"Death is a rich concept for which there are many words in Sanskrit, such as: mahaprasthana, \"great departure;\" samadhimarana, dying consciously while in the state of meditation; mahasamadhi, \"great merger, or absorption,\" naming the departure of an enlightened soul. Hindus know death to be the soul's detaching itself from the physical body and continuing on in the subtle body (sukshma sharira) with the same desires, aspirations and activities as when it lived in a physical body. Now the person exists in the in-between world, the subtle plane, or Antarloka, with loved ones who have previously died, and is visited by earthly associates during their sleep. Hindus do not fear death, for they know it to be one of the most glorious and exalted experiences, rich in spiritual potential. Other terms for death include panchatvam (death as dissolution of the five elements), mrityu (natural death), prayopavesha (self-willed death by fasting), marana (unnatural death, e.g., by murder).  ","word":"death","see_also":["reincarnation","suicide","videhamukti"],"production_notes":null},{"definition":"Decay. A condition, process or period of declining morals.  ","word":"decadence","see_also":["reincarnation","suicide","videhamukti"],"production_notes":null},{"definition":"The act of representing as true what is known to be false. A dishonest action.     ","word":"deceit (deception)","see_also":["reincarnation","suicide","videhamukti"],"production_notes":null},{"definition":"Whose administrative agencies, power, authority, etc., are distributed widely, rather than concentrated in a single place or person. In Hinduism, authority is decentralized.  ","word":"decentralized","see_also":["reincarnation","suicide","videhamukti"],"production_notes":null},{"definition":"To read or interpret ambiguous, obscure, or illegible matter.  ","word":"decipher","see_also":["reincarnation","suicide","videhamukti"],"production_notes":null},{"definition":"Covered with fine clothing or ornaments.  ","word":"decked","see_also":["reincarnation","suicide","videhamukti"],"production_notes":null},{"definition":"Propriety and good taste in behavior, speech, dress, etc. ","word":"decorum","see_also":["reincarnation","suicide","videhamukti"],"production_notes":null},{"definition":"Drawing a conclusion through reasoning; the act of deducing.    ","word":"deduction","see_also":["reincarnation","suicide","videhamukti"],"production_notes":null},{"definition":"To take apart; disassemble.     ","word":"defabricate","see_also":["reincarnation","suicide","videhamukti"],"production_notes":null},{"definition":"Polluted, made dirty, impure.  ","word":"defiled","see_also":["reincarnation","suicide","videhamukti"],"production_notes":null},{"definition":"Condition of being disfigured or made ugly in body, mind or emotions.   ","word":"deformity","see_also":["reincarnation","suicide","videhamukti"],"production_notes":null},{"definition":"\"Body.\" From the verb dih, \"to plaster, mold; anoint, fashion.\" A term used in the Upanishads, yoga texts, Saiva Agamas, Tirumantiram and elsewhere to name the three bodies of the soul: gross or physical (sthula), astral or subtle (sukshma) and causal (karana). A synonym for sharira.  ","word":"deha","see_also":["sharira","suicide","videhamukti"],"production_notes":null},{"definition":"From the Latin, Deus, \"God.\" A rationalist tradition dating back to English Lord Herbert of Cherbury (d. 1648), who defined the Five Articles of English Deists as: belief in a single supreme God; humanity's duty to revere God; linkage of worship with practical morality; that God will forgive us if we repent and abandon our sins; good works will be rewarded (and evil punished) both in life and after death. Deism rejects reliance on revealed religion, on religious authority and on the infallibility of scriptures such as the Bible and the Koran. Deism has no special places of worship, no priesthood and no heirachy of authority. Deism was greatly influential among politicians, scientists and philosophers during the later 17th century and 18th century in England, France, Germany and the United States. Many of America's founding fathers were Deists, including John Quincy Adams, Benjamin Franklin, Thomas Jefferson, James Madison and George Washington. Deists were instrumental in creating the principle of separation of church and state, and the religious freedom clauses of the First Amendment. Source: www.religioustolerance.org\/deism.  ","word":"Deism","see_also":["sharira","suicide","videhamukti"],"production_notes":null},{"definition":"\"God.\" Can refer either to the image or murti installed in a temple or to the Mahadeva the murti represents.  ","word":"Deity","see_also":["puja","suicide","videhamukti"],"production_notes":null},{"definition":"To mark or trace out the boundaries of a thing, concept, etc.  ","word":"delineate","see_also":["puja","suicide","videhamukti"],"production_notes":null},{"definition":"Failing to do what law or duty requires.    ","word":"delinquent","see_also":["puja","suicide","videhamukti"],"production_notes":null},{"definition":"To deceive, as by false promises or misleading concepts or thinking.   ","word":"delude","see_also":["puja","suicide","videhamukti"],"production_notes":null},{"definition":"Moha. False belief, misconception.    ","word":"delusion","see_also":["puja","suicide","videhamukti"],"production_notes":null},{"definition":"To lower in status or character; degrade. ","word":"demean","see_also":["puja","suicide","videhamukti"],"production_notes":null},{"definition":null,"word":"demon","see_also":["asura","suicide","videhamukti"],"production_notes":null},{"definition":"Decorousness, modesty, shyness, reserved manner. ","word":"demureness","see_also":["asura","suicide","videhamukti"],"production_notes":null},{"definition":"Saying \"no.\" Opposing or not believing in the truth of something.   ","word":"denial","see_also":["asura","suicide","videhamukti"],"production_notes":null},{"definition":"A name for a class of things, especially for various religious groupings, sects and subsects.  ","word":"denomination","see_also":["parampara","sampradaya","videhamukti"],"production_notes":null},{"definition":"To indicate, signify or refer to.    ","word":"denote","see_also":["parampara","sampradaya","videhamukti"],"production_notes":null},{"definition":"To be regretful or sorry about; to lament, disapprove.  ","word":"deplore","see_also":["parampara","sampradaya","videhamukti"],"production_notes":null},{"definition":"To spread out; arrange into an effective pattern.  ","word":"deploy","see_also":["parampara","sampradaya","videhamukti"],"production_notes":null},{"definition":"To eliminate or counteract polarization. Bringing together that which is apart.  -- Polarize:  to separate into diametrically opposed, often antagonistic groups, viewpoints, etc. ","word":"depolarize","see_also":["parampara","sampradaya","videhamukti"],"production_notes":null},{"definition":"The manner of bearing or conducting oneself; behavior.  ","word":"deportment","see_also":["parampara","sampradaya","videhamukti"],"production_notes":null},{"definition":"Immoral; corrupt; bad; perverted.  ","word":"depraved","see_also":["parampara","sampradaya","videhamukti"],"production_notes":null},{"definition":"Forced conditions of loss or neediness. ","word":"deprivations","see_also":["parampara","sampradaya","videhamukti"],"production_notes":null},{"definition":"To take away.    ","word":"derogate","see_also":["parampara","sampradaya","videhamukti"],"production_notes":null},{"definition":"Having a longing or desire.  ","word":"desirous","see_also":["parampara","sampradaya","videhamukti"],"production_notes":null},{"definition":"The state of having lost or given up hope.  ","word":"despair","see_also":["parampara","sampradaya","videhamukti"],"production_notes":null},{"definition":"To strongly dislike; look down upon with contempt or scorn.  ","word":"despise","see_also":["parampara","sampradaya","videhamukti"],"production_notes":null},{"definition":"Final outcome. The seemingly inevitable or predetermined course of events.  ","word":"destiny","see_also":["adrishta","fate","karma"],"production_notes":null},{"definition":"Epithet of God Siva in His aspect of Rudra.  ","word":"Destroyer","see_also":["Nataraja","fate","karma"],"production_notes":null},{"definition":"To keep one from doing something by instilling fear, anxiety, doubt, etc. ","word":"deter","see_also":["Nataraja","fate","karma"],"production_notes":null},{"definition":"Something that prevents or discourages action; frightens away.    ","word":"deterrent","see_also":["Nataraja","fate","karma"],"production_notes":null},{"definition":"One who takes away from the positive qualities of a group.    ","word":"detractor","see_also":["Nataraja","fate","karma"],"production_notes":null},{"definition":"\"Shining one.\" An angelic being living in the higher astral plane, in a subtle, nonphysical body. Deva is also used in scripture to mean \"God\" or \"Deity.\" ","word":"deva","see_also":["Mahadeva","fate","karma"],"production_notes":null},{"definition":"\"Plane of radiant beings.\" A synonym of Maharloka, the higher astral plane, realm of anahata chakra.  The higher Second World, wherein souls take on astral or mental bodies; deep within the First World.   ","word":"Devaloka","see_also":["loka","fate","karma"],"production_notes":null},{"definition":"\"Abode of celestial beings.\" From mand, \"to stand or tarry.\" A Hindu temple; also simply mandira.  ","word":"devamandira","see_also":["temple","fate","karma"],"production_notes":null},{"definition":"\"Divine city [script].\" The alphabetic script in which Sanskrit, Prakrit, Hindi and Marathi are written. A descendant of the Northern type of the Brahmi script. It is characterized by the connecting horizontal line at the top of the letters. See also: Sanskrit. ","word":"Devanagari","see_also":["temple","fate","karma"],"production_notes":null},{"definition":"The collected devotional hymns composed by Saints Tirujnana Sambandar (ca 600) Tirunavakarasu (Appar), a contemporary of Sambandar, and Sundaramurti (ca 800). These make up the first seven books of the Tirumurai. ","word":"Devaram","see_also":["Tirumurai","fate","karma"],"production_notes":null},{"definition":"\"Goddess.\" A name of Shakti, used especially in Shaktism.  ","word":"Devi","see_also":["Shakti","Shaktism","karma"],"production_notes":null},{"definition":"A subsidiary text of the Siva Puranas.  ","word":"Devi Bhagavata Purana","see_also":["Shakti","Shaktism","karma"],"production_notes":null},{"definition":"Twelve chapters (29 to 40) from the 7th book of Shrimad Devi Bhagavatam, a Shakta scripture. It teaches external worship of the Deity with form and meditation on the Deity beyond form.   ","word":"Devi Gita","see_also":["Shakti","Shaktism","karma"],"production_notes":null},{"definition":"A Shakta Upanishad dealing with the nature and worship of the Goddess.  ","word":"Devi Upanishad","see_also":["Shaktism","Shaktism","karma"],"production_notes":null},{"definition":"One recension (edition) of the Sardha Trishati Kalottara Agama, a subsidiary text of Vatula Agama. Also known as Skanda Kalottara, its 350 verses are in the form of a dialog between Karttikeya and Siva and deal with esoterics of mantras, initiations, right knowledge, faith and worship of Siva.  ","word":"Devikalottara Agama","see_also":["Saiva Agamas","Shaktism","karma"],"production_notes":null},{"definition":"Completely without; empty.  ","word":"devoid","see_also":["Saiva Agamas","Shaktism","karma"],"production_notes":null},{"definition":"Angelic, heavenly, spiritual. Of the nature of the higher worlds, in tune with the refined energies of the higher chakras or centers of consciousness. Of or relating to the devas. Implies that something is divinely guided. ","word":"devonic","see_also":["deva","Shaktism","karma"],"production_notes":null},{"definition":"A person strongly dedicated to something or someone, such as to a God or a guru. Often used interchangeably with disciple, though the latter term generally implies a deeper commitment.   ","word":"devotee","see_also":["deva","Shaktism","karma"],"production_notes":null},{"definition":"Strongly attached to religion or religious obligations.  ","word":"devout","see_also":["bhakti","Shaktism","karma"],"production_notes":null},{"definition":"The holy book of Buddhism.  ","word":"Dhammapada","see_also":["Buddhism","Shaktism","karma"],"production_notes":null},{"definition":"\"Science of archery.\" A class of ancient texts on the military arts, comprising the Upaveda of the Yajur Veda. Dhanurveda teaches concentration, meditation, hatha yoga, etc., as integral to the science of warfare.  ","word":"Dhanurveda","see_also":["Upaveda","Shaktism","karma"],"production_notes":null},{"definition":"\"Bow.\"Anything bow shaped; a weapon for shooting arrows. ","word":"dhanush","see_also":["Upaveda","Shaktism","karma"],"production_notes":null},{"definition":"\"Concentration.\" From dhri, \"to hold.\"  ","word":"dharana","see_also":["meditation","raja yoga","shraddadharana","yoga"],"production_notes":null},{"definition":"\"Righteousness.\" From dhri, \"to sustain; carry, hold.\" Hence dharma is \"that which contains or upholds the cosmos.\" Dharma, religion, is a complex and comprehensive term with many meanings, including divine law, law of being, way of righteousness, ethics, duty, responsibility, virtue, justice, goodness and truth. Essentially, dharma is the orderly fulfillment of an inherent nature or destiny. Relating to the soul, it is the mode of conduct most conducive to spiritual advancement, the right and righteous path. There are four principal kinds of dharma, known collectively as chaturdharma, \"four religious laws:\" 1 ) rita: \"Universal law.\" The inherent order of the cosmos. 2 ) varna dharma: \"Law of one's kind.\" Social duty. 3 ) ashrama dharma: \"Duties of life's stages.\" Human or developmental dharma. The natural process of maturing from childhood to old age through fulfillment of the duties of each of the four stages of life -- brahmachari (student), grihastha (householder), vanaprastha (elder advisor) and sannyasa (religious solitaire). 4 ) svadharma: \"Personal path, pattern or obligation.\" One's perfect individual pattern through life, according to one's own particular physical, mental and emotional nature. ","word":"dharma","see_also":["four traditional goals","raja yoga","shraddadharana","yoga"],"production_notes":null},{"definition":"\"Religious jurisprudence.\" All or any of the numerous codes of Hindu civil and social law composed by various authorities. The best known and most respected are those by Manu and Yajnavalkya, thought to have been composed as early as 600 BCE. The Dharma Shastras, along with the Artha Shastras, are the codes of Hindu law, parallel to the Jewish Talmud and the Muslim Sharia, each of which provides guidelines for kings, ministers, judicial systems and law enforcement agencies. These spiritual and ethical codes differ from European and American law, which separate religion from politics. (Contemporary British law is influenced by Anglican Christian thought, just as American democracy was, and is, profoundly affected by the philosophy of the non-Christian, Deistic philosophy of its founders.) The Dharma Shastras also speak of much more, including creation, initiation, the stages of life, daily rites, duties of husband and wife, caste, Vedic study, penances and transmigration. The Dharma Shastras are part of the Smriti literature, included in the Kalpa Vedanga, and are widely available today in many languages.  ","word":"Dharma Shastra","see_also":["Deism","Manu Dharma Shastras","shraddadharana","yoga"],"production_notes":null},{"definition":"A monastery and spiritual center in South India, established in the 16th century by Sri Guru Jnanasambandhar. This aadheenam preaches pluralistic Siddhanta, as opposed to monistic Siddhanta or monistic theism.  ","word":"Dharmapura Aadheenam","see_also":["aadheenam","Manu Dharma Shastras","shraddadharana","yoga"],"production_notes":null},{"definition":"\"Religious assembly, congregation.\" A church.  ","word":"dharmasabha","see_also":["aadheenam","Manu Dharma Shastras","shraddadharana","yoga"],"production_notes":null},{"definition":"\"Abode of righteousness.\" A monastery or ashrama, offering religious training for monks and in some cases lay persons on pilgrimage or religious retreat. In Living with Siva, it specifically refers to branch monasteries of Kauai Aadheenam.  ","word":"dharmashala","see_also":["aadheenam","Manu Dharma Shastras","shraddadharana","yoga"],"production_notes":null},{"definition":"(Hindi) A long, unstitched cloth wound about the lower part of the body, and sometimes passed between the legs and tucked into the waist. A traditional Hindu apparel for men.  ","word":"dhoti","see_also":["veshti","Manu Dharma Shastras","shraddadharana","yoga"],"production_notes":null},{"definition":"\"Steadfastness, constancy.\" Among the traditional yamas, dhriti is overcoming non-perseverance, fear, indecision and changeableness, keeping the mind and emotions steady through all circumstances.  ","word":"dhriti","see_also":["yama","niyama","shraddadharana","yoga"],"production_notes":null},{"definition":"\"Smoke-colored.\" Ganesha's aspect as the conqueror of abhimana, pride. ","word":"Dhumravarna","see_also":["yama","niyama","shraddadharana","yoga"],"production_notes":null},{"definition":"\"Ganesha, the sought-after,\" enshrined in Varanasi, having four arms, an axe, prayer beads, tusk and a pot of gems. ","word":"Dhundhi Ganapati","see_also":["yama","niyama","shraddadharana","yoga"],"production_notes":null},{"definition":"\"Flag.\" Part of the pageantry of Hinduism, orange or red flags and banners, flown at festivals and other special occasions symbolize the victory of Sanatana Dharma.  ","word":"dhvaja","see_also":["festival","niyama","shraddadharana","yoga"],"production_notes":null},{"definition":"\"Flag tree, flagpole.\" (Kodimaram in Tamil.) A tall cylindrical post usually behind the vahana in Agamic temples. Metaphysically, it acts as the complementary pole to the enshrined murti. These two together create an energy field to contain the temple's power.  ","word":"dhvajastambha","see_also":["temple","niyama","shraddadharana","yoga"],"production_notes":null},{"definition":"\"Meditation.\"  ","word":"dhyana","see_also":["internalized worship","meditation","raja yoga","yoga"],"production_notes":null},{"definition":"Very wicked or cruel; devilish.  ","word":"diabolical","see_also":["internalized worship","meditation","raja yoga","yoga"],"production_notes":null},{"definition":"Exactly opposite; contrary.    ","word":"diametrically","see_also":["internalized worship","meditation","raja yoga","yoga"],"production_notes":null},{"definition":"The muscular partition between the abdomen and chest cavity, instrumental in breathing.  ","word":"diaphragm","see_also":["internalized worship","meditation","raja yoga","yoga"],"production_notes":null},{"definition":"Deep regulated breathing from the diaphragm, at the solar plexus region, as opposed to the upper chest.    ","word":"diaphragmatic breathing","see_also":["internalized worship","meditation","raja yoga","yoga"],"production_notes":null},{"definition":"From the Greek, \"scattering.\" A dispersion of religious or ethnic group(s) to foreign countries, such as the scattering of Jews when driven out of the land of Israel, or Hindus driven from Sri Lanka, Pakistan and Bangladesh.  ","word":"diaspora","see_also":["internalized worship","meditation","raja yoga","yoga"],"production_notes":null},{"definition":"A division into two parts, usually sharply distinguished or contradictory.  ","word":"dichotomy","see_also":["paradox","meditation","raja yoga","yoga"],"production_notes":null},{"definition":"French for \"God Siva is Immanent Love and Transcendent Reality.\" It is an affirmation of faith which capsulizes the entire creed of monistic Saiva Siddhanta.  ","word":"Dieu Siva est amour omnipresent et Realite transcendante","see_also":["paradox","meditation","raja yoga","yoga"],"production_notes":null},{"definition":"State or condition of making or perceiving a difference.   ","word":"differentiation","see_also":["paradox","meditation","raja yoga","yoga"],"production_notes":null},{"definition":"(Shum) The space aspect of the mind. The perspective of space travel, devas and Gods; inner communication. Pronounced dee-fee.  ","word":"difi","see_also":["Shum","meditation","raja yoga","yoga"],"production_notes":null},{"definition":"\"Initiation.\" Solemn induction by which one is entered into a new realm of spiritual awareness and practice by a teacher or preceptor through bestowing of blessings. Denotes initial or deepened connection with the teacher and his lineage and is usually accompanied by ceremony. Initiation, revered as a moment of awakening, may be conferred by a touch, a word, a look or a thought. As the aspirant matures, he may receive deeper initiations, each one drawing him further into his spiritual being. Most Hindu schools, and especially Saivism, teach that only with initiation from a satguru is enlightenment attainable. Sought after by all Hindus is the diksha called shaktipata, \"descent of grace,\" which, often coming unbidden, stirs and arouses the mystic kundalini force. Central Saivite dikshas include samaya, vishesha, nirvana and abhisheka.  ","word":"diksha","see_also":["grace","shaktipata","sound","yoga"],"production_notes":null},{"definition":"Hereditary Sivacharya temple priests of Chidambaram Temple in Tamil Nadu.","word":"dikshitar","see_also":["priest","Sivacharya","sound","yoga"],"production_notes":null},{"definition":"Painstaking, careful and constant in effort.     ","word":"diligent","see_also":["priest","Sivacharya","sound","yoga"],"production_notes":null},{"definition":"To change or weaken by mixing with something else. ","word":"dilute","see_also":["priest","Sivacharya","sound","yoga"],"production_notes":null},{"definition":"\"Standing light.\" A standing lamp found in the temple, shrine room or home. It is made of metal, with several wicks fed by ghee or special oils. Used to light the home and in puja, part of temple and shrine altars, the standing lamp is sometimes worshiped as the divine light, Parashakti or Parajyoti. Returning from the temple and lighting one's dipastambha courts the accompanying devas to remain in the home and channels the vibration of the temple sanctum sanctorum into the home shrine. Kuttuvilaku in Tamil. ","word":"dipastambha","see_also":["priest","Sivacharya","sound","yoga"],"production_notes":null},{"definition":"Often spelled Divali. \"Row of Lights.\" A very popular home and community festival in October\/November when Hindus of all denominations light oil or electric lights and set off fireworks in a joyful celebration of the victory of good over evil and light over darkness. It is a Hindu solidarity day and is considered the greatest national festival of India. In several countries, such as Nepal, Malaysia, Singapore, Sri Lanka, Trinidad and Tobago, it is an inter-religious event and a national holiday.   ","word":"Dipavali","see_also":["priest","Sivacharya","sound","yoga"],"production_notes":null},{"definition":"Tact and skill in dealing with people.  ","word":"diplomacy","see_also":["priest","Sivacharya","sound","yoga"],"production_notes":null},{"definition":"Relating to two poles instead of only one. A philosophy is said to be dipolar when it embraces both of two contradictory (or apparently contradictory) propositions, concepts, tendencies, etc. For example, panentheism is dipolar in that it accepts the truth of God's being (and being in) the world, and also the truth that He transcends the world. Instead of saying \"it is either this or that,\" a dipolar position says \"it is both this and that.\"  ","word":"dipolar","see_also":["dvaita-advaita","Sivacharya","sound","yoga"],"production_notes":null},{"definition":"To distinguish, discriminate and make balanced judgments.    ","word":"discern","see_also":["dvaita-advaita","Sivacharya","sound","yoga"],"production_notes":null},{"definition":"Not in accord. Disagreeing; clashing; out of harmony.  ","word":"discordant","see_also":["dvaita-advaita","Sivacharya","sound","yoga"],"production_notes":null},{"definition":"Viveka. Act or ability to distinguish or perceive differences. In spirituality, the ability to distinguish between right and wrong, real and apparent, eternal and transient, as in the Upanishadic maxim, Neti, neti, \"It is not this, it is not that.\"  ","word":"discrimination","see_also":["conscience","Sivacharya","sound","yoga"],"production_notes":null},{"definition":"Regard or treat as beneath one's dignity, as being unworthy.    ","word":"disdain","see_also":["conscience","Sivacharya","sound","yoga"],"production_notes":null},{"definition":"Untidy hair, clothing or general appearance. Rumpled.  ","word":"disheveled","see_also":["conscience","Sivacharya","sound","yoga"],"production_notes":null},{"definition":"Having no physical body; of the astral plane; astral beings.  ","word":"disincarnate","see_also":["astral body","astral plane","sound","yoga"],"production_notes":null},{"definition":"Loss of courage or confidence before danger. Fearful worry.  ","word":"dismay","see_also":["astral body","astral plane","sound","yoga"],"production_notes":null},{"definition":"Free from emotion or passion. Calm; impartial; detached.  ","word":"dispassionate","see_also":["astral body","astral plane","sound","yoga"],"production_notes":null},{"definition":"To send off promptly, especially on an errand. To finish quickly.    ","word":"dispatch","see_also":["astral body","astral plane","sound","yoga"],"production_notes":null},{"definition":"To cause to go in various directions. To scatter and drive away; disperse.  ","word":"dispel","see_also":["astral body","astral plane","sound","yoga"],"production_notes":null},{"definition":"A lengthy, thorough, formal treatment of a subject in writing or speech; a thesis.    ","word":"dissertation","see_also":["astral body","astral plane","sound","yoga"],"production_notes":null},{"definition":"Disagreement; dissent.    ","word":"dissidence","see_also":["astral body","astral plane","sound","yoga"],"production_notes":null},{"definition":"Here, to let loose more than often the vital sexual energies, which must be transmuted in order to make progress in spiritual life. Dissipation occurs through excessive talk, and through loss of the vital fluids, such as through masturbation or excessive intercourse only for pleasure, with no intention of conceiving a child. In one explanation of ancient India's caste system, strength -- mental, emotional and physical as well as spiritual -- is directly related to the frequency of orgasms. A shudra (laborer), releases his sexual energies daily and thus drains his brain. The vaishya (businessman) has sex weekly, as his energies are caught up in the mental activities of his business. The kshatriya (politician, defender of the country), engaged in statesmanship, martial arts, horsemanship, developing mind and body, expends his energies but monthly. The brahmin (priestly caste) has sexual union yearly, and only for the creation of a child. His energies are transmuted in his Sanskrit chanting, daily rituals and high-minded activities of all kind to uplift humanity. Thus, dissipation is on many levels and creates many kinds of people, according to the four levels of consciousness.  ","word":"dissipate","see_also":["ojas","tejas","yoni","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Dissolving or breaking up into parts. An alternative term for destruction.  ","word":"dissolution","see_also":["absorption","mahapralaya","Nataraja","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"To twist out of shape. To misrepresent.   ","word":"distort","see_also":["absorption","mahapralaya","Nataraja","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":null,"word":"Divali","see_also":["Dipavali","mahapralaya","Nataraja","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Going off in different directions; deviating or varying.  ","word":"divergent","see_also":["Dipavali","mahapralaya","Nataraja","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"To strip of, deprive or rid of something.    ","word":"divest","see_also":["Dipavali","mahapralaya","Nataraja","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Godlike; supremely good or beautiful.  ","word":"Divine","see_also":["Dipavali","mahapralaya","Nataraja","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Shakti, especially as Personal Goddess, as conceived of and worshiped by Shaktas.  ","word":"Divine Mother","see_also":["Shakti","Shaktism","Nataraja","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"A God, or Deity. Also the spirituality or holiness that pervades the universe and is most easily felt in the presence of a holy man or in a temple.  ","word":"Divinity","see_also":["Shakti","Shaktism","Nataraja","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Causing division, especially causing disagreement or dissension. ","word":"divisive","see_also":["Shakti","Shaktism","Nataraja","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Deoxyribonucleic Acid. A nucleic acid that carries the genetic information in the cell. DNA consists of two long chains of nucleotides twisted into a double helix. The sequence of nucleotides determines individual hereditary characteristics.    ","word":"DNA","see_also":["Shakti","Shaktism","Nataraja","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Easy to teach, tractable, obedient. ","word":"docile","see_also":["Shakti","Shaktism","Nataraja","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"An authoritative principle, belief, or statement of ideas or opinion, especially one considered to be absolutely true.    ","word":"dogma","see_also":["Shakti","Shaktism","Nataraja","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Rulership; domain; sway.  -- hold dominion over:  To be king, ruler, lord, or master of (a world, realm, etc).","word":"dominion","see_also":["Shakti","Shaktism","Nataraja","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"To put on (a piece of clothing).  ","word":"don","see_also":["Shakti","Shaktism","Nataraja","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Brahmarandhra, also called nirvana chakra. A subtle or esoteric aperture in the crown of the head, the opening of sushumna nadi through which kundalini enters in ultimate Self Realization, and the spirit escapes at death. Only the spirits of the truly pure leave the body in this way. Samsaris take a downward course.  ","word":"door of Brahman","see_also":["jnana","kundalini","videhamukti","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"\"Vision from afar.\" Hindi for television.  ","word":"doordarshan (durdarshana)","see_also":["jnana","kundalini","videhamukti","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Sleeping; inactive; not functioning.   ","word":"dormant","see_also":["jnana","kundalini","videhamukti","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"An Indian crepe, a crisp, paper-thin pancake, generally made with soaked, slightly fermented ground rice and urad dal, water and spices.  ","word":"dosai","see_also":["jnana","kundalini","videhamukti","actinic","actinodic","odic","transmutation"],"production_notes":null},{"definition":"\"Bodily humor; individual constitution.\" The three bodily humors, which according to ayurveda regulate the body, govern its proper functioning and determine its unique constitution. These are vata, the air humor; pitta, the fire humor; and kapha, the water humor. Vata has its seat in the intestinal area, pitta in the stomach, and kapha in the lung area. They govern the creation, preservation and dissolution of bodily tissue. Vata humor is metabolic, nerve energy. Pitta is the catabolic, fire energy. Kapha is the anabolic, nutritive energy. The three doshas (tridosha) also give rise to the various emotions and correspond to the three gunas, \"qualities:\" sattva (quiescence -- vata), rajas (activity -- pitta) and tamas (inertia -- kapha).  ","word":"dosha","see_also":["ayurveda","kapha","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"A comprehensive collection of documents about a subject or person. ","word":"dossier","see_also":["ayurveda","kapha","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Money or property brought by a bride to her husband at marriage. A tradition that exists in most cultures in some form, but which in India has been carried to abusive extremes, where the bride's family must pay exorbitant sums of money to the groom's family to buy a husband for their daughter. Dowry is outlawed now in India.  ","word":"dowry","see_also":["ayurveda","kapha","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Praising, or gloriying. ","word":"doxology","see_also":["ayurveda","kapha","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"The term used here to name the monastic communities of the Dvapara and Kali Yugas. In modern times it refers to the various Caucasoid peoples of southern India and northern Sri Lanka. From the Sanskrit Dravida, of which it is believed the original form was Dramid (or Dramil), which meant \"sweet\" or \"good natured,\" and is the source of the word Tamil, naming the Dravidian people of South India and Sri Lanka and their language.    ","word":"Dravidian","see_also":["ayurveda","kapha","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"One who studies and interprets dreams (a coined word).    ","word":"dreamologist","see_also":["ayurveda","kapha","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Rubbish, waste matter; a useless byproduct.    ","word":"dross","see_also":["ayurveda","kapha","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Work that may be tedious, menial, hard or unpleasant.  ","word":"drudgery","see_also":["ayurveda","kapha","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"An ancient Celtic priest, magician or soothsayer of Britain, Ireland and Gaul (ancient region corresponding roughly to modern-day France and Belgium).  ","word":"Druid","see_also":["ayurveda","kapha","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Beliefs of members of an order of priests in ancient Gaul and Britain who appear in Welsh and Irish legend as prophets and sorcerers.    ","word":"Druidism","see_also":["ayurveda","kapha","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Having or composed of two parts or kinds. -- duality: A state or condition of being dual.","word":"dual","see_also":["ayurveda","kapha","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Opposite of monism. Any doctrine which holds that there are two eternal and distinct realities inthe universe, e.g., God-world, good-evil. ","word":"dualism","see_also":["ayurveda","kapha","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"A state or condition of being dual.    ","word":"duality","see_also":["ayurveda","kapha","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"The endocrine glands which release hormones to regulate many functions of the body.    ","word":"ductless glands","see_also":["ayurveda","kapha","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"At the proper time, in the proper manner; as required.  ","word":"duly","see_also":["ayurveda","kapha","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"\"She who is incomprehensible or difficult to reach.\" A form of Shakti worshiped in Her gracious as well as terrifying aspect. Destroyer of demons, She is worshiped during an annual festival called Durga puja, especially popular among Bengalis.  ","word":"Durga","see_also":["Shakti","Shaktism","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"The \"invincible,\" \"unconquerable\" fortress or stronghold. An eight-armed murti distinguished by the flag of victory, bow and arrow and strand of prayer beads. ","word":"Durga Ganapati","see_also":["Shakti","Shaktism","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"A type of grass, also called aruhu and harali, sacred to Ganesha, traditionally offered to Him in puja. Cynodon dactylon.  ","word":"durva","see_also":["Shakti","Shaktism","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"A great sage (date unknown) who, according to Kashmir Saivism, was commissioned by Lord Siva to revive the knowledge of the Saiva Agamas, whereupon he created three \"mind-born\" sons -- Tryambaka to disseminate advaita, Srinatha to teach monistic theism, and Amardaka to postulate dualism.   ","word":"Durvasas","see_also":["Shakti","Shaktism","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"\"Dualistic final conclusions.\" Schools of Saiva Siddhanta that postulate God, soul and world are three eternally distinct and separate realities.  ","word":"Dvaita Siddhanta","see_also":["Pati-pashu-pasha","Saiva Siddhanta","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"\"Dual-nondual; twoness-not twoness.\" Among the most important terms in the classification of Hindu philosophies. Dvaita and advaita define two ends of a vast spectrum. -- dvaita: The doctrine of dualism, according to which reality is ultimately composed of two irreducible principles, entities, truths, etc. God and soul, for example, are seen as eternally separate. -- dualistic: Of or relating to dualism, concepts, writings, theories which treat dualities (good-and-evil, high-and-low, them-and-us) as fixed, rather than transcendable. -- pluralism: A form of nonmonism which emphasizes three or more eternally separate realities, e.g., God, soul and world. -- advaita: The doctrine of nondualism or monism, that reality is ultimately composed of one whole principle, substance or God, with no independent parts. In essence, all is God. -- monistic theism: A dipolar view which encompasses both monism and dualism. ","word":"dvaita-advaita","see_also":["monistic theism","Saiva Siddhanta","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"\"The twice-born.\" A name and traditional murti, or form, of Ganesha. He holds a scripture, a staff and a japa mala, reminding devotees of the need for disciplined striving. ","word":"Dvija Ganapati","see_also":["monistic theism","Saiva Siddhanta","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"The unmistakable \"double-faced\"murti of Lord Ganesha. He holds a noose, goad, broken tusk and a pot of gems.  ","word":"Dvimukha Ganapati","see_also":["monistic theism","Saiva Siddhanta","pitta","vata","actinodic","odic","transmutation"],"production_notes":null},{"definition":"Abnormal, impaired, not functioning completely.  ","word":"dysfunctional","see_also":["monistic theism","Saiva Siddhanta","pitta","vata","actinodic","odic","transmutation"],"production_notes":null}],"results":164}