{"entries":[{"definition":"Myth or legend. A story, usually with animal characters, meant to illustrate moral principles.  ","word":"fable","see_also":["mythology","Panchatantra"],"production_notes":null},{"definition":"A front (of a building). Often a deceptive, artificial appearance.    ","word":"facade","see_also":["mythology","Panchatantra"],"production_notes":null},{"definition":"One of numerous aspects of a subject, concept or idea.    ","word":"facet","see_also":["mythology","Panchatantra"],"production_notes":null},{"definition":"Having to do with the face.  ","word":"facial","see_also":["mythology","Panchatantra"],"production_notes":null},{"definition":"A fashion followed with great enthusiasm for a short period of time.  ","word":"fad","see_also":["mythology","Panchatantra"],"production_notes":null},{"definition":"Trust or belief. Conviction. From the Latin fides, \"trust.\" Faith in its broadest sense means \"religion,\" \"dharma.\" More specifically, it is the essential element of religion -- the belief in phenomena beyond the pale of the five senses, distinguishing it sharply from rationalism. Faith is established through intuitive or transcendent experience of an individual, study of scripture and hearing the testimony of the many wise rishis speaking out the same truths over thousands of years. This inner conviction is based in the divine sight of the third eye center, ajna chakra. Rightly founded, faith transcends reason, but does not conflict with reason. Faith also means confidence, as in the testimony and reputation of other people. The Sanskrit equivalent is shraddha. Synonyms include astikya, vishvasa, dharma and mati.   ","word":"faith","see_also":["mythology","Panchatantra"],"production_notes":null},{"definition":"Containing or based on a false concept.    ","word":"fallacious","see_also":["mythology","Panchatantra"],"production_notes":null},{"definition":"An incorrect understanding; misconception.  ","word":"fallacy","see_also":["mythology","Panchatantra"],"production_notes":null},{"definition":"To be unsteady in purpose or action; waver.    ","word":"falter","see_also":["mythology","Panchatantra"],"production_notes":null},{"definition":null,"word":"family life","see_also":["grihastha ashrama","extended family","joint family"],"production_notes":null},{"definition":null,"word":"family practices","see_also":["five family practices","extended family","joint family"],"production_notes":null},{"definition":"Excessively or irrationally devoted to a cause; overly zealous.    ","word":"fanatical","see_also":["five family practices","extended family","joint family"],"production_notes":null},{"definition":"Duradarshana. Having the power of clairvoyance, also known as divyadrishti, \"divine sight.\"  ","word":"far-seeing","see_also":["clairvoyance","siddhi","joint family"],"production_notes":null},{"definition":"Abstaining from all or certain foods, as in observance of a vow or holy day. Hindus fast in various ways. A simple fast may consist of merely avoiding certain foods for a day or more, such as when vegetarians avoid tamasic or rajasic foods or when nonvegetarians abstain from fish, fowl and meats. A moderate fast would involve avoiding heavier foods, or taking only juices, teas and other liquids. Such fasts are sometimes observed only during the day, and a normal meal is permitted after sunset. Serious fasting, which is done under supervision, involves taking only water for a number of days and requires a cessation of most external activities.  ","word":"fast","see_also":["clairvoyance","siddhi","joint family"],"production_notes":null},{"definition":"From the Latin fatum, prophetic \"declaration,\" \"oracle.\" A destiny once decreed (\"said\"), hence inevitable. In Western thought, fate is the force or agency, God or other power, outside man's control, believed to determine the course of events before they occur. In Hindu thought, man is not ruled by fate but shapes his own destiny by his actions, which have their concomitant reactions. The Hindu view acknowledges fate only in the limited sense that man is subject to his own past karmas, which are a driving force in each incarnation, seemingly out of his own control. But they can be mitigated by how he lives life, meaning how he faces and manages his prarabdha (\"begun, undertaken\") karmas and his kriyamana (\"being made\") karmas.  ","word":"fate","see_also":["adrishta","destiny","karma"],"production_notes":null},{"definition":"To ascertain the depth of; to get to the bottom; to understand.  ","word":"fathom","see_also":["adrishta","destiny","karma"],"production_notes":null},{"definition":"Companionship. Mutual sharing of interests, beliefs or practice. A group of people with common interests and aspirations.  ","word":"fellowship","see_also":["adrishta","destiny","karma"],"production_notes":null},{"definition":"To uncover or understand by searching.  ","word":"ferret","see_also":["adrishta","destiny","karma"],"production_notes":null},{"definition":"Showing great warmth of feeling; ardent; passionate, enthusiastic.  ","word":"fervent","see_also":["adrishta","destiny","karma"],"production_notes":null},{"definition":"Intense warmth of emotion; ardor, passion  ","word":"fervor","see_also":["adrishta","destiny","karma"],"production_notes":null},{"definition":"A time of religious celebration and special observances. Festivals generally recur yearly, their dates varying slightly according to astrological calculations. They are characterized by acts of piety (elaborate pujas, penance, fasting, pilgrimage) and rejoicing (songs, dance, music, parades, storytelling and scriptural reading).  ","word":"festival","see_also":["sound","teradi","karma"],"production_notes":null},{"definition":"Retrieve. To go get a thing and bring it back.  ","word":"fetch","see_also":["sound","teradi","karma"],"production_notes":null},{"definition":"A chain or shackle for the ankles or feet. Something that serves to restrict; a restraint. In Saiva Siddhanta philosophy, specifically a translation of pasha, the triple bonds of anava, karma and maya.  ","word":"fetter","see_also":["anava","karma","maya"],"production_notes":null},{"definition":"A human\/animal embryo more than eight weeks after conception until birth.  ","word":"fetus","see_also":["anava","karma","maya"],"production_notes":null},{"definition":"A bitter, often prolonged quarrel or state of enmity and opposition.    ","word":"feud","see_also":["anava","karma","maya"],"production_notes":null},{"definition":"Too careful about particulars. Fussy; fastidious; difficult to please.  ","word":"finicky","see_also":["anava","karma","maya"],"production_notes":null},{"definition":"Having an ending.  ","word":"finite","see_also":["anava","karma","maya"],"production_notes":null},{"definition":"The trance-inducing ceremonial practice of walking over a bed of smoldering, red-hot coals as an expression of faith and sometimes as a form of penance. Participants describe it as a euphoric experience in which no pain is felt and no burns received. Many lose body consciousness during the walk. Firewalking is associated with folk-shamanic Shaktism and is popular among Hindu communities in and outside of India. The practice is known also from other religions, times and places of the world.  ","word":"firewalking","see_also":["folk-shamanic","penance","Shaktism"],"production_notes":null},{"definition":"The physical universe, called Bhuloka, of gross or material substance in which phenomena are perceived by the five senses.  ","word":"First World","see_also":["loka","penance","Shaktism"],"production_notes":null},{"definition":"Panchakritya. Creation, preservation, destruction, veiling and revealing.  ","word":"five acts of Siva","see_also":["Nataraja","Parameshvara","Shaktism"],"production_notes":null},{"definition":"  ","word":"five classical duties","see_also":["pancha nitya karmas","Parameshvara","Shaktism"],"production_notes":null},{"definition":"Pancha kutumba sadhana, or five parenting guidelines. 1) Good Conduct -- Dharmachara: Loving fathers and mothers, knowing they are the greatest influence in a child's life, behave the way their dear children should when adults. They never anger or argue before young ones. Father in a dhoti, mother in a sari at home, all sing to God, Gods and guru. 2) Home Worship -- Dharma Svagriha: Loving fathers and mothers establish a separate shrine room in the home for God, Gods and guardian devas of the family. Ideally it should be large enough for all the dear children. It is a sacred place for scriptural study, a refuge from the karmic storms of life.3) Talking About Religion -- Dharma Sambhashana: Loving fathers and mothers speak Vedic precepts while driving, eating and playing. This helps dear children understand experiences in right perspective. Parents know many worldly voices are blaring, and their dharmic voice must be stronger. 4) Continuing Self-Study -- Dharma Svadhyaya: Loving fathers and mothers keep informed by studying the Vedas, Agamas and sacred literature, listening to swamis and pandits. Youth face a world they will one day own, thus parents prepare their dear children to guide their own future progeny. 5) Following a Spiritual Preceptor -- Dharma Sanga: Loving fathers and mothers choose a preceptor, a traditional satguru, and lineage to follow. They support their lineage with all their heart, energy and service. He in turn provides them clear guidance for a successful life, material and religious. ","word":"five family practices","see_also":["pancha nitya karmas","Parameshvara","Shaktism"],"production_notes":null},{"definition":"  ","word":"Five Letters (syllables)","see_also":["See NamahSivaya","Parameshvara","Shaktism"],"production_notes":null},{"definition":"The conscious, subconscious, sub-subconscious, subsuperconscious and superconscious mind. ","word":"five states of mind","see_also":["mind (five states)","Parameshvara","Shaktism"],"production_notes":null},{"definition":"To fail or end weakly (colloquial).  ","word":"fizzle","see_also":["mind (five states)","Parameshvara","Shaktism"],"production_notes":null},{"definition":"Elaborately colored; showy; outrageous.  ","word":"flamboyant","see_also":["mind (five states)","Parameshvara","Shaktism"],"production_notes":null},{"definition":"To flow, move, change back and forth.  ","word":"fluctuate","see_also":["mind (five states)","Parameshvara","Shaktism"],"production_notes":null},{"definition":"Flowing easily and smoothly, especially of speaking and writing.  ","word":"fluent","see_also":["mind (five states)","Parameshvara","Shaktism"],"production_notes":null},{"definition":"Continuous flowing movement or change.    ","word":"flux","see_also":["mind (five states)","Parameshvara","Shaktism"],"production_notes":null},{"definition":"A minor weakness or character flaw.    ","word":"foible","see_also":["mind (five states)","Parameshvara","Shaktism"],"production_notes":null},{"definition":"Popular or village stories passed orally from generation to generation through verbal telling -- often a mixture of fact and fancy, allegory and myth, legend and symbolism, conveying lessons about life, character and conduct. India's most extensive and influential of this kind of literature are the Puranas. While they are broadly deemed to be scriptural fact, this contemporary Hindu catechism accepts them as edifying mythology meant to capture the imagination of the common folk and to teach them moral living.  ","word":"folk narratives","see_also":["fable","Ithihasa","katha","mythology","Purana"],"production_notes":null},{"definition":"Of or related to a tribal or village tradition in which the mystic priest, shaman, plays a central role, wielding powers of magic and spirituality. Revered for his ability to influence and control nature and people, to cause good and bad things to happen, he is the intermediary between man and divine forces. The term shaman is from the Sanskrit shramana, \"ascetic,\" akin to shram, \"to exert.\"  ","word":"folk-shamanic","see_also":["Shaktism","shamanism","katha","mythology","Purana"],"production_notes":null},{"definition":"Self-control; responding with patience and compassion, especially under provocation. Endurance; tolerance.  ","word":"forbearance","see_also":["yama-niyama","shamanism","katha","mythology","Purana"],"production_notes":null},{"definition":"A region of space through which a force, for example, an electric current, is operative. Here the term is used in reference to psychic energies, both positive and negative, that are generated by the emotions, the mind, the higher or lower chakras or emanate from the inner higher or lower worlds. Positive psychic force fields, such as those surrounding and protecting a temple, an ashrama or harmonious home, are built up by worship, invoking of the Deities, sadhana, tapas and disciplined living, attracting divine spirits, or devas. Negative force fields, such as found in the worst areas of a city or within an inharmonious home, are built up by anger, violence, lust and outbursts of such lower emotions, attracting evil spirits, or asuras.  ","word":"force field","see_also":["odic","actinic","prana","mythology","Purana"],"production_notes":null},{"definition":"A sense of impending danger or evil.   ","word":"foreboding","see_also":["odic","actinic","prana","mythology","Purana"],"production_notes":null},{"definition":"  ","word":"forehead marks","see_also":["Seebindu","tilaka","tripundra","mythology","Purana"],"production_notes":null},{"definition":"Prevent, hinder, obstruct, intercept. ","word":"forestall","see_also":["Seebindu","tilaka","tripundra","mythology","Purana"],"production_notes":null},{"definition":"Losing something due to a crime or fault or neglect of duty. ","word":"forfeiting","see_also":["Seebindu","tilaka","tripundra","mythology","Purana"],"production_notes":null},{"definition":"Given form or shape (originally of metal by heating and hammering).  ","word":"forged","see_also":["Seebindu","tilaka","tripundra","mythology","Purana"],"production_notes":null},{"definition":"Philosophically, atattva, beyond the realm of form or substance. Used in attempting to describe the wondersome, indescribable Absolute, which is \"timeless, formless and spaceless.\" God Siva has form and is formless. He is the immanent Pure Consciousness or pure form. He is the Personal Lord manifesting as innumerable forms; and He is the impersonal, transcendent Absolute beyond all form. Thus we know Siva in three perfections, two of form and one formless. This use of the term formless does not mean amorphous, which implies a form that is vague or changing. Rather, it is the absence of substance, sometimes thought of as a void, an emptiness beyond existence from which comes the fullness of everything. In describing the Self as formless, the words timeless and spaceless are given also to fully indicate this totally transcendent noncondition.  ","word":"formless","see_also":["atattva","Parashiva","Satchidananda","void","Purana"],"production_notes":null},{"definition":"To abandon, give up or renounce.  ","word":"forsake","see_also":["atattva","Parashiva","Satchidananda","void","Purana"],"production_notes":null},{"definition":"In truth; indeed.  ","word":"forsooth","see_also":["atattva","Parashiva","Satchidananda","void","Purana"],"production_notes":null},{"definition":"A spring that is the source of a stream. The source of anything.  ","word":"fountainhead","see_also":["atattva","Parashiva","Satchidananda","void","Purana"],"production_notes":null},{"definition":"Chaturvarga, \"four-fold good,\" or purushartha, \"human goals or purposes.\" The four pursuits in which humans may legitimately engage, a basic principle of Hindu ethics. 1) dharma (\"Righteous living\"): The fulfillment of virtue, good works, duties and responsibilities, restraints and observances -- performing one's part in the service and upliftment of society. This includes pursuit of truth under a guru of a particular parampara and sampradaya. See: dharma. 2) artha (\"Wealth\"): Material welfare and abundance, money, property, possessions. Artha is the pursuit of wealth, guided by dharma. It includes the basic needs -- food, money, clothing and shelter -- and extends to the wealth required to maintain a comfortable home, raise a family, fulfill a successful career and perform religious duties. See: yajna. 3) kama (\"Pleasure, love; enjoyment\"): Earthly love, aesthetic and cultural fulfillment, pleasures of the world (including sexual), the joys of family, intellectual satisfaction. Enjoyment of happiness, security, creativity, usefulness and inspiration. 4) moksha (\"Liberation\"): Freedom from rebirth through the ultimate attainment, realization of the Self God, Parashiva. The spiritual attainments and superconscious joys, attending renunciation and yoga leading to Self Realization. Moksha comes through the fulfillment of dharma, artha and kama in the current or past lives, so that one is no longer attached to worldly joys or sorrows. ","word":"four traditional goals","see_also":["atattva","Parashiva","Satchidananda","void","Purana"],"production_notes":null},{"definition":"Open, undisguised; blunt, straightforward.    ","word":"frank","see_also":["atattva","Parashiva","Satchidananda","void","Purana"],"production_notes":null},{"definition":"Irritated, disturbed, worried or troubled.    ","word":"fretful","see_also":["atattva","Parashiva","Satchidananda","void","Purana"],"production_notes":null},{"definition":"A decorative border or edging, or something that resembles a border.    ","word":"fringe","see_also":["atattva","Parashiva","Satchidananda","void","Purana"],"production_notes":null},{"definition":"The bearing of fruit. The coming to fulfillment of something that has been awaited or worked for.   ","word":"fruition","see_also":["atattva","Parashiva","Satchidananda","void","Purana"],"production_notes":null},{"definition":"Any religious creed or philosophical persuasion marked by extreme dogmatism and intolerance. There are fundamentalist denominations within many religions, believing in a literal interpretation of their scripture as the exclusive truth, the one and only way which all souls must follow to attain salvation. Historically, fundamentalism, especially when coupled with evangelical zeal, has led to aggression, even violence, against nonbelievers.  ","word":"fundamentalism","see_also":["atattva","Parashiva","Satchidananda","void","Purana"],"production_notes":null},{"definition":"Any religious or philosophical group or individual marked by extreme dogmatism and intolerance. Fundamentalists believe in a literal interpretation of their scripture as the exclusive truth, the one and only way which all souls must follow to attain salvation, and in allegiance to their Messiah or Prophet as the one true representative of God. A religious fanatic.  ","word":"fundamentalist","see_also":["atattva","Parashiva","Satchidananda","void","Purana"],"production_notes":null},{"definition":"  ","word":"funeral rites","see_also":["cremation","Parashiva","Satchidananda","void","Purana"],"production_notes":null}],"results":61}