{"entries":[{"definition":"\"Mace.\" A rough-headed club, one of the insignia of Ganesha, representing His power to cast karmas back on devotees until fully resolved. ","word":"gada","see_also":null,"production_notes":null},{"definition":"Manner of moving on foot, walking or running; the stride or way(s) of movement of a horse or other four-legged animal.    ","word":"gait","see_also":null,"production_notes":null},{"definition":"The elephant, king of beasts, representative of Lord Ganesha and sign of royalty and power. Many major Hindu temples keep one or more elephants.  ","word":"gaja","see_also":null,"production_notes":null},{"definition":"\"Elephant-faced.\" A popular name of Ganesha, which appears in the Mudgala Purana, as the vanquisher of lobha, greed. ","word":"Gajanana","see_also":null,"production_notes":null},{"definition":"Of or pertaining to our galaxy, the Milky Way (from the Greek gala, \"milk\") and\/or other galaxies.  ","word":"galactic","see_also":null,"production_notes":null},{"definition":"The seed sound, or bija mantra, of Loving Ganesha. Bija mantras, being on one syllable, represent the essence of more complex sound combinations. Gam is the root sound within the muladhara chakra. ","word":"Gam Mantra","see_also":null,"production_notes":null},{"definition":"A complete musical scale. Hence a complete range, spread or extent of anything.     ","word":"gamut","see_also":null,"production_notes":null},{"definition":"\"Number,\" hence \"throng,\" \"troop,\" \"retinue;\" a body of followers or attendants.\" A troop of demigods -- God Siva's attendants, devonic helpers under the supervision of Lord Ganesha.  ","word":"gana(s)","see_also":["Ganesha"],"production_notes":null},{"definition":"Loyalty to the community. One of five Vira Saiva codes of conduct.  ","word":"ganachara","see_also":["panchachara","Vira Saivism"],"production_notes":null},{"definition":"Loyalty to the community. One of five Vira Saiva codes of conduct.  ","word":"Ganachara","see_also":["panchachara","Vira Saivism"],"production_notes":null},{"definition":"\"Lords of hosts.\" As a singular, Gananatha refers to Lord Ganesha. Plural, to the many divine beings who help in guiding the flow of consciousness under the direction of the Mahadevas. ","word":"Gananathas","see_also":["panchachara","Vira Saivism"],"production_notes":null},{"definition":"\"Leader of the ganas.\" A surname of Ganesha.    ","word":"Ganapati","see_also":["panchachara","Vira Saivism"],"production_notes":null},{"definition":"A later Upanishad on Lord Ganesha, not connected with any Veda; date of composition is unknown. It is a major scripture for the Ganapatians, a minor Hindu sect which reveres Ganesha as Supreme God and is most prevalent in India's Maharashtra state.  ","word":"Ganapati Upanishad","see_also":["Ganesha","Vira Saivism"],"production_notes":null},{"definition":"\"Smell, odor, fragrance.\" Gandha is the fifth of five tanmatras, \"primal substances,\" from which the gross elements, mahabhutas (or panchbautikas), arise in the evolution of the tattvas. Smell is the tanmatra corresponding to the earth element, prithivi.  ","word":"gandha","see_also":["See tanmatra","Vira Saivism"],"production_notes":null},{"definition":"Astral male lovers, counterparts to the female apsara, mentioned in the Vedas.  ","word":"gandharvas","see_also":["apsara","Vira Saivism"],"production_notes":null},{"definition":"\"Science of music.\" A class of ancient tracts on music, song and dance. It is the Upaveda of the Sama Veda.  ","word":"Gandharvaveda","see_also":["Upaveda","Vira Saivism"],"production_notes":null},{"definition":"Mohandas Karamchand Gandhi (1869-1948), the Hindu nationalist leader whose strategy of nonviolent resistance won India's freedom from British colonial rule. Often honored as Mahatma (\"great soul\").  ","word":"Gandhi","see_also":["Upaveda","Vira Saivism"],"production_notes":null},{"definition":"\"Lord of Categories.\" (From gan, \"to count or reckon,\" and Isha, \"lord.\") Or: \"Lord of attendants (gana),\" synonymous with Ganapati. Ganesha is a Mahadeva, the beloved elephant-faced Deity honored by Hindus of every sect. Patron of Art and Science, first Son of Siva. He is the Lord of Obstacles (Vighneshvara), revered for His great wisdom and invoked first before any undertaking, for He knows all intricacies of each soul's karma and the perfect path of dharma that makes action successful. He sits on the muladhara chakra and is easy of access. Lord Ganesha is sometimes identified with the Rig Vedic God Brihaspati (\"Lord of Prayer,\" the \"Holy Word\"), Rig Veda 2.23.1.  A Mahadeva or great God created by Lord Siva to assist souls in their evolution.","word":"Ganesha","see_also":["gana","Ganapati","Mahadeva"],"production_notes":null},{"definition":"The birthday of Lord Ganesha, a ten-day festival of August-September that culminates in a spectacular parade called Ganesha Visarjana. It is a time of rejoicing, when all Hindus worship together.   ","word":"Ganesha Chaturthi","see_also":["gana","Ganapati","Mahadeva"],"production_notes":null},{"definition":"\"Ganesha departure.\" A parade usually occurring on the 11th day after Ganesha Chaturthi, in which the Ganesha murtis made for the occasion are taken in procession to a body of water and ceremoniously immersed and left to dissolve. This represents Ganesha's merging with the ocean of consciousness.  ","word":"Ganesha Visarjana","see_also":["Ganesha","Ganapati","Mahadeva"],"production_notes":null},{"definition":"A practice for unburdening the mind, performed by releasing the energy of unwanted thoughts. An internal cleansing sadhana of sitting quietly by a river or stream and listening to the Aum sound as the water flows over the rocks. When a thought arises, it is mentally placed into a leaf held in the right hand, then gently tossed into the water. Then a flower is offered to thank the water for carrying away the thought. This is a subconscious cleansing process of letting go of hurts, anger, problems or whatever it is that rises in the mind to disturb the meditation.  ","word":"Ganga Sadhana","see_also":["Ganesha","Ganapati","Mahadeva"],"production_notes":null},{"definition":"A practice for unburdening the mind, performed by releasing the energy of unwanted thoughts. An internal cleansing sadhana of sitting quietly by a river or stream and listening to the Aum sound as the water flows over the rocks. When a thought arises, it is mentally placed into a leaf held in the right hand, then gently tossed into the water. Then a flower is offered to thank the water for carrying away the thought. This is a subconscious cleansing process of letting go of hurts, anger, problems or whatever it is that rises in the mind to disturb the meditation.  ","word":"Ganga Sadhana","see_also":["Ganesha","Ganapati","Mahadeva"],"production_notes":null},{"definition":"India's most sacred river, 1,557 miles long, arising in the Himalayas above Haridwar under the name Bhagiratha, and being named Ganga after joining the Alakanada (where the Sarasvati is said to join them underground). It flows southeast across the densely populated Gangetic plain, joining its sister Yamuna (or Jumna) at Prayaga (Allahabad) and ending at the Bay of Bengal.  ","word":"Ganges (Ganga)","see_also":["Ganesha","Ganapati","Mahadeva"],"production_notes":null},{"definition":"Near to or on the banks of the Ganges river in North India.  ","word":"Gangetic","see_also":["Ganesha","Ganapati","Mahadeva"],"production_notes":null},{"definition":"Ancient pilgrimage places that devotees strive to visit at least once in a lifetime, including the sacred Vishvanatha Temple of Varanasi (on the banks of the Ganga between the Varana and Asi Rivers); Garigotri Temple at the source of the Ganga (near Kedarnath), and the sacred temples in the cities of Hardwar and Rishikesh.  ","word":"Gangetic abodes of Siva","see_also":["Ganesha","Ganapati","Mahadeva"],"production_notes":null},{"definition":"The densely populated plain surrounding India's most sacred river, the Ganges (Ganga), an immense, fertile area of 300,000 square miles, 90 to 300 miles wide.  ","word":"Gangetic Plain","see_also":["Ganges","Ganapati","Mahadeva"],"production_notes":null},{"definition":"Groups of nerve cells that form a nerve center outside of the brain or spinal cord. A center of power, activity, or energy. (Singular: ganglion). See chakra.    ","word":"ganglia","see_also":["Ganges","Ganapati","Mahadeva"],"production_notes":null},{"definition":"Referring to the ganglia.    ","word":"ganglionic","see_also":["Ganges","Ganapati","Mahadeva"],"production_notes":null},{"definition":"\"Womb; interior chamber.\" The inside or middle of anything.   ","word":"garbha","see_also":["Ganges","Ganapati","Mahadeva"],"production_notes":null},{"definition":"\"Womb-impregnation.\" The rite anticipating conception.  ","word":"garbhadhana","see_also":["reincarnation","samskaras of birth","Mahadeva"],"production_notes":null},{"definition":"The \"innermost chamber,\" sanctum sanctorum, of a Hindu temple, where the primary murti is installed. It is a small, cave-like room, usually made of granite stone, to which only priests are permitted access. Esoterically it represents the cranial chamber.  ","word":"garbhagriha","see_also":["temple","samskaras of birth","Mahadeva"],"production_notes":null},{"definition":"One of the known disciples of Lakulisa.  ","word":"Gargya","see_also":["Lakulisa","samskaras of birth","Mahadeva"],"production_notes":null},{"definition":"\"Grains.\" E.g., wheat or barley. ","word":"Garitra","see_also":["Lakulisa","samskaras of birth","Mahadeva"],"production_notes":null},{"definition":"The king of birds. The celestial vehicle (vahana) of Lord Vishnu.    ","word":"Garuda","see_also":["Lakulisa","samskaras of birth","Mahadeva"],"production_notes":null},{"definition":"Lacking grace or social tact; awkward, clumsy.  ","word":"gauche","see_also":["Lakulisa","samskaras of birth","Mahadeva"],"production_notes":null},{"definition":"A medieval knight's glove thrown down in a challenge, as to a fight. Hence \"throwing down the gauntlet\" means to challenge or provoke.    ","word":"gauntlet","see_also":["Lakulisa","samskaras of birth","Mahadeva"],"production_notes":null},{"definition":"The name of the founder of the Nyaya school of Saivism, author of the Nyaya Sutras. Also, the Buddha (Siddhartha Gautama).  ","word":"Gautama","see_also":["Buddha","Buddhism","Mahadeva"],"production_notes":null},{"definition":"The historical Buddha.  ","word":"Gautama, Siddhartha","see_also":["Buddha","Buddhism","Mahadeva"],"production_notes":null},{"definition":"\"Joyous, merry, happy.\" Homosexual (preferred self-appellation), especially male, though may also refer to females.  ","word":"gay","see_also":["bisexual","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"According with the gayatri verse form, an ancient meter of 24 syllables, generally as a triplet with eight syllables each. From gaya, \"song.\"  -- Gayatri: The Vedic Gayatri Mantra personified as a Goddess, mother of the four Vedas.   ","word":"gayatri","see_also":["bisexual","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"1) Famous Vedic mantra used in puja and personal chanting. Om [bhur bhuvah svah] tatsavitur varenyam, bhargo devasya dhimahi, dhiyo yo nah prachodayat. \"[O Divine Beings of all three worlds,] we meditate upon the glorious splendor of the Vivifier divine. May He illumine our minds.\" (Rig Veda 3.62.10. ve). This sacred verse is also called the Savitri Mantra, being addressed to Savitri, the Sun as Creator, and is considered a universal mystic formula so significant that it is called Vedamatri, \"mother of the Vedas.\" 2) Any of a class of special tantric mantras called Gayatri. Each addresses a particular Deity. The Siva Gayatri Mantra is: Tryambakam yajamahe sugandhim pushtivardhanam, urvarukamiva bandhanan mrtyormukshiya mamrtat. \"We adore the fragrant three-eyed one who promotes prosperity. May we be freed from the bondage of death as a cucumber from its stalk, but not from immortality.\" This is a famous verse of the Yajur Veda (from Rudranamaka, or Shri Rudram), considered an essential mantra of Siva worship, used in all Siva rites.   ","word":"Gayatri Mantra","see_also":["bisexual","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"Having a pleasant, easy-going or friendly disposition or manner.    ","word":"genial","see_also":["bisexual","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"To sprout. To begin to develop.  ","word":"germinate","see_also":["bisexual","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"The period of time between conception and birth; pregnancy.  ","word":"gestation","see_also":["bisexual","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"\"Bell.\" Akin to ghant, \"to speak.\" An important implement in Hindu worship (puja), used to chase away asuras and summon devas and Gods.  ","word":"ghanta","see_also":["puja","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"Hindi for clarified butter; ghrita in Sanskrit. Butter that has been boiled and strained. An important sacred substance used in temple lamps and offered in fire ceremony, yajna. It is also used as a food with many ayurvedic virtues.  ","word":"ghee","see_also":["yajna","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"A Vaishnava manual on hatha yoga (ca 1675), still influential today, presented as a dialog between Sage Gheranda and a disciple.  ","word":"Gheranda Samhita","see_also":["hatha yoga","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"Lebanese mystic, poet, dramatist and artist (1888-1931), best known for The Prophet.  ","word":"Gibran, Kahlil","see_also":["hatha yoga","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"\"Mountain born.\" The Ganesha murti enshrined at the Lenyadhri Cave Temple of Maharashtra. ","word":"Girijatmaja","see_also":["hatha yoga","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"Girded, surrounded.    ","word":"girt","see_also":["hatha yoga","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"The central idea; the essence.  ","word":"gist","see_also":["hatha yoga","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"\"Song.\" Foreshortened title of Bhagavad Gita. ","word":"Gita","see_also":["Bhagavad Gita","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"Darkness. Deep sadness or despair.  ","word":"gloom","see_also":["Bhagavad Gita","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"To give glory, honor, or high praise to; exalt.  ","word":"glorify","see_also":["Bhagavad Gita","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"Excessiveness in eating or drinking.  ","word":"gluttony","see_also":["Bhagavad Gita","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"The cow, considered especially sacred for its unbounded generosity and usefulness to humans. It is a symbol of the Earth as the abundant provider. For the Hindu, the cow is a representative of all living species, each of which is to be revered and cared for.  ","word":"go","see_also":["Bhagavad Gita","heterosexual","homosexual","sexuality"],"production_notes":null},{"definition":"Supernal being. Either the Supreme God, Siva, or one of the Mahadevas, great souls, who are among His creation.  ","word":"God","see_also":["Gods","Mahadeva","Siva","sexuality"],"production_notes":null},{"definition":"Direct and personal experience of the Divine within oneself. It can refer to either 1) savikalpa samadhi (\"enstasy with form\") in its various levels, from the experience of inner light to the realization of Satchidananda, the pure consciousness or primal substance flowing through all form, or 2) nirvikalpa samadhi (\"enstasy without form\"), union with the transcendent Absolute, Parashiva, the Self God, beyond time, form and space. In The Master Course trilogy, the expression God Realization is used to name both of the above samadhis, whereas Self Realization refers only to nirvikalpa samadhi. ","word":"God Realization","see_also":["raja yoga","samadhi","Self Realization","sexuality"],"production_notes":null},{"definition":null,"word":"God's power","see_also":["Shakti","samadhi","Self Realization","sexuality"],"production_notes":null},{"definition":"Female representation or manifestation of Divinity; Shakti or Devi. Goddess can refer to a female perception or depiction of a causal-plane being (Mahadeva) in its natural state, which is genderless, or it can refer to an astral-plane being residing in a female astral body. To show the Divine's transcendence of sexuality, sometimes God is shown as having qualities of both sexes, e.g., Ardhanarishvara, \"Half-woman God;\" or Lord Nataraja, who wears a feminine earring in one ear and a masculine one in the other.  ","word":"Goddess","see_also":["Shakti","samadhi","Self Realization","sexuality"],"production_notes":null},{"definition":"God; Divinity. A term describing the essence or highest aspect of the Supreme Being.   ","word":"Godhead","see_also":["Shakti","samadhi","Self Realization","sexuality"],"production_notes":null},{"definition":"Mahadevas, \"great beings of light.\" In Dancing with Siva, the plural form of God refers to extremely advanced beings existing in their self-effulgent soul bodies in the causal plane -- the Sivaloka. The meaning of Gods is best seen in the phrase, \"God and the Gods,\" referring to the Supreme God -- Siva -- and the Mahadevas who are His creation. Originally created by Siva, as all souls are, Gods have evolved to a constant superconsciousness as they govern, advance and assist all worlds. Gods are genderless, neither male nor female, but pure kundalini-energy beings.   ","word":"Gods","see_also":["Mahadeva","samadhi","Self Realization","sexuality"],"production_notes":null},{"definition":"South Indian temple entrance tower, often quite tall with ornate carvings.  ","word":"gopura","see_also":["balipitha","temple","Self Realization","sexuality"],"production_notes":null},{"definition":"One of the six schools of Saivism, also called Siddha Siddhanta.  ","word":"Gorakhnath Saivism (Gorakshanatha Saivism)","see_also":["Siddha Siddhanta","siddha yoga","Self Realization","sexuality"],"production_notes":null},{"definition":"A renowned siddha yoga master of the Adinatha Sampradaya (ca 950). Expounder and foremost guru of Siddha Siddhanta Saivism, he traveled and extolled the greatness of Siva throughout North India and Nepal where he and his guru, Matsyendranatha, are still highly revered. ","word":"Gorakshanatha","see_also":["hatha yoga","Siddha Siddhanta","Siddha Siddhanta Paddhati","sexuality"],"production_notes":null},{"definition":"\"Path of Gorakshanatha.\" A synonym for Siddha Siddhanta.  ","word":"Gorakshapantha","see_also":["Saivism (six schools)","Siddha Siddhanta","Siddha Siddhanta Paddhati","sexuality"],"production_notes":null},{"definition":"\"A Hundred Verses by Goraksha.\" Along with Siddha Siddhanta Pradipika, this work extols the path of \"Siva yoga,\" which is hatha-kundalini yoga emphasizing control over body and mind, awakening of higher chakras and nadi nerve system with the intent of realizing the Absolute, Parasamvid, and residing in the sahasrara chakra in perfect identity with Siva.  ","word":"Gorakshashataka","see_also":["Gorakshanatha","Siddha Siddhanta","Siddha Siddhanta Paddhati","sexuality"],"production_notes":null},{"definition":"Dazzlingly beautiful or magnificent.  ","word":"gorgeous","see_also":["Gorakshanatha","Siddha Siddhanta","Siddha Siddhanta Paddhati","sexuality"],"production_notes":null},{"definition":"\"Cow pen; niche.\" Also names a small alcove shrine. ","word":"goshta","see_also":["Gorakshanatha","Siddha Siddhanta","Siddha Siddhanta Paddhati","sexuality"],"production_notes":null},{"definition":"\"Cowshed.\" Family lineage or subcaste stemming from a rishi or satguru and bearing his name. Originally described as several joint families sharing a common cowshed.  ","word":"gotra","see_also":["caste","jati","varna dharma","sexuality"],"production_notes":null},{"definition":"\"Benevolence, love, giving,\" from the Latin gratia, \"favor,\" \"goodwill.\" God's power of revealment, anugraha shakti (\"kindness, showing favor\"), by which souls are awakened to their true, Divine nature. Grace in the unripe stages of the spiritual journey is experienced by the devotee as receiving gifts or boons, often unbidden, from God. The mature soul finds himself surrounded by grace. He sees all of God's actions as grace, whether they be seemingly pleasant and helpful or not. For him, his very love of God, the power to meditate or worship, and the spiritual urge which drives his life are entirely and obviously God's grace, a divine endowment, an intercession, unrelated to any deed or action he did or could perform.  In Saiva Siddhanta, it is grace that awakens the love of God within the devotee, softens the intellect and inaugurates the quest for Self Realization. It descends when the soul has reached a certain level of maturity, and often comes in the form of a spiritual initiation, called shaktipata, from a satguru. Grace is not only the force of illumination or revealment. It also includes Siva's other four powers -- creation, preservation, destruction and concealment -- through which He provides the world of experience and limits the soul's consciousness so that it may evolve. More broadly, grace is God's ever-flowing love and compassion, karunya, also known as kripa (\"tenderness, compassion\") and prasada (literally, \"clearness, purity\").  To whom is God's grace given? Can it be earned? Two famous analogies, that of the monkey (markata) and that of the cat (marjara) express two classical viewpoints on salvation and grace. The markata school, perhaps represented more fully by the Vedas, asserts that the soul must cling to God like a monkey clings to its mother and thus participate in its \"salvation.\" The marjara school, which better reflects the position of the Agamas, says that the soul must be like a young kitten, totally dependent on its mother's will, picked up in her mouth by the scruff of the neck and carried here and there. This crucial state of loving surrender is called prapatti.  ","word":"grace","see_also":["anugraha shakti","prapatti","shaktipata","tirodhana shakti"],"production_notes":null},{"definition":"Greatness, magnificence; loftiness of character; sublime nobility.    ","word":"grandeur","see_also":["anugraha shakti","prapatti","shaktipata","tirodhana shakti"],"production_notes":null},{"definition":"Literally, \"knot,\" a common name for book -- a term thought to refer to the knot on the cord that bound ancient palm-leaf or birch-bark manuscripts. Books are accorded deep respect in Hinduism, always carefully treated, never placed directly on the floor. Special books are not uncommonly objects of worship. Grantha also names an ancient literary script developed in South India.  ","word":"grantha","see_also":["olai","prapatti","shaktipata","tirodhana shakti"],"production_notes":null},{"definition":"\"Book knowledge.\" Bibliography; booklist, recommended reading.  ","word":"granthavidya","see_also":["olai","prapatti","shaktipata","tirodhana shakti"],"production_notes":null},{"definition":"Indulging in what is desired.  ","word":"gratification","see_also":["olai","prapatti","shaktipata","tirodhana shakti"],"production_notes":null},{"definition":"Irritating or annoying.  ","word":"grating","see_also":["olai","prapatti","shaktipata","tirodhana shakti"],"production_notes":null},{"definition":"Sculpted or carved statue of God or a God, a derogatory term from the English Bible translation.     ","word":"graven image","see_also":["olai","prapatti","shaktipata","tirodhana shakti"],"production_notes":null},{"definition":"The Saiva sannyasin's vow of renunciation, the mahavrata of the Saivite pathfinders. It is the relinquishment of the world, desire and ego. It is detachment founded in knowledge of the magnetic nature of body, mind and emotion, a knowledge which inclines the soul toward noninvolvement with external forms and, in time, summons forth realization of Parashiva, Absolute Reality. ","word":"Great Oath","see_also":["sannyasa","prapatti","shaktipata","tirodhana shakti"],"production_notes":null},{"definition":"\"Householder.\" Family man or woman. Family of a married couple and other relatives. Pertaining to family life. The purely masculine form of the word is grihasthin, and the feminine grihasthi. Grihasthi also names the home itself. The period of human life after the brahmachariya ashram (studentship period) is over, the individual establishing a career, home and family.   ","word":"grihastha","see_also":["ashrama dharma","grihastha dharma","shaktipata","tirodhana shakti"],"production_notes":null},{"definition":"\"Householder stage.\"  ","word":"grihastha ashrama","see_also":["ashrama dharma","grihastha dharma","shaktipata","tirodhana shakti"],"production_notes":null},{"definition":"\"Householder law.\" The virtues and ideals of family life. This dharma includes all nonmonastics, whether married or single. In general, grihastha dharma begins with the completion of the period of studentship and extends throughout the period of raising a family (called the grihastha ashrama). Specific scriptures, called Dharma Shastras and Grihya Shastras, outline the duties and obligations of family life. In Hinduism, family life is one of serving, learning and striving within a close-knit community of many relatives forming a joint family and its broader connections as an extended family under the aegis of a spiritual guru. Each is expected to work harmoniously to further the wealth and happiness of the family and the society, to practice religious disciplines and raise children of strong moral fiber to carry on the tradition. Life is called a jivayajna, \"self-sacrifice,\" for each incarnation is understood as an opportunity for spiritual advancement through fulfilling one's dharma of birth, which is the pattern one chose before entering this world, a pattern considered by many as bestowed by God. In the majority of cases, sons follow in the footsteps of their father, and daughters in those of their mother. All interrelate with love and kindness. Respect for all older than oneself is a keynote. Marriages are arranged and the culture is maintained.  The householder strives to fulfill the four purusharthas, \"human goals\" of righteousness, wealth, pleasure and liberation. While taking care of one's own family is most central, it is only part of this dharma's expectations. Grihasthas must support the religion by building and maintaining temples, monasteries and other religious institutions, supporting the monastics and disseminating the teachings. They must care for the elderly and feed the poor and homeless. Of course, the duties of husband and wife are different. The Tirukural describes the householder's central duties as serving these five: ancestors, God, guests, kindred and himself. The Dharma Shastras, similarly, enjoin daily offerings to rishis, ancestors, Gods, creatures and men.  ","word":"grihastha dharma","see_also":["ashrama dharma","extended family","joint family","yajna"],"production_notes":null},{"definition":"From griha, \"home,\" hence \"lord and lady of the home.\" The family man, griheshvara (or grihapati), and family woman, grihini, considered as master and mistress of their respective realms, so they may fulfill their purusha and stri dharmas. Implies that both of their realms are equally important and inviolable.  ","word":"griheshvara and grihini","see_also":["dharma","extended family","joint family","yajna"],"production_notes":null},{"definition":"\"Household maxims or codes.\" An important division of classical smriti literature, designating rules and customs for domestic life, including rites of passage and other home ceremonies, which are widely followed to this day. The Grihya Sutras (or Shastras) are part of the Kalpa Sutras, \"procedural maxims\" (or Kalpa Vedanga), which also include the Shrauta and Shulba Shastras, on public Vedic rites, and the Dharma Shastras (or Sutras), on domestic-social law. Among the best known Grihya Sutras are Ashvalayana's Grihya Sutras attached to the Rig Veda, Gobhila's Sutras of the Sama Veda, and the Sutras of Paraskara and Baudhayana of the Yajur Veda.  ","word":"Grihya Sutras","see_also":["Kalpa Vedanga","Vedanga","joint family","yajna"],"production_notes":null},{"definition":"Personification of death in Western tradition, a hooded, black-robed skeleton figure carrying a scythe to cut down lives.  ","word":"Grim Reaper","see_also":["Kalpa Vedanga","Vedanga","joint family","yajna"],"production_notes":null},{"definition":"Dense, coarse, unrefined, crude; carnal, sensual; lacking sensitivity.    ","word":"gross","see_also":["Kalpa Vedanga","Vedanga","joint family","yajna"],"production_notes":null},{"definition":"The physical world.  ","word":"gross plane","see_also":["loka","tattva","world","yajna"],"production_notes":null},{"definition":"A person or corporation that makes or gives assurance or pledge.  ","word":"guarantor","see_also":["loka","tattva","world","yajna"],"production_notes":null},{"definition":"An epithet of Karttikeya. \"The interior one.\" -- guha:\"Cave.\"  ","word":"Guha","see_also":["Karttikeya","tattva","world","yajna"],"production_notes":null},{"definition":"\"Cave-dweller; he who is hidden\" -- a name of Lord Siva.  ","word":"Guhavasi","see_also":["Karttikeya","tattva","world","yajna"],"production_notes":null},{"definition":"A guru of central India (ca 675) credited with the re-founding of Saiva Siddhanta in that area, based fully in Sanskrit. Guhavasi -- literally \"cave-dweller; he who is hidden,\" or \"mysterious\" -- is also an epithet of Lord Siva.    ","word":"Guhavasi Siddha (Guhavasi)","see_also":["Karttikeya","tattva","world","yajna"],"production_notes":null},{"definition":"\"Lord of the cave.\" A name of Lord Siva implying His presence in the heart or the interior of all beings.  ","word":"Guheshvara","see_also":["Karttikeya","tattva","world","yajna"],"production_notes":null},{"definition":"Treacherous cunning; crafty deceit.     ","word":"guile","see_also":["Karttikeya","tattva","world","yajna"],"production_notes":null},{"definition":"State of West India. Capital is Ahmedabad, population 40,000,000, area 75,670 square miles.  ","word":"Gujarat","see_also":["Karttikeya","tattva","world","yajna"],"production_notes":null},{"definition":"An auspicious period of time (about 90 minutes) which occurs at a different time each day according to the astrological configuration indicated on the panchanga calendar.  ","word":"gulika kala","see_also":["Karttikeya","tattva","world","yajna"],"production_notes":null},{"definition":"\"Strand; quality.\" The three constituent principles of prakriti, primal nature. The three gunas are sattva, raja, tamas.","word":"guna","see_also":["Karttikeya","tattva","world","yajna"],"production_notes":null},{"definition":"\"Qualities.\" Metaphysically, the gunas are fundamental cosmic qualities of nature. The three gunas are tamas (inertia, density, the force of contraction, resistance & dissolution), rajas (stimulative, restlessness, activity; the expansive energy of growth and movement) and sattva (quiescence, rarified, translucent, pervasive, reflecting the light of pure consciousness).   ","word":"gunas","see_also":["Karttikeya","tattva","world","yajna"],"production_notes":null},{"definition":"A Rajput people of the mountains of Nepal; famed warriors.  ","word":"Gurkha","see_also":["Karttikeya","tattva","world","yajna"],"production_notes":null},{"definition":"\"Weighty one,\" indicating an authority of great knowledge or skill. A term used to describe a teacher or guide in any subject, such as music, dance, sculpture, but especially religion. For clarity, the term is often preceded by a qualifying prefix. Hence, terms such as kulaguru (family teacher), vinaguru (vina teacher) and satguru (spiritual preceptor). In Hindu astrology, guru names the planet Jupiter, also known as Brihaspati. According to the Advayataraka Upanishad (14 -- 18), guru means \"dispeller (gu) of darkness (ru).\"  ","word":"guru","see_also":["guru-shishya system","satguru","world","yajna"],"production_notes":null},{"definition":"Devotion to the teacher. The attitude of humility, love and idealization held by a student in any field of study. In the spiritual realm, the devotee strives to see the guru as his higher Self. By attuning himself to the satguru's inner nature and wisdom, the disciple slowly transforms his own nature to ultimately attain the same peace and enlightenment his guru has achieved. Guru bhakti is expressed through serving the guru, meditating on his form, working closely with his mind and obeying his instructions.  ","word":"guru bhakti","see_also":["guru","guru-shishya system","Kularnava Tantra","satguru"],"production_notes":null},{"definition":"\"Song of the guru.\" A popular 352-verse excerpt from the Skanda Purana, wherein Lord Siva tells Parvati of the guru-disciple relationship.  ","word":"Guru Gita","see_also":["guru","guru-shishya system","Kularnava Tantra","satguru"],"production_notes":null},{"definition":"Preceptor's birthday, celebrated as an annual festival by devotees. A padapuja, ritual bathing of his feet, is usually performed. If he is not physically present, the puja is done to the shri paduka, \"revered sandals,\" which represent the guru and hold his vibration. ","word":"Guru Jayanti","see_also":["padapuja","guru-shishya system","Kularnava Tantra","satguru"],"production_notes":null},{"definition":"  ","word":"guru lineage","see_also":["guruparampara","guru-shishya system","Kularnava Tantra","satguru"],"production_notes":null},{"definition":"Spiritual head of a traditional aadheenam.  ","word":"Guru Mahasannidhanam","see_also":["aadheenakartar","guru-shishya system","Kularnava Tantra","satguru"],"production_notes":null},{"definition":null,"word":"Guru Nanak (Nanak)","see_also":["Adi Granth","Sikhism","Kularnava Tantra","satguru"],"production_notes":null},{"definition":"\"Preceptorial succession\" (literally, \"from one to another\"). A line of spiritual gurus in authentic succession of initiation; the chain of mystical power and authorized continuity, passed from guru to guru. Cf: sampradaya.  ","word":"guru parampara","see_also":["Adi Granth","Sikhism","Kularnava Tantra","satguru"],"production_notes":null},{"definition":"\"Preceptorial succession\" (literally, \"from one to another\"). A line of spiritual gurus in authentic succession of initiation; the chain of mystical power and authorized continuity, passed from guru to guru. Cf: sampradaya.  ","word":"guru parampara","see_also":["Adi Granth","Sikhism","Kularnava Tantra","satguru"],"production_notes":null},{"definition":"Occurring on the full moon of July, Guru Purnima is for devotees a day of rededication to all that the guru represents. It is occasioned by padapuja -- ceremonial worship of the guru's sandals, which represent his holy feet.  ","word":"Guru Purnima","see_also":["guru-shishya system","Sikhism","Kularnava Tantra","satguru"],"production_notes":null},{"definition":null,"word":"guru-disciple","see_also":["guru-shishya system","Sikhism","Kularnava Tantra","satguru"],"production_notes":null},{"definition":"\"Master-disciple system.\"An important education system of Hinduism whereby the teacher conveys his knowledge and tradition to a student. Such knowledge, whether it be Vedic-Agamic art, architecture or spirituality, is imparted through the developing relationship between guru and disciple. The principle of this system is that knowledge, especially subtle or advanced knowledge, is best conveyed through a strong human relationship based on ideals of the student's respect, commitment, devotion and obedience, and on personal instruction by which the student eventually masters the knowledge the guru embodies.  ","word":"guru-shishya system","see_also":["guru","guru bhakti","Hindu","satguru"],"production_notes":null},{"definition":"\"Devotion to the teacher.\" The attitude of humility, love and loyality held by a student in any field of study. In the spiritual realm, the devotee strives to see the guru as his higher Self. By attuning himself to the satguru's inner nature and wisdom, the disciple slowly transforms his own nature to ultimately attain the same peace and enlightenment his guru has achieved.  ","word":"gurubhakti","see_also":["guru","guru-shishya system","satguru","satguru"],"production_notes":null},{"definition":"\"Divine\" or \"radiant preceptor.\" From guru, \"teacher\" and deva, \"angel.\" An affectionate, respectful title for the satguru. An affectionate, yet respectful term used to address the guru or spiritual master. Part of the name of His Holiness Gurudeva Sivaya Subramuniyaswami. ","word":"Gurudeva","see_also":["guru","satguru","deva","satguru"],"production_notes":null},{"definition":"A training center where young boys live and learn in residence with their teacher. Kula means \"family.\"  ","word":"gurukula","see_also":["ashrama","brahmacharya","deva","satguru"],"production_notes":null},{"definition":"\"Service to the guru.\" In Living with Siva, guruthondu refers to the period of service that all young men of Gurudeva's Saiva Church are expected to fulfill in a monastery, at least six months and ideally two years, prior to marriage. It also refers to the three-hour period that monastics devote in specific projects, working under the guru's direction, performed as a personal vigil, preceded and ended with a ceremony in the temple.  ","word":"guruthondu","see_also":["ashrama","brahmacharya","deva","satguru"],"production_notes":null},{"definition":"To flow out suddenly and plentifully.   ","word":"gush","see_also":["ashrama","brahmacharya","deva","satguru"],"production_notes":null},{"definition":"A short but strong blast of wind; an outburst.     ","word":"gust","see_also":["ashrama","brahmacharya","deva","satguru"],"production_notes":null}],"results":115}