{"entries":[{"definition":"Sanctified; consecrated. Highly venerated; sacrosanct.    ","word":"hallowed","see_also":null,"production_notes":null},{"definition":"A luminous ring or disk of light surrounding the heads of great spiritual teachers. An aura.  ","word":"halo","see_also":["aura"],"production_notes":null},{"definition":"To prevent progress, or free movement.    ","word":"hamper","see_also":["aura"],"production_notes":null},{"definition":"\"Swan;\" more accurately, the high-flying wild goose Anser indicus. The vahana, vehicle, of the God Brahma. It has various meanings, including Supreme Soul and individual soul. It is a noble symbol for an adept class of renunciates (paramahamsa) -- winging high above the mundane, driving straight toward the goal, or of the discriminating yogi who -- like the graceful swan said to be able to extract milk from water -- can see the Divine and leave the rest. The hamsa mantra indicates the sound made by the exhalation (ha) and inhalation (sa) of the breath.  ","word":"hamsa","see_also":["paramahamsa"],"production_notes":null},{"definition":"(Hindi) \"Large jawed.\" The powerful monkey God-King of the epic, Ramayana, and the central figure in the famous drama, Hanuman-Nataka. The perfect devoted servant to his master, Rama, this popular Deity is the epitome of dasya bhakti.  ","word":"Hanuman","see_also":["paramahamsa"],"production_notes":null},{"definition":"Dependent on mere chance; casual.  ","word":"haphazard","see_also":["paramahamsa"],"production_notes":null},{"definition":"In the Native American beliefs, the place where the deceased go after death.     ","word":"Happy Hunting Grounds","see_also":["paramahamsa"],"production_notes":null},{"definition":"\"Vishnu.\"  ","word":"Hari","see_also":["Brahma","Vishnu"],"production_notes":null},{"definition":"\"Vishnu-Siva.\" Also known as Shankaranarayana,an icon of the Supreme One, in which the right half is Siva and left half is Vishnu. It symbolizes the principle that Siva and Vishnu are not two separate Deities.  ","word":"Hari-Hara","see_also":["Brahma","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"\"The golden one\" holds four prevalent emblems: noose, goad, tusk and modaka. ","word":"Haridra Ganapati","see_also":["Brahma","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"\"Child of God.\"  ","word":"harijan","see_also":["varna dharma\n","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"To listen attentively; give heed.    ","word":"harken","see_also":["varna dharma\n","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"To bring about agreement or harmony.    ","word":"harmonize","see_also":["varna dharma\n","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"To move or act swiftly. To hurry, speed up.    ","word":"hasten","see_also":["varna dharma\n","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"Done or made too quickly to be accurate or wise; rash.   ","word":"hasty","see_also":["varna dharma\n","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"\"Sun\/moon yoga.\" Ha and tha are the sun and moon nerves ending in the nasal region of the head. They correspond to the pingala and ida nadis--mental and emotional currents--flowing up, in a crisscross pattern, the sides of the kundalini nadi: sushumna. Through breath control--ha is inbreath, tha is outbreath--and the manipulation of the physical\/astral bodies through specific series of asanas (postures) and mudras (bodily positions), the ida and pingala currents are perfectly balanced and the yogi functions in his sushumna (kundalini) nadi. The yogi is then prepared for deep meditation, following raja yoga, or kundalini yoga under the guidance of a guru. Besides its spiritual benefits, hatha yoga results in purification of the subconscious mind and robust physiological health contributing towards longevity. Hatha yoga is an ancient Natha Sampradaya science--its first historical appearance being on the famous Pasupati seal from the 6,000 year-old Indus Valley empire. Hatha yoga is propounded in the Saiva Agamas, Tirumular's Tirumantiram and Patanjali's Yoga Sutras. It was made famous by Gorakhnath of the Adinatha lineage in the 10th century C.E. From India, hatha yoga was exported to China and Tibet.   ","word":"hatha yoga","see_also":["varna dharma\n","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"\"Sun\/moon yoga.\" Ha and tha are the sun and moon nerves ending in the nasal region of the head. They correspond to the pingala and ida nadis--mental and emotional currents--flowing up, in a crisscross pattern, the sides of the kundalini nadi: sushumna. Through breath control--ha is inbreath, tha is outbreath--and the manipulation of the physical\/astral bodies through specific series of asanas (postures) and mudras (bodily positions), the ida and pingala currents are perfectly balanced and the yogi functions in his sushumna (kundalini) nadi. The yogi is then prepared for deep meditation, following raja yoga, or kundalini yoga under the guidance of a guru. Besides its spiritual benefits, hatha yoga results in purification of the subconscious mind and robust physiological health contributing towards longevity. Hatha yoga is an ancient Natha Sampradaya science--its first historical appearance being on the famous Pasupati seal from the 6,000 year-old Indus Valley empire. Hatha yoga is propounded in the Saiva Agamas, Tirumular's Tirumantiram and Patanjali's Yoga Sutras. It was made famous by Gorakhnath of the Adinatha lineage in the 10th century C.E. From India, hatha yoga was exported to China and Tibet.   ","word":"hatha yoga","see_also":["varna dharma\n","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"\"Elucidation of hatha yoga.\" A 14th-century text of 389 verses by Svatmarama Yogin that describes the philosophy and practices of hatha yoga. It is widely used in yoga schools today.  ","word":"Hatha Yoga Pradipika","see_also":["varna dharma\n","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"\"Making oblations through fire.\" The Vedic fire ritual. Same as homa. Can also refer to the offering place, or kunda. Havis and havya name the offerings. ","word":"havana","see_also":["homa","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"\"Offering pit.\" The fire pit, usually lined with bricks, into which offerings are placed during havana, or homa, rites.  ","word":"havana kunda","see_also":["homa","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"A harbor. Metaphorically a place of rest or refuge; a sanctuary.  ","word":"haven","see_also":["homa","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"Widespread destruction, disorder, or chaos.  ","word":"havoc","see_also":["homa","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"Cloudy. Not clearly defined; unclear or vague.    ","word":"hazy","see_also":["homa","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"Anahata chakra. Center of direct cognition.  ","word":"heart chakra","see_also":["chakra","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"The celestial spheres, including the causal plane and the higher realms of the subtle plane, where souls rest and learn between births, and mature souls continue to evolve after moksha. Heaven is often used by translators as an equivalent to the Sanskrit Svarga.  ","word":"heaven","see_also":["loka","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"Dedicated to or obsessed with the pursuit of pleasure.  ","word":"hedonist","see_also":["loka","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"To pay close attention to; take careful notice of.    ","word":"heed","see_also":["loka","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"Grossly wicked or reprehensible; abominable.  ","word":"heinous","see_also":["loka","murti","Parameshvara","Vishnu"],"production_notes":null},{"definition":"Naraka. An unhappy, mentally and emotionally congested, distressful area of consciousness. Hell is a state of mind that can be experienced on the plane of physical existence or in the sub-astral plane (Naraka) after the death of the physical body. It is accompanied by the tormented emotions of hatred, remorse, resentment, fear, jealousy and self-condemnation. However, in the Hindu view, the hellish experience is not permanent, but a temporary condition of one's own making.  ","word":"hell","see_also":["See asura","loka","Parameshvara","Vishnu"],"production_notes":null},{"definition":"\"From here.\" For this reason; therefore.    ","word":"hence","see_also":["See asura","loka","Parameshvara","Vishnu"],"production_notes":null},{"definition":"One that gives an announcement or indication of something to come; a harbinger.  ","word":"herald","see_also":["See asura","loka","Parameshvara","Vishnu"],"production_notes":null},{"definition":"\"Protector of the weak\" is a five-faced murti of Ganesha. He rides a lion and gestures protection and blessing. ","word":"Heramba Ganapati","see_also":["See asura","loka","Parameshvara","Vishnu"],"production_notes":null},{"definition":"An opinion or belief that is strongly at variance with beliefs, customs within an established religion.  ","word":"heresy","see_also":["See asura","loka","Parameshvara","Vishnu"],"production_notes":null},{"definition":"A tradition passed down from preceding generations as an inheritance.    ","word":"heritage","see_also":["See asura","loka","Parameshvara","Vishnu"],"production_notes":null},{"definition":"One withdrawn from society, living a solitary life; an anchorite.   ","word":"hermit","see_also":["See asura","loka","Parameshvara","Vishnu"],"production_notes":null},{"definition":"Medical intervention that provides breathing or heart function for someone whose body cannot sustain these processes on its own. Such measures today include cardiopulmonary resuscitation (CPR) and artificial respiration by human or by machine. Heroic measures span the gamut from emergency intervention, such as in an auto accident or a near drowning, to applying mechanical devices to the body of an elderly person who has suffered organ failure who would expire without such intrusion. Such heroic measures are welcomed in the event of accident or disease as temporary measures when recovery is likely, but they are not advised as long-term life support with little or no hope of recovery, especially in advanced years when death is imminent. It is the latter artifical extension of life beyond the natural capacity of the body to sustain itself or recover from an injury that Living with Siva advises against.  ","word":"heroic measures","see_also":["See asura","loka","Parameshvara","Vishnu"],"production_notes":null},{"definition":"\"Different opinion.\" Opposed to or departing from established doctrines or beliefs. Opposite of orthodox, \"straight opinion.\"  ","word":"heterodox","see_also":["nastika","loka","Parameshvara","Vishnu"],"production_notes":null},{"definition":"Of or characterized by sexual attraction for only members of the opposite sex.  ","word":"heterosexual","see_also":["bisexual","homosexual","sexuality","Vishnu"],"production_notes":null},{"definition":"A group of beings arranged in order of rank or class; as a hierarchy of God, Gods and devas.    ","word":"hierarchy","see_also":["bisexual","homosexual","sexuality","Vishnu"],"production_notes":null},{"definition":"Expressions indicating man's refined, soulful qualities on the one hand, and his base, instinctive qualities on the other.  ","word":"higher nature, lower nature","see_also":["kosha","mind (five states)","soul","Vishnu"],"production_notes":null},{"definition":"These renowned pilgrimage sites include Mount Kailasha (in Tibet) and Lake Manasarovar at its base; Kedarnath (in Garhwal, Uttara Pradesh) and Amarnath, the ice Linga cave temple in Kashmir.  ","word":"Himalayan abodes of Siva","see_also":["kosha","mind (five states)","soul","Vishnu"],"production_notes":null},{"definition":"An educational and publishing institution of Saiva Siddhanta Church founded by Sivaya Subramuniyaswami in 1957. The Academy's objective is to spread the teachings of Sanatana Dharma through the quarterly magazine HINDUISM TODAY, Innersearch travel-study programs, The Master Course trilogy of Dancing with Siva, Living with Siva and Merging with Siva, as well as other publications and web resources, all as a public service to Hindus worldwide. ","word":"Himalayan Academy","see_also":["Hinduism Today","Subramuniyaswami","soul","Vishnu"],"production_notes":null},{"definition":"\"Abode of snow.\" The mountain system extending along the India-Tibet border and through Pakistan, Nepal and Bhutan.  ","word":"Himalayas","see_also":["Hinduism Today","Subramuniyaswami","soul","Vishnu"],"production_notes":null},{"definition":"\"Injury;\" \"harm;\" \"hurt.\" Injuriousness, hostility -- mental, verbal or physical.  ","word":"himsa","see_also":["ahimsa","Subramuniyaswami","soul","Vishnu"],"production_notes":null},{"definition":"A follower of, or relating to, Hinduism. Generally, one is understood to be a Hindu by being born into a Hindu family and practicing the faith, or by professing oneself a Hindu. Acceptance into the fold is recognized through the name-giving sacrament, a temple ceremony called namakarana samskara, given to born Hindus shortly after birth, and to Hindus by choice who have proven their sincerity and been accepted by a Hindu community. Full conversion is completed through disavowal of previous religious affiliations and legal change of name. While traditions vary greatly, all Hindus rely on the Vedas as scriptural authority and generally attest to the following nine principles: 1) There exists a one, all-pervasive Supreme Being who is both immanent and transcendent, both creator and unmanifest Reality. 2) The universe undergoes endless cycles of creation, preservation and dissolution. 3) All souls are evolving toward God and will ultimately find moksha: spiritual knowledge and liberation from the cycle of rebirth. Not a single soul will be eternally deprived of this destiny. 4) Karma is the law of cause and effect by which each individual creates his own destiny by his thoughts, words and deeds. 5) The soul reincarnates, evolving through many births until all karmas have been resolved. 6) Divine beings exist in unseen worlds, and temple worship, rituals, sacraments, as well as personal devotionals, create a communion with these devas and Gods. 7) A spiritually awakened master or satguru is essential to know the transcendent Absolute, as are personal discipline, good conduct, purification, self-inquiry and meditation. 8) All life is sacred, to be loved and revered, and therefore one should practice ahimsa, nonviolence. 9) No particular religion teaches the only and exclusive way to salvation above all others. Rather, all genuine religious paths are facets of God's pure love and light, deserving tolerance and understanding. ","word":"Hindu","see_also":["Hinduism","Subramuniyaswami","soul","Vishnu"],"production_notes":null},{"definition":null,"word":"Hindu astrology","see_also":["jyotisha","Subramuniyaswami","soul","Vishnu"],"production_notes":null},{"definition":null,"word":"Hindu cosmology","see_also":["loka","three worlds","soul","Vishnu"],"production_notes":null},{"definition":"A publicly supported charitable foundation established by Satguru Sivaya Subramuniyaswami in December, 1993, as a public service. Its philanthropic mission is to set up and maintain secure, professionally managed endowments to offer financial support for individuals, religious leaders and institutions of all lineages of Sanatana Dharma. www.HHEonline.org  ","word":"Hindu Heritage Endowment","see_also":["loka","three worlds","soul","Vishnu"],"production_notes":null},{"definition":"Hindu unity in diversity. A major contemporary theme according to which Hindu denominations are mutually supportive and work together in harmony, while taking care not to obscure or lessen their distinctions or unique virtues. The underlying principle is that Hinduism will be strong if each of its sects and lineages is vibrant.  ","word":"Hindu solidarity","see_also":["Hinduism","three worlds","soul","Vishnu"],"production_notes":null},{"definition":"Often known as the Sanatana Dharma or eternal faith, or the Vaidika Dharma, the religion of the Vedas. The most ancient religion in the world; the only religion not founded by man. Encompasses a broad spectrum of religious philosophies ranging from pluralistic theism to absolute monism. There are three main sects: Saivism, Vaishnavism, Saktism--and liberal, non-sectarian forms, such as the Smarta Sampradaya.   ","word":"Hinduism","see_also":["Hinduism","three worlds","soul","Vishnu"],"production_notes":null},{"definition":"India's indigenous religious and cultural system, followed today by nearly one billion adherents, mostly in India, but with the large diaspora in many other countries. Also called Sanatana Dharma, \"Eternal Religion\" and Vaidika Dharma, \"Religion of the Vedas.\" Hinduism is the world's most ancient religion and encompasses a broad spectrum of philosophies ranging from pluralistic theism to absolute monism. It is a family of myriad faiths with four primary denominations: Saivism, Vaishnavism, Shaktism and Smartism. These four hold such divergent beliefs that each is a complete and independent religion. Yet, they share a vast heritage of culture and belief -- karma, dharma, reincarnation, all-pervasive Divinity, temple worship, sacraments, manifold Deities, the guru-shishya tradition and a reliance on the Vedas as scriptural authority. From the rich soil of Hinduism long ago sprang various other traditions. Among these were Jainism, Buddhism and Sikhism, which rejected the Vedas and thus emerged as completely distinct religions, dissociated from Hinduism, while still sharing many philosophical insights and cultural values with their parent faith. Though the genesis of the term is controversial, the consensus is that the term Hindu or Indu was used by the Persians to refer to the inhabitants of the Indus Valley as early as 500 BCE. Additionally, Indian scholars point to the appearance of the related term Sindhu in the ancient Rig Veda Samhita. Janaki Abhisheki writes (Religion as Knowledge: The Hindu Concept, p. 1): \"Whereas today the word Hindu connotes a particular faith and culture, in ancient times it was used to describe those belonging to a particular region. About 500 BCE we find the Persians referring to 'Hapta Hindu.' This referred to the region of Northwest India and the Punjab (before partition). The Rig Veda (the most ancient scripture of the Hindus) uses the word Sapta Sindhu singly or in plural at least 200 times. Sindhu is the River Indus. Panini, the great Sanskrit grammarian, also uses the word Sindhu to denote the country or region.\" While the Persians substituted h for s, the Greeks ignored the h and pronounced the word as 'India' for the country and 'Indoi' for the people. Dr. S. Radhakrishnan similarly observed, \"The Hindu civilization is so called since its original founders or earliest followers occupied the territory drained by the Sindhu River system corresponding to the Northwest Frontier Province and the Punjab. This is recorded in the Rig Veda, the oldest of the Vedas, the Hindu scriptures, which give their name to this period of Indian history. The people on the Indian side of the Sindhu were called Hindus by the Persians and the later Western invaders. That is the genesis of the word Hindu\" (The Hindu View of Life, p. 12).  ","word":"Hinduism (Hindu Dharma)","see_also":["Hindu","three worlds","soul","Vishnu"],"production_notes":null},{"definition":"The Hindu family magazine founded by Satguru Sivaya Subramuniyaswami in 1979 and published by Himalayan Academy to affirm Sanatana Dharma and record the modern history of a billion-strong global religion in renaissance. This award-winning, lavishly illustrated, all color, computer-produced news and information resource reaches thousands of readers in over 150 countries throughout the world.  ","word":"HINDUISM TODAY","see_also":["Himalayan Academy","three worlds","soul","Vishnu"],"production_notes":null},{"definition":"Latin American; relating to their culture.  ","word":"Hispanic","see_also":["Himalayan Academy","three worlds","soul","Vishnu"],"production_notes":null},{"definition":"Until this time.    ","word":"hitherto","see_also":["Himalayan Academy","three worlds","soul","Vishnu"],"production_notes":null},{"definition":"So old as to inspire veneration; ancient.    ","word":"hoary","see_also":["Himalayan Academy","three worlds","soul","Vishnu"],"production_notes":null},{"definition":"Vibhuti.  ","word":"holy ash","see_also":["See tilaka","tripundra","vibhuti","Vishnu"],"production_notes":null},{"definition":"The feet of God, a God, satguru or any holy person, often represented by venerable sandals, called shri paduka in Sanskrit and tiruvadi in Tamil. The feet of a divinity are considered especially precious as they represent the point of contact of the Divine and the physical, and are thus revered as the source of grace. The sandals or feet of the guru are the object of worship on his jayanti (birthday), on Guru Purnima and other special occasions.  ","word":"holy feet","see_also":["satguru","tripundra","vibhuti","Vishnu"],"production_notes":null},{"definition":"Another name for the ethical and moral scripture Tirukural (\"Holy couplets''), written by Saint Tiruvalluvar on dried ola leaves over 2,000 years ago near present-day Madras, South India. Saint Tiruvalluvar was a householder and a weaver by profession. His Tirukural or Holy Kural, written in the Tamil language, embodies a treasury of knowledge on conduct, human experience and Hindu dharma. In 1,330 verses, its advice ranges from household finance to affairs of state, from the bravery of warriors to the budding love of adolescents. Today the Holy Kural is widely studied as a guide to the practical application of religion in daily life. Acclaimed the \"Tamil Dharma Shastra,\" it forms a cornerstone of virtuous living for millions of Hindus. It is a primary scripture of Saiva Siddhanta Church, whose members study it and refer to it often and apply its timeless wisdom to their lives.   ","word":"Holy Kural","see_also":["Tirukural","tripundra","vibhuti","Vishnu"],"production_notes":null},{"definition":"A divine ordination or covenant, conferring religious authority. Vows that members of a religious body make, especially a monastic body or order, such as the vows of renunciation made by a sannyasin at the time of his initiation (sannyasa diksha), which establish a covenant with the ancient holy order of sannyasa. Sannyasins, the wearers of the ocher robe, are the ordained religious leaders of Hinduism.  ","word":"holy orders","see_also":["sannyasa diksha","tripundra","vibhuti","Vishnu"],"production_notes":null},{"definition":"A ceremony dating from Vedic times in which oblations are offered into a fire built according to scriptural injunctions; a ritual to communicate with God, Gods and devas. Also called yajna or havan.  ","word":"homa","see_also":["sannyasa diksha","tripundra","vibhuti","Vishnu"],"production_notes":null},{"definition":"A ceremony dating from Vedic times in which oblations are offered into a fire built according to scriptural injunctions; a ritual to communicate with God, Gods and devas. Also called yajna or havan.  ","word":"homa","see_also":["sannyasa diksha","tripundra","vibhuti","Vishnu"],"production_notes":null},{"definition":"Human beings, man; the species including all existing races of mankind.  ","word":"Homo sapiens","see_also":["sannyasa diksha","tripundra","vibhuti","Vishnu"],"production_notes":null},{"definition":"Of or characterized by sexual attraction for members of one's own gender. Self-appellation is gay, especially for males, while female homosexuals generally use the term lesbian.  ","word":"homosexual","see_also":["bisexual","gay","heterosexual","sexuality"],"production_notes":null},{"definition":"One who moves quickly from one thing to the next.    ","word":"hopper","see_also":["bisexual","gay","heterosexual","sexuality"],"production_notes":null},{"definition":"Dreadful.    ","word":"horrendous","see_also":["bisexual","gay","heterosexual","sexuality"],"production_notes":null},{"definition":"Terrifying, causing horror.    ","word":"horrific","see_also":["bisexual","gay","heterosexual","sexuality"],"production_notes":null},{"definition":"An institution that provides shelter and care to the terminally ill.    ","word":"hospice","see_also":["bisexual","gay","heterosexual","sexuality"],"production_notes":null},{"definition":"Hospitality toward special guests in Hindu homes is extraordinary. It follows the Vedic edict that the guest is God in one of many forms. Therefore, greetings and hospitality are offered as if to a God.  While each visitor, whether close or distant, is treated with love and generosity, a protocol is observed on special occasions for honored guests in the South Indian\/Sri Lankan Hindu tradition. The house is decorated with tombais (ornaments made from palm leaves) and mango leaves above the front door. Outside the front door on the porch are set a kuttuvilaku (standing oil lamp) and kumbha (water pot with five mango leaves and a decorated coconut, representing Lord Ganesha). Kolams (floor decorations made from colored rice flour) are drawn at the threshold or gate of the home.   Guests are greeted at the door with offerings of vibhuti, kunkuma and chandana, then sprinkled lightly with rose water and given a small candy. They then enter the home and are led into the shrine room where the elder man of the house performs arati to Ganesha, Murugan and Siva. Following the arati, everyone goes into the communal room of the house and arranges themselves in a chakravala, or a circle according to age, first the men, then the ladies, each younger sitting to his or her elder's left. The most senior male leads everyone in a peaceful invocation, then bhajanas are led and sung by all. Other activities follow.   For meals, mats are laid on the floor in two lines, one side for men and another for ladies. Banana leaves are placed before each person, sometimes on top of plates. The lady of the house and the youngest women serve everyone. Salt is first placed at the top right corner of each leaf, followed by the curries and rice with sambar. Seconds are offered until everyone is satisfied. After the initial rice with sambar, rice is served with rasam and then with curd, or yogurt, as well as more salt, if necessary, and pickles. Tumblers of water and rasam are available for each guest (although usually water only is served nowadays). Kesari, payasam or other sweets and tea are served after the meal. When the meal is concluded, very special guests would be offered a bowl of water to wash their hands where they sit. Hands are never washed in the kitchen sink, but the bathroom is okay. In Asia a special sink is most often located in the room where meals are taken. The hostess, standing and facing East, gives each married lady kunkuma and all guests a gift upon their departure, often as simple as a few betel leaves or a candy. Friends, relatives and casual guests are treated according to a more informal protocol.  ","word":"hosting guests","see_also":["bisexual","gay","heterosexual","sexuality"],"production_notes":null},{"definition":"To float or be suspended in the air.    ","word":"hover","see_also":["bisexual","gay","heterosexual","sexuality"],"production_notes":null},{"definition":"\"Remorse; modesty\" One of the traditional niyamas of ashtanga yoga, hri is being modest and expressing shame upon committing a misdeed.   ","word":"hri","see_also":["yama","niyama","heterosexual","sexuality"],"production_notes":null},{"definition":"Chinese pilgrim who toured India ca 630. His travel diary is a rare and colorful source of information about the India of his day.  ","word":"Hsuen Tsang (Xuan-zang)","see_also":["yama","niyama","heterosexual","sexuality"],"production_notes":null},{"definition":"Center of a wheel. Center of interest, importance or activity.    ","word":"hub","see_also":["yama","niyama","heterosexual","sexuality"],"production_notes":null},{"definition":"Having specific color.   ","word":"hued","see_also":["yama","niyama","heterosexual","sexuality"],"production_notes":null},{"definition":"The natural growth and expression through four stages of life. Known as ashrama dharma.  ","word":"human dharma","see_also":["ashrama dharma","dharma","heterosexual","sexuality"],"production_notes":null},{"definition":"One devoted to the promotion of human welfare.  ","word":"humanitarian","see_also":["ashrama dharma","dharma","heterosexual","sexuality"],"production_notes":null},{"definition":"To hurt the pride or dignity of by causing to appear foolish or unworthy.    ","word":"humiliate","see_also":["ashrama dharma","dharma","heterosexual","sexuality"],"production_notes":null},{"definition":"Modesty in behavior, attitude, or spirit; not arrogant or prideful.    ","word":"humility","see_also":["ashrama dharma","dharma","heterosexual","sexuality"],"production_notes":null},{"definition":"A small brightly colored bird with a long, slender beak for extracting nectar, and narrow wings that vibrate very rapidly, often with a humming sound, enabling it to hover in one place.  ","word":"hummingbird","see_also":["ashrama dharma","dharma","heterosexual","sexuality"],"production_notes":null},{"definition":"Said or done in a laughable, amusing or funny way.  ","word":"humorously","see_also":["ashrama dharma","dharma","heterosexual","sexuality"],"production_notes":null},{"definition":null,"word":"humors (or bodily humors)","see_also":["ayurveda","bodily humor","dosha","sexuality"],"production_notes":null},{"definition":"An intuitive feeling.  ","word":"hunch","see_also":["ayurveda","bodily humor","dosha","sexuality"],"production_notes":null},{"definition":"\"Offering box,\" from hun, \"to sacrifice.\" A strongbox inside Hindu temples into which devotees place their contributions.  ","word":"hundi","see_also":["ayurveda","bodily humor","dosha","sexuality"],"production_notes":null},{"definition":"Anything of mixed origin, such as a plant produced by crossing parent stock of unlike genetic constitution.   ","word":"hybrid","see_also":["ayurveda","bodily humor","dosha","sexuality"],"production_notes":null},{"definition":"Songs of praise to God, Gods or guru.  ","word":"hymns","see_also":["ayurveda","bodily humor","dosha","sexuality"],"production_notes":null},{"definition":"A sleeplike state, usually induced by another person, in which the subject may experience heightened suggestibility, forgotten or suppressed memories, and hallucinations.    ","word":"hypnosis","see_also":["ayurveda","bodily humor","dosha","sexuality"],"production_notes":null},{"definition":"Professing beliefs, feelings, or virtues that one does not hold or possess; false pretensions.  ","word":"hypocrisy","see_also":["ayurveda","bodily humor","dosha","sexuality"],"production_notes":null},{"definition":"Pertaining to the hypogastrium, the lowest of the abdomen's three median regions.    ","word":"hypogastric","see_also":["ayurveda","bodily humor","dosha","sexuality"],"production_notes":null},{"definition":"The part of the brain that regulates bodily temperature, certain metabolic processes and other autonomic activities.    ","word":"hypothalamus","see_also":["ayurveda","bodily humor","dosha","sexuality"],"production_notes":null},{"definition":"Something taken to be true for the purpose of argument or investigation; an assumption.  ","word":"hypothesis","see_also":["ayurveda","bodily humor","dosha","sexuality"],"production_notes":null},{"definition":"Excessive or uncontrollable emotion, such as fear or panic.     ","word":"hysteria","see_also":["ayurveda","bodily humor","dosha","sexuality"],"production_notes":null}],"results":90}