{"entries":[{"definition":"Belongs to the Atharva Veda.This short scripture teaches of knowledge attained in renunciation.   ","word":"Jabala Upanishad","see_also":null,"production_notes":null},{"definition":"\"World teacher.\" In 1986 the World Religious Parliament of New Delhi named five world leaders who were most active in spreading Sanatana Dharma outside India: H.H. Swami Chinmayananda of Chinmaya Missions, India; Satguru Sivaya Subramuniyaswami of Saiva Siddhanta Church and Himalayan Academy, USA; Yogiraj Amrit Desai of Kripalu Yoga Center, USA; Pandit Tej Ramji Sharma of Nepali Baba, Nepal; and Swami Jagpurnadas of Maharaj, Mauritius.   ","word":"Jagadacharya","see_also":null,"production_notes":null},{"definition":"A dark, crude sugar made from the sap of certain species of palm.  ","word":"jaggery","see_also":null,"production_notes":null},{"definition":"\"Wakefulness.\" The state of mind in which the senses are turned outward. Conscious mind. One of four states of consciousness, avasthas, described in the Mandukya Upanishad.  ","word":"jagrat","see_also":["avastha","consciousness"],"production_notes":null},{"definition":"\"Wakeful consciousness.\" The conscious mind.  ","word":"jagrat chitta","see_also":["avastha","consciousness"],"production_notes":null},{"definition":"Founder of the Mimamsa Darshana.  ","word":"Jaimini","see_also":["shad darshana","consciousness"],"production_notes":null},{"definition":"A philosophical discourse of the Sama Veda dealing with death, passage to other worlds and reincarnation.  ","word":"Jaiminiya Brahmana Upanishad","see_also":["Upanishad","consciousness"],"production_notes":null},{"definition":"An ancient non-Vedic religion of India made prominent by the teachings of Mahavira (\"Great Hero\"), ca 500 BCE. The Jain Agamas teach reverence for all life, vegetarianism and strict renunciation for ascetics. Jains focus great emphasis on the fact that all souls may attain liberation, each by his own effort. Their great historic saints, called Tirthankaras (\"Ford-Crossers\"), are objects of worship, of whom Mahavira was the 24th and last. Jains number about six million today, living mostly in India.  ","word":"Jainism (Jaina)","see_also":["Mahavira","consciousness"],"production_notes":null},{"definition":"\"Lime.\" ","word":"jambira","see_also":["Mahavira","consciousness"],"production_notes":null},{"definition":"\"Roseapple.\" ","word":"jambu","see_also":["Mahavira","consciousness"],"production_notes":null},{"definition":"\"Plane of creativity, or of liberated mortals.\" The third highest of the seven upper worlds, realm of vishuddha chakra.  ","word":"Janaloka","see_also":["loka","consciousness"],"production_notes":null},{"definition":"\"Moving; wanderer.\" A term used by Vira Saivites, originally to name their mendicant renunciates who walked as homeless sadhus, uplifting others. Now an order of Vira Saivite teachers.  ","word":"jangama","see_also":["Vira Saivism","consciousness"],"production_notes":null},{"definition":"\"Recitation.\" Practice of concentrated and\/or devoted repeating of a mantra, often while counting the repetitions on a mala or strand of beads. It may be done silently or aloud. Sometimes known as mantra yoga, it is one of the ten niyamas (spiritual practices) of ashtanga yoga, serving to quiet the mind prior to meditation. A major sadhana in Hindu spiritual practice, from the simple utterance of a few names of God to extraordinary feats of repeating sacred syllables millions of times for years on end. It is recommended as a cure for pride and arrogance, jealousy, fear and confusion. It harmonizes the doshas and quiets the vrittis. Filling the mind with divine syllables, awakening the divine essence of spiritual energies in the physical body, japa brings forth the amrita. For Saivites, Namah Sivaya in its various forms is the most treasured mantra used in japa. The mantra Hare-Rama-Hare-Krishna is among the foremost Vaishnava mantras. Japa yoga is said to be of 14 kinds: daily (nitya), circumstantial (naimittika), the japa of desired results (kamya), forbidden (nishiddha), penitential (prayashchitta), unmoving (achala), moving (chala), voiced (vachika), whispered (upanshu), bee, or murmured (bhramara), mental (manasa), uninterrupted (akhanda), nonuttered (ajapa) and circumambulatory (pradakshina).  ","word":"japa","see_also":["amrita","mantra","yama-niyama","yoga"],"production_notes":null},{"definition":"\"Garland for incantation.\" A strand of beads for holy recitation, japa, usuallymade of rudraksha, tulasi, sandalwood or crystal. ","word":"japa mala","see_also":["amrita","mantra","yama-niyama","yoga"],"production_notes":null},{"definition":"Irritated, clashing, quarreling, discordant.  ","word":"jarred","see_also":["amrita","mantra","yama-niyama","yoga"],"production_notes":null},{"definition":"\"Rite of birth.\"  ","word":"jatakarma","see_also":["samskaras of birth","mantra","yama-niyama","yoga"],"production_notes":null},{"definition":"\"Crown of matted hair.\" ","word":"jatamukuta","see_also":["samskaras of birth","mantra","yama-niyama","yoga"],"production_notes":null},{"definition":"\"Birth; position assigned by birth; rank, caste, family, race, lineage.\" Jati, more than varna, is the specific determinant of one's social community. Traditionally, because of rules of purity each jati is excluded from social interaction with the others, especially from interdining and intermarriage. In modern times there is also a large group (one-seventh of India's population in 1981) outside the four varnas. These are called scheduled classes, untouchables, jatihita (\"outcaste\"), chandalas (specifically those who handle corpses) and harijan, a name given by Mahatma Gandhi, meaning \"children of God.\" \"Untouchable\" jatis included the nishada (hunter), kaivarta (fisherman) and karavara (leather worker). The varna dharma system -- despite its widespread discrimination against harijans, and the abuse of social status by higher castes -- ensures a high standard of craftsmanship, a sense of community belonging, family integrity and religio-cultural continuity. Caste is not unique to Hinduism and India. By other names it is found in every society. The four varnas, or classes, and myriad jatis, occupational castes, or guilds, form the basic elements of human interaction. ","word":"jati","see_also":["varna dharma","mantra","yama-niyama","yoga"],"production_notes":null},{"definition":"\"Victory!\" ","word":"jaya (jai)","see_also":["varna dharma","mantra","yama-niyama","yoga"],"production_notes":null},{"definition":"\"Birthday.\"  ","word":"jayanti","see_also":["Guru Jayanti","mantra","yama-niyama","yoga"],"production_notes":null},{"definition":"Modern (incorrect) vocalization of Yahweh, Hebrew name for God, introduced by Christian Renaissance scholars.   ","word":"Jehovah","see_also":["Guru Jayanti","mantra","yama-niyama","yoga"],"production_notes":null},{"definition":"A Jewish teacher and prophet in the first century CE whose teachings became the basis of Christianity.  ","word":"Jesus Christ","see_also":["Guru Jayanti","mantra","yama-niyama","yoga"],"production_notes":null},{"definition":"An adherent of Judaism, or descendant of such adherents.  ","word":"Jew","see_also":["Judaism","mantra","yama-niyama","yoga"],"production_notes":null},{"definition":"\"Conqueror.\" The root of the word Jain, implying conquest over the bondage imposed by the phenomenal world.  ","word":"jina","see_also":["Jain","mantra","yama-niyama","yoga"],"production_notes":null},{"definition":"\"Living, existing.\" From jiv, \"to live.\" The individual soul, atman, bound by the three malas (anava, karma and maya). The individuated self (jiva-atman) as opposed to the transcendental Self (parama atman). The jivanmukta is one who is \"liberated while living.\"  ","word":"jiva","see_also":["atman","evolution of the soul","jivanmukta","purusha","soul"],"production_notes":null},{"definition":"\"Liberated soul.\" One who has attained nirvikalpa samadhi -- the realization of the Self, Parashiva -- and is liberated from rebirth while living in a human body. (Contrasted with videhamukta, one liberated at the point of death.) This attainment is the culmination of lifetimes of intense striving, sadhana and tapas, requiring total renunciation, sannyasa (death to the external world, denoted in the conducting of one's own funeral rites), in the current incarnation. While completing life in the physical body, the jivanmukta enjoys the ability to reenter nirvikalpa samadhi again and again. At this time, siddhis can be developed which are carried to the inner worlds after mahasamadhi. Such an awakened jnani benefits the society by simply being who he is. When he speaks, he does so without forethought. His wisdom is beyond reason, yet it does not conflict with reason. Nor does he arrive at what he says through the process of reason, but through the process of ajna-chakra sight.  ","word":"jivanmukta","see_also":["jivanmukti","jnana","kaivalya","moksha","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"\"Liberation while living.\" The state of the jivanmukta. Contrasted with videhamukti, liberation at the point of death.  ","word":"jivanmukti","see_also":["death","jivanmukta","moksha","reincarnation","videhamukti","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"\"Self sacrifice.\"  ","word":"jivayajna","see_also":["yajna","jivanmukta","moksha","reincarnation","videhamukti","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"\"Knowledge; wisdom.\" The matured state of the soul. It is the wisdom that comes as an aftermath of the kundalini breaking through the door of Brahman into the realization of Parashiva, Absolute Reality. The repeated samadhis of Parashiva ever deepen this flow of divine knowing which establishes the knower in an extraordinary point of reference, totally different from those who have not attained this enlightenment. Jnana is the awakened, superconscious state (karana chitta) working within the ordinary experience of the world, flowing into daily life situations. It is the fruition of the progressive stages of charya, kriya and yoga in the Saiva Siddhanta system of spiritual unfoldment. Jnana is sometimes misunderstood as book knowledge, as a maturity or awakening that comes from simply understanding a complex philosophical system or systems. Those who define jnana in this way deny that the path is a progression of charya-kriya-yoga-jnana or of karma-bhakti-raja-jnana. Rather, they say that one can choose his path, and that each leads to the ultimate goal.  ","word":"jnana","see_also":["door of Brahman","God Realization","Saivism","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"\"Gifts of wisdom.\" The karma yoga of printing, sponsoring and distributing Hindu religious literature, pamphlets and books, free of charge as a way of helping others spiritually. ","word":"jnana dana","see_also":["yama-niyama","God Realization","Saivism","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":null,"word":"jnana marga","see_also":["jnana pada","God Realization","Saivism","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"\"Stage of wisdom.\" According to the Saiva Siddhanta rishis, jnana is the last of the four successive padas (stages) of spiritual unfoldment. It is the culmination of the third stage, the yoga pada. Also names the knowledge section of each Agama.  ","word":"jnana pada","see_also":["jnana","pada","Saivism","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"\"Power of wisdom.\" One of Siva's three primary shaktis. Also a name for Lord Karttikeya's vel.  ","word":"jnana shakti","see_also":["Karttikeya","Shakti","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"\"Union of knowledge.\" Describes the esoteric spiritual practices of the fully enlightened being, or jnani. An alternative meaning, popularized by Swami Vivekananda, is the quest for cognition through intellectual religious study, as one of four alternate paths to truth, the other three being bhakti yoga, karma yoga and raja yoga.  ","word":"jnana yoga","see_also":["jnana","yoga","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":null,"word":"Jnanadeva","see_also":["Jnaneshvari","yoga","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"A versified treatise by Gorakshanatha on the duties of a yogi.  ","word":"Jnanamrita","see_also":["Gorakshanatha","yoga","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"\"Agent of perception.\"  ","word":"jnanendriya","see_also":["indriya","yoga","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"Foremost religious treatise in the Marathi language. Written by the Natha saint Jnanesvar (or Jnanadeva) about 1290. It is a verse-by-verse commentary on the Bhagavad Gita.  ","word":"Jnaneshvari","see_also":["indriya","yoga","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":null,"word":"Jnanesvar (Jnaneshvara)","see_also":["Jnaneshvari","yoga","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"\"Sage.\" One who possesses jnana.  ","word":"jnani","see_also":["jivanmukta","jnana","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"Kutumba or kula. The Hindu social unit consisting of several generations of kindred living together under the same roof or in a joining compound. Traditionally, joint families live in a large single home, but in modern times accommodations are often in individual, nuclear homes within a shared compound. The joint family includes the father and mother, sons, grandsons and great-grandsons with their spouses, as well as the daughters, granddaughters and great-granddaughters until they are married -- thus often comprising several married couples and their children. The head of the joint family, called kutumba mukhya (also mukhya or kartri), is the father, supported by the mother, and in his absence, the elder son, guided by his mother and supported by his spouse. From an early age, the eldest son is given special training by his father to assume this future responsibility as head of the family. In the event of the father's death, sacred law does allow for the splitting of the family wealth between the sons. Division of family assets may also be necessary in cases where sons are involved in different professions and live in different places, with an inability for all to get along under one roof, or when the family becomes unmanageably large.  The main characteristics of the joint family are that its members 1) share a common residence, 2) partake of food prepared in the same kitchen, 3) hold their property in common and, 4) ideally, profess the same religion, sect and sampradaya. Each individual family of husband, wife and children is under the guidance of the head of the joint family. All work together unselfishly to further the common good. Each joint family extends out from its home to include a second level of connections as an \"extended family\" (brihatkutumba or mahakutumba).  ","word":"joint family","see_also":["extended family","grihastha dharma","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"To make a brief note.  ","word":"jot","see_also":["extended family","grihastha dharma","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"Concerned with two of the three religions descended from Abraham, Judaism and Christianity, especially in the sense of their shared beliefs.  ","word":"Judaic-Christian","see_also":["extended family","grihastha dharma","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"The religion of over 12 million adherents worldwide (over half in the United States), first of the Abrahamic faiths, founded about 3,700 years ago in Canaan (now Israel) by Abraham, who started the lineage, and in Egypt by Moses, who emancipated the enslaved Jewish tribes. Its major scripture is the Torah.  ","word":"Judaism","see_also":["extended family","grihastha dharma","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"Having or showing good judgment; prudent.  ","word":"judicious","see_also":["extended family","grihastha dharma","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"A critical point in the development of events.  ","word":"juncture","see_also":["extended family","grihastha dharma","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"A sphere of authority; the territorial range of authority.  ","word":"jurisdiction","see_also":["extended family","grihastha dharma","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"\"Light.\" ","word":"jyoti","see_also":["extended family","grihastha dharma","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"From jyoti, \"light.\" \"The science of the lights (or stars).\" Hindu astrology, the knowledge and practice of analyzing events and circumstances, delineating character and determining auspicious moments, according to the positions and movements of heavenly bodies. In calculating horoscopes, jyotisha uses the sidereal (fixed-star) system, whereas Western astrology uses the tropical (fixed-date) method.   ","word":"jyotisha","see_also":["extended family","grihastha dharma","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"One who is versed in the jyotisha shastras and qualified to cast and analyze horoscopes and give counsel and advice on karmic events and timing of innovations in people's lives.  ","word":"jyotisha shastri","see_also":["jyotisha","grihastha dharma","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":"\"Veda-limb of celestial science (astronomy-astrology).\" Ancient texts giving knowledge of astronomy and astrology, for understanding the cosmos and determining proper timing for Vedic rites. (Jyoti means light, of the sun, fire, etc.)  ","word":"Jyotisha Vedanga","see_also":["jyotisha","Vedanga","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null},{"definition":null,"word":"jyotishi","see_also":["See: jyotisha shastri","Vedanga","trishula vel","samadhi","Self Realization","Sivasayujya","videhamukti"],"production_notes":null}],"results":52}