{"entries":[{"definition":"A body of mystical teachings of rabbinical origin, partially based on an esoteric interpretation of the Hebrew scriptures.  ","word":"Kabala","see_also":null,"production_notes":null},{"definition":"Saint Kabirdas (1440-1518), an Indian mystic and world-renowned poet who attempted to bridge Hindu and Muslim thought and preached the essential equality of all men. He was a forerunner of Sikhism, the faith established by his disciple Nanak. The Sikh holy scripture Adi Granth contains over 500 verses by Kabir.  ","word":"Kabir","see_also":null,"production_notes":null},{"definition":"\"Marketplace swami.\" The 159th satguru of the Nandinatha Sampradaya's Kailasa Parampara. Born ca 1804; attained mahasamadhi October 13, 1891. Renouncing his career as a judge in Bangalore, South India, Kadaitswami became a sannyasin and trained under the Rishi from the Himalayas, who sent him on mission to Sri Lanka. He performed severe tapas on an island off the Jaffna coast, awakening many siddhis. For decades he spurred the Sri Lankan Saivites to greater spirituality through inspired talks and demonstrating siddhis. He initiated Chellappaswami as the next satguru in the parampara. Kadaitswami's initiation name was Muthyanandaswami.  ","word":"Kadaitswami","see_also":["Kailasa Parampara","Natha Sampradaya"],"production_notes":null},{"definition":"\"Banana fruit.\" ","word":"kadaliphala","see_also":["Kailasa Parampara","Natha Sampradaya"],"production_notes":null},{"definition":"\"Beyond and within.\" An ancient Tamil appellation for Lord Siva meaning, \"He who is both immanent and transcendent, within and beyond.\"  ","word":"Kadavul","see_also":["Siva","Natha Sampradaya"],"production_notes":null},{"definition":"\"Deep one.\" A priest in the Native Hawaiian religion: 1) Kahuna pule officiated in the temples (heiau) and performed rites for the inauguration of houses. 2) Healer kahunas were medicine men who, depending on their specialty, delivered babies, treated sick children, and plied the arts of magic, diagnosis with fingertips, psychic reading and contacting the spirits of illness. 3) Kaula kahunas were reclusive ascetic prophets who lived aloof from society. A rare few kahuna lineages are carried forth today.  ","word":"kahuna","see_also":["Siva","Natha Sampradaya"],"production_notes":null},{"definition":"(Shum) The state of awareness being aware of itself. Pronounced kaw-eef. ","word":"kaif","see_also":["Shum","Natha Sampradaya"],"production_notes":null},{"definition":"\"Crystalline\" or \"Abode of bliss.\" The four-faced Himalayan peak in Western Tibet; the earthly abode of Lord Siva. Associated with Mount Meru, the legendary center of the universe, it is an important pilgrimage destination for all Hindus, as well as for Tibetan Buddhists. Kailasa is represented in Shaktism by a certain three-dimensional form of the Shri Chakra yantra (also called kailasa chakra).  ","word":"Kailasa","see_also":["Kalias","Shri Chakra"],"production_notes":null},{"definition":"A spiritual lineage of 162 siddhas, a major stream of the Nandinatha Sampradaya, proponents of the ancient philosophy of monistic Saiva Siddhanta. The first of these masters that history recalls was Maharishi Nandinatha (or Nandikesvara) 2,250 years ago, satguru to the great Tirumular, ca 200 BCE, and seven other disciples (as stated in the Tirumantiram): Patanjali, Vyaghrapada, Sanatkumara, Sivayogamuni, Sanakar, Sanadanar and Sananthanar. Tirumular had seven disciples: Malangam, Indiran, Soman, Brahman, Rudran, Kalanga, and Kanjamalayam, each of whom established one or more monasteries and propagated the Agamic lore. In the line of Kalanga came the sages Righama, Maligaideva, Nadantar, Bhogadeva and Paramananda. The lineage continued down the centuries and is alive today -- the first recent siddha known being the \"Rishi from the Himalayas,\" so named because he descended from those holy mountains. In South India, he initiated Kadaitswami (ca 1810 -- 1875), who in turn initiated Chellappaswami(1840 -- 1915). Chellappan passed the mantle of authority to Sage Yogaswami (1872 -- 1964), who in 1949 initiated Sivaya Subramuniyaswami (1927 -- 2001), who in 2001 ordained the current preceptor, Satguru Bodhinatha (1942 -- ).  ","word":"Kailasa Parampara","see_also":["Chellappaswami","Kadaitswami","Natha Sampradaya","Patanjali","Subramuniyaswami","Tirumular","Yogaswami"],"production_notes":null},{"definition":"\"Absolute oneness, aloneness; perfect detachment, freedom.\" Liberation. Kaivalya is the term used by Patanjali and others in the yoga tradition to name the goal and fulfillment of yoga, the state of complete detachment from transmigration. It is virtually synonymous with moksha. Kaivalya is the perfectly transcendent state, the highest condition resulting from the ultimate realization. It is defined uniquely according to each philosophical school, depending on its beliefs regarding the nature of the soul.  ","word":"kaivalya","see_also":["jnana","moksha","samarasa","Sivasayujya","Subramuniyaswami","Tirumular","Yogaswami"],"production_notes":null},{"definition":"A philosophical text of the Atharva Veda. This treatise teaches how to reach Siva through meditation.   ","word":"Kaivalya Upanishad","see_also":["jnana","moksha","samarasa","Sivasayujya","Subramuniyaswami","Tirumular","Yogaswami"],"production_notes":null},{"definition":"1) \"Time,\" \"calculation.\" 2) \"Black\" (of a black or dark blue color); \"death.\"   ","word":"kala (time)","see_also":["jnana","moksha","samarasa","Sivasayujya","Subramuniyaswami","Tirumular","Yogaswami"],"production_notes":null},{"definition":"\"Sixty-four arts.\" A classical curriculum of sacred sciences, studies, arts and skills of cultured living listed in various Hindu shastras. Its most well-known appearance is in the Kama Sutra, an extensive manual devoted to sensual pleasures. The Kama Sutra details as its primary subject matter the 64 secret arts, abhyantara kala, of erotic love. In addition to these it lists 64 bahya kalas, or practical arts, as required study for cultured persons. They are: 1) singing, 2) instrumental music, 3) dancing, 4) painting, 5) forehead adornments, 6) making decorative floral and grain designs on the floor, 7) home and temple flower arranging, 8) personal grooming, 9) mosaic tiling, 10) bedroom arrangements, 11) creating music with water, 12) splashing and squirting with water, 13) secret mantras, 14) making flower garlands, 15) head adornments, 16) dressing, 17) costume decorations, 18) perfumery, 19) jewelry making, 20) magic and illusions, 21) ointments for charm and virility, 22) manual dexterity, 23) skills of cooking, eating and drinking, 24) beverage and dessert preparation, 25) sewing (making and mending garments), 26) embroidery, 27) playing vina and drum, 28) riddles and rhymes, 29) poetry games, 30) tongue twisters and difficult recitation, 31) literary recitation, 32) drama and story telling, 33) verse composition game, 34) furniture caning, 35) erotic devices and knowledge of sexual arts, 36) crafting wooden furniture, 37) architecture and house construction, 38) distinguishing between ordinary and precious stones and metals, 39) metal-working, 40) gems and mining, 41) gardening and horticulture, 42) games of wager involving animals, 43) training parrots and mynas to speak, 44) hairdressing, 45) coding messages, 46) speaking in code, 47) knowledge of foreign languages and dialects, 48) making flower carriages, 49) spells, charms and omens, 50) making simple mechanical devices, 51) memory training, 52) game of reciting verses from hearing, 53) decoding messages, 54) the meanings of words, 55) dictionary studies, 56) prosody and rhetoric, 57) impersonation, 58) artful dressing, 59) games of dice, 60) the game of akarsha (a dice game played on a board), 61) making dolls and toys for children, 62) personal etiquette and animal training, 63) knowledge of dharmic warfare and victory, and 64) physical culture.  These are among the skills traditionally taught to both genders, while emphasizing masculinity in men and femininity in women. Their subject matter draws on such texts as the Vedangas and Upavedas, and the Shilpa Shastras, or craft manuals. Through the centuries, writers have prescribed many more skills and accomplishments. These include sculpture, pottery, weaving, astronomy and astrology, mathematics, weights and measures, philosophy, scriptural study, agriculture, navigation, trade and shipping, knowledge of time, logic, psychology and ayurveda. In modern times, two unique sets of 64 kalas have been developed, one for girls and one for boys.  ","word":"kala -- 64 arts (chatuh shashti kala)","see_also":["Shilpa Shastra","moksha","samarasa","Sivasayujya","Subramuniyaswami","Tirumular","Yogaswami"],"production_notes":null},{"definition":"\"Black-faced\" (probably for a black mark of renunciation worn on the forehead). A Saiva sect issued from Pashupata Saivism at its height (ca 600 -- 1000). As no Kalamukha religious texts exist today, this sect is known only indirectly. They were said to be well organized in temple construction and worship, as well as eccentric and unsocial: eating from human skulls, smearing their bodies with ashes from the cremation ground, carrying a club, wearing matted hair, etc.  ","word":"Kalamukha","see_also":["left-handed","Pashupata Saivism","tantrism","Sivasayujya","Subramuniyaswami","Tirumular","Yogaswami"],"production_notes":null},{"definition":"One of the seven disciples of Rishi Tirumular.  ","word":"Kalanga (Kalanga)","see_also":["Kailasa Parampara","Pashupata Saivism","tantrism","Sivasayujya","Subramuniyaswami","Tirumular","Yogaswami"],"production_notes":null},{"definition":"\"Water pot,\" \"pitcher,\" \"jar.\" In temple rites, a pot of water, kalasha, topped with mango leaves and a husked coconut represents the Deity during special pujas. Kalasha also names the pot-like spires that adorn temple roofs.  ","word":"kalasha","see_also":["Kailasa Parampara","Pashupata Saivism","tantrism","Sivasayujya","Subramuniyaswami","Tirumular","Yogaswami"],"production_notes":null},{"definition":"A tube-like instrument that shows a constantly changing pattern of colors and lights. Anything so changeable.  ","word":"kaleidoscope","see_also":["Kailasa Parampara","Pashupata Saivism","tantrism","Sivasayujya","Subramuniyaswami","Tirumular","Yogaswami"],"production_notes":null},{"definition":"\"Black\" Goddess. A form of Shakti in Her fierce aspect, as worshiped by various sects within Shaktism. She is dark, nude, primordial and fiercely powerful, as of a naked energy untamed. But from the perspective of devotees, She is the incomparable protectress, champion of sadhana and mother of liberation. The Goddess Durga, seated on a tiger, has similar characteristics and is often identified with Kali.  ","word":"Kali","see_also":["Shakti","Shaktism","tantrism","Sivasayujya","Subramuniyaswami","Tirumular","Yogaswami"],"production_notes":null},{"definition":"\"Dark Age.\" The Kali Yuga is the fourth age in the repetitive cycle of four phases of time the universe passes through. It is comparable to the darkest part of the night, as the forces of ignorance are in full power and many of the subtle faculties of the soul are obscured.  ","word":"Kali Yuga","see_also":["Shakti","Shaktism","tantrism","Sivasayujya","Subramuniyaswami","Tirumular","Yogaswami"],"production_notes":null},{"definition":"An exponent of Kashmir Saivism (ca 875) who wrote the Spanda Karikas. Kallata was a disciple of Vasugupta.  ","word":"Kallata (Kallata)","see_also":["Kashmir Saivism","Shaktism","tantrism","Sivasayujya","Subramuniyaswami","Tirumular","Yogaswami"],"production_notes":null},{"definition":"From krlip, \"arranged, ordered.\" 1) Rules for ceremony or sacred living, as in the Kalpa Vedanga. 2) Determination or resolve, as in sankalpa. 3) A vast period of time also known as a day of Brahma, equaling 994 mahayugas, or 4,294,080,000 years.  ","word":"kalpa","see_also":["cosmic cycle","Kalpa Vedanga","sankalpa","yuga","Subramuniyaswami","Tirumular","Yogaswami"],"production_notes":null},{"definition":"\"Procedural (or ceremonial) Veda-limb.\" Also known as the Kalpa Sutras -- a body of three groups of auxiliary Vedic texts: 1) the Shrauta Sutras and Shulba Sutras, on public Vedic rites (yajna), 2) the Grihya Sutras (or Shastras), on domestic rites and social customs, and 3) the Dharma Shastras (or Sutras), on religious law. There are numerous sets of Kalpa Sutras, composed by various rishis. Each set is associated with one of the four Vedas.  ","word":"Kalpa Vedanga","see_also":["Dharma Shastra","Grihya Sutras","Shrauta Shastras","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"\"Wish-fulfilling tree.\" An important symbol in Hindu theology. ","word":"kalpavriksha","see_also":["Dharma Shastra","Grihya Sutras","Shrauta Shastras","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"A town in Maharashtra, South India.  ","word":"Kalyan (Kalyana)","see_also":["Dharma Shastra","Grihya Sutras","Shrauta Shastras","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"\"Pleasure, love; desire.\" Cultural, intellectual and sexual fulfillment. One of four human goals, purushartha.  ","word":"kama","see_also":["Kama Sutras","purushartha","Shrauta Shastras","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"\"Aphorisms on pleasure.\" A fifth-century text by Vatsyayana on erotics. The Kama Shutra and other Kama Shastras are sometimes classed as an Upaveda.  ","word":"Kama Sutra(s)","see_also":["Upaveda","purushartha","Shrauta Shastras","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"\"Vessel, water jar.\" Traditionally earthen or wooden, carried by sannyasins, it symbolizes the renunciate's simple, self-contained life. The tree from which kamandalus are traditionally made is the kamandalutaru.  ","word":"kamandalu","see_also":["sannyasa dharma","sannyasin","Shrauta Shastras","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"An important scripture among the 28 Saiva Siddhanta Agamas, widely available today. The verses from its kriya pada, on ritual and temple construction, are a crucial reference for South Indian priests.  ","word":"Kamika Agama","see_also":["Saiva Agamas","sannyasin","Shrauta Shastras","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"Founder of the Vaisheshika Darshana, author of the Vaisheshika Sutras.  ","word":"Kanada","see_also":["shad darshana","sannyasin","Shrauta Shastras","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"A mystical 51-verse poem in praise of Lord Karttikeya-Murugan composed by the Tamil saint, Arunagirinathar (ca 1500). It describes the narrator's arduous path to Ultimate Reality.   ","word":"Kandar Anubhuti","see_also":["shad darshana","sannyasin","Shrauta Shastras","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"The central, primary God of the Hawaiians, Lord of procreation, associated with dawn, sun and sky, creator of the three worlds (upper heaven, lower heaven and earth) and the beings within them.  ","word":"Kane","see_also":["shad darshana","sannyasin","Shrauta Shastras","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"One of the seven disciples of Rishi Tirumular.  ","word":"Kanjamalayam","see_also":["Kailasa Parampara","sannyasin","Shrauta Shastras","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"One of four modern Dravidian languages, and principal medium for Vira Saivism. It is spoken by 20 million people, mostly in Karnataka.   ","word":"Kannada","see_also":["Kailasa Parampara","sannyasin","Shrauta Shastras","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"(Hindi.) \"Split-eared,\" from the custom of splitting the cartilage of the ear to insert large earrings. The name of the ascetic order of men and women founded by Gorakshanatha (ca 950), proponents of kundalini-hatha yoga still today.  ","word":"Kanphati","see_also":["earrings","Gorakshanatha","Siddha Siddhanta","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"German philosopher (1724-1804) whose classic works include Critique of Pure Reason (1781) and Critique of Practical Reason (1788).  ","word":"Kant, Immanuel","see_also":["earrings","Gorakshanatha","Siddha Siddhanta","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"An ascetic sect which developed out of the Pashupatas around 500 CE and largely vanished around 1400. They earned a reputation for extreme practices. Possible predecessors of Gorakshanatha Siddha Siddhanta yogis.  ","word":"Kapalika","see_also":["Pashupata Saivism","Gorakshanatha","Siddha Siddhanta","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"\"Biological water.\" One of the three bodily humors, called dosha, kapha is known as the water humor. Principle of cohesion. Kapha gives bodily structure and stability, lubricates, heals and bestows immunity.  ","word":"kapha","see_also":["ayurveda","dosha","Siddha Siddhanta","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"Founder (ca 500 BCE) of the Sankhya philosophy, one of the six darshanas of Hinduism.  ","word":"Kapila","see_also":["shad darshana","dosha","Siddha Siddhanta","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"\"On which monkeys dwell.\" The wood apple tree, Limonia acidissima, native to the dry plains of India and Ceylon and cultivated along roads and edges of fields and occasionally in orchards. The kapittha fruit, also known as elephant apple, monkey fruit and kath bel, is tough shelled, astringent and renowned for its ayurvedic potencies. ","word":"kapittha","see_also":["shad darshana","dosha","Siddha Siddhanta","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"\"Respected lady from Karaikkal.\" The 23rd of the 63 canonized saints of Tamil Saivism. Great mystic, poet and yogini, she composed important hymns, which are part of Tirumurai.  ","word":"Karaikkal Ammaiyar","see_also":["shad darshana","dosha","Siddha Siddhanta","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"The 23rd of the 63 canonized saints of Tamil Saivism. A great mystic, poet and yogini, she composed mystical-devotional hymns which are part of Tirumurai.  ","word":"Karaikkalammaiyar","see_also":["shad darshana","dosha","Siddha Siddhanta","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"One of the 28 Saiva Siddhanta Agamas widely available today. Its kriya pada forms the basis for temple rituals performed in nearly all South Indian Siva temples.  ","word":"Karana Agama","see_also":["Saiva Agamas","dosha","Siddha Siddhanta","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"\"Causal mind.\" The intuitive-superconscious mind of the soul. It corresponds to the anandamaya kosha, bliss sheath, also called karana sharira, causal body.  ","word":"karana chitta","see_also":["kosha","mind (five states)","soul","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"A central Vira Saiva scripture authored by Chennabasavanna.  ","word":"Karana Hasuge","see_also":["Chennabasavanna","mind (five states)","soul","Shulba Shastras","Vedangas","Tirumular","Yogaswami"],"production_notes":null},{"definition":"\"Causal body,\" the actinic body or soul body.  ","word":"karana sharira","see_also":["actinic","actinodic","kosha","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"The causal plane,\"also called Sivaloka, existing deep within the Antarloka at a higher level of vibration, it is a world of superconsciousness and extremely refined energy.  ","word":"karanaloka","see_also":["See loka","actinodic","kosha","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Basket-shaped crown.\"A headdress or crown shaped like a conical basket with the narrow end upwards, often topped with a series of smaller flattened spheres, worn by the Deities. ","word":"karanda mukuta","see_also":["See loka","actinodic","kosha","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":null,"word":"Karavana Mahatmya","see_also":["Pashupata Saivism","actinodic","kosha","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Action,\" \"deed.\" One of the most important principles in Hindu thought, karma refers to 1) any act or deed; 2) the principle of cause and effect; 3) a consequence or \"fruit of action\" (karmaphala) or \"after effect\" (uttaraphala), which sooner or later returns upon the doer. What we sow, we shall reap in this or future lives. Selfish, hateful acts (papakarma or kukarma) will bring suffering. Benevolent actions (punyakarma or sukarma) will bring loving reactions. Karma is a neutral, self-perpetuating law of the inner cosmos, much as gravity is an impersonal law of the outer cosmos. In fact, it has been said that gravity is a small, external expression of the greater law of karma. The impelling, unseen power of one's past actions is called adrishta.  The law of karma acts impersonally, yet we may meaningfully interpret its results as either positive (punya) or negative (papa) -- terms describing actions leading the soul either toward or away from the spiritual goal. Karma is further graded as: white (shukla), black (krishna), mixed (shukla-krishna) or neither white nor black (ashukla-akrishna). The latter term describes the karma of the jnani, who, as Rishi Patanjali says, is established in kaivalya, freedom from prakriti through realization of the Self. Similarly, one's karma must be in a condition of ashukla-akrishna, quiescent balance, in order for liberation to be attained. This equivalence of karma is called karmasamya, and is a factor that brings malaparipakam, or maturity of anava mala. It is this state of resolution in preparation for samadhi at death that all Hindus seek through making amends and settling differences.   Karma is threefold: sanchita, prarabdha and kriyamana. -- sanchita karma: ","word":"karma","see_also":["moksha","soul","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Path of action-reaction.\" A coined term describing the worldly condition of souls totally enmeshed in the actions and reactions of the past, making new karmas so swiftly that little true personal identity is experienced.  ","word":"karma marga","see_also":["anava marga","pada","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Union through action.\" The path of selfless service.  ","word":"karma yoga","see_also":["yoga","pada","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Balance or equipoise of karma.\"  ","word":"karmasamya","see_also":["karma","pada","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Holder of karma.\" Describes the body of the soul, or anandamaya kosha.  ","word":"karmashaya","see_also":["karma","kosha","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Agent of action.\"  ","word":"karmendriya","see_also":["indriya","kosha","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"Relating to or caused by karma.  ","word":"karmic","see_also":["indriya","kosha","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"Southwest state of modern India, where Vijayanagara flourished. Vira Saivism is centered here. Population 25 million, area 74,043 square miles.  ","word":"Karnataka (Karnataka)","see_also":["indriya","kosha","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Ear-piercing.\"  ","word":"karnavedha","see_also":["samskaras of childhood","kosha","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Camphor.\" The white resinous exudation of the camphor tree burned in arati lamps during puja.  ","word":"karpura","see_also":["arati","kosha","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"Child of the Pleiades, from Krittika, \"Pleiades.\" A son of Siva, the brother of Ganesha. A great Mahadeva worshiped in all parts of India and the world. Also known as Murugan, Kumara, Skanda, Shanmukhanatha, Subramanya and more, He is the God who guides that part of evolution which is religion, the transformation of the instinctive into a divine wisdom through the practice of yoga. He holds the holy vel of jnana shakti,which is His Power to vanquish darkness or ignorance.   ","word":"Karttikeya","see_also":["arati","kosha","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"A subdivision (Rudrayamala Tantra) of the Shakta Tantras dedicated to God Karttikeya.  ","word":"Karttikeya Stotram","see_also":["Karttikeya","kosha","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Compassionate; loving, full of grace.\"   ","word":"karuna","see_also":["Karttikeya","kosha","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"One of the 28 Agamas of Saiva Siddhanta.  ","word":"Karuna Agama","see_also":["Saiva Agamas","kosha","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"Hymn by the Tamil saint, Tayumanavar (1705 -- 1742), in praise of Lord Siva.  ","word":"Karunakara Kadavul","see_also":["Tayumanavar","kosha","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Compassion, kindness, love.\" In Saivism, an alternate term for Siva's revealing grace, anugraha shakti.  ","word":"karunya","see_also":["anugraha shakti","grace","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Brownish-red.\" The color of sannyasins' robes.  ","word":"kashaya","see_also":["kavi","grace","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":null,"word":"Kashi","see_also":["Varanasi","grace","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"The northernmost area of India, part of the present-day state of Jammu and Kashmir. It figures prominently in the history of Saivism. Area 115,000 square miles, under dispute between India and Pakistan. Population is six million in the Indian sector.   ","word":"Kashmir (Kashmira)","see_also":["Varanasi","grace","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"In this mildly theistic and intensely monistic school founded by Vasugupta around 850, Siva is immanent and transcendent. Purification and yoga are strongly emphasized. Kashmir Saivism provides an extremely rich and detailed understanding of the human psyche, and a clear and distinct path of kundalini-siddha yoga to the goal of Self Realization. The Kashmir Saivite is not so much concerned with worshiping a personal God as he is with attaining the transcendental state of Siva consciousness. Sadhana leads to the assimilation of the object (world) in the subject (I) until the Self (Siva) stands revealed as one with the universe. The goal -- liberation -- is sustained recognition (pratyabhijna) of one's true Self as nothing but Siva. There are three upaya, or stages of attainment of God consciousness: anavopaya (yoga), shaktopaya (spiritual discrimination), shambhavopaya (attainment through the guru's instruction) and anupaya, or \"no means\" (spontaneous realization without effort). Kashmir Saivite literature is in three broad divisions: Agama Shastras, Spanda Shastras and Pratyabhijna Shastras. Today various organizations promulgate the esoteric teachings. While the number of Kashmir Saivite formal followers is uncertain, the school remains an important influence in India.  ","word":"Kashmir Saivism","see_also":["Saivism","upaya","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Story; discussion.\" Also, the literary form involving the telling of stories. Kathakas are bards, storytellers.  ","word":"katha","see_also":["folk-narratives","mythology","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"One of the major Upanishads, belonging to the Taittiriya Brahmanaof the Yajur Veda. This scripture contains the famous story of Nachiketas who extracts from Yama, Lord of Death, the knowledge of liberation to be had through realization of the Supreme.   ","word":"Katha Upanishad","see_also":["folk-narratives","mythology","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"A secondary scripture regarding the famous central Sri Lankan abode of Lord Murugan (Karttikeya).  ","word":"Kathirgama Purana","see_also":["folk-narratives","mythology","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"Northernmost and oldest of the Hawaiian islands, 553 square miles, population 50,000.  ","word":"Kauai","see_also":["folk-narratives","mythology","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"Monastery-temple complex founded by Sivaya Subramuniyaswami in 1970; international headquarters of Saiva Siddhanta Church.  ","word":"Kauai Aadheenam","see_also":["folk-narratives","mythology","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Of or related to kula,\" a tantric teaching. Kaula also names the liberated soul in Shakta traditions, one to whom wood and gold, life and death are the same.  ","word":"kaula","see_also":["folk-narratives","mythology","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"Author of a commentary on the Pashupata Sutras (ca 500).  ","word":"Kaundinya","see_also":["Pashupata Saivism","Pashupata Sutras","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"One of four known disciples of Lakulisa.  ","word":"Kaurusha","see_also":["Lakulisa","Pashupata Saivism","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"A major Upanishad belonging to the Rig Veda.It discusses: 1) the course of souls after death, 2) the doctrine of prana as related to atman, 3) attainment of moksha.  ","word":"Kaushitaki Upanishad","see_also":["Lakulisa","Pashupata Saivism","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":null,"word":"Kautiliya","see_also":["Arthaveda","Pashupata Saivism","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Armor; covering.\" A decorative mask-like casing, usually made of silver or gold, that adorns the face, hands or entire Deity image. ","word":"kavacha","see_also":["Arthaveda","Pashupata Saivism","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"A penance offered to Lord Murugan-Karttikeya, especially during Tai Pusam, consisting of carrying in procession a heavy, beautifully decorated, wooden object from which pots of milk hang which are to be used for His abhisheka. The participant's tongue and other parts of the body are often pierced with small silver spears or hooks. ","word":"kavadi","see_also":["penance","Pashupata Saivism","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Ocher-saffron color.\" A Tamil term referring to the color taken on by the robes of sadhus who sit, meditate or live on the banks of the Ganges. Names the color of the sannyasin's robes. The Sanskrit equivalent is kashaya.   ","word":"kavi","see_also":["penance","Pashupata Saivism","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"In Siddha Siddhanta, as well as Saiva Siddhanta and other yoga traditions, the process by which a yogi transforms his body from physical to spiritual substance to attain deathlessness.  ","word":"kaya siddhi","see_also":["siddhi","Pashupata Saivism","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"Birthplace of Lakulisa, most prominent guru of Pashupata Saivism, in India's present-day state of Baroda.  ","word":"Kayavarohana","see_also":["Lakulisa","Pashupata Saivism","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"A temple in Karnataka which belonged to the Kalamukha sect of Saivism. Inscriptions upon it (1162) are a main source of knowledge about this now nearly extinct sect.  ","word":"Kedaresvara Temple","see_also":["Kalamukha","Pashupata Saivism","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"Belongs to the Talavakara Brahmana of the Sama Veda. It is a discourse upon Brahman, Absolute Reality and His worship as personal God.  ","word":"Kena Upanishad","see_also":["Upanishad","Pashupata Saivism","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"The small Indian state, formerly called Konkan, along the southwestern tip of India. Area 15,000 square miles, population 25 million.  ","word":"Kerala","see_also":["Upanishad","Pashupata Saivism","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Beard-shaving.\"  ","word":"keshanta","see_also":["samskaras of adulthood","Pashupata Saivism","Accumulated actions","odic","soul","subtle body","Yogaswami"],"production_notes":null},{"definition":"\"Stage of oneness, aloneness.\" (Tamil: avasthai.) In Saiva Siddhanta, the first of three stages of the soul's evolution, a state beginning with its emanation or spawning by Lord Siva as an etheric form unaware of itself, a spark of the Divine shrouded in a cloud of darkness known as anava. Here the soul is likened to a seed hidden in the ground, yet to germinate and unfold its potential.  ","word":"kevala avastha","see_also":["anava","avastha","evolution of the soul","sakala avastha","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Sword.\" A powerful symbol in Hindu iconography, depicting the power of the Gods to aid devotees in overcoming human weaknesses. ","word":"khadga","see_also":["anava","avastha","evolution of the soul","sakala avastha","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Hand made saffron color.\" Hand-spun, hand woven cloth, ocher in color, worn by Hindu renunciates. A Tamil term referring to the color taken on by robes of sadhus who sit, meditate or live on the banks of the Ganges. The Sanskrit equivalent is kashaya.  ","word":"khadi kavi","see_also":["anava","avastha","evolution of the soul","sakala avastha","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Shield.\" As a religious emblem, it represents protection, divine security and the upholding of dharma. ","word":"khetaka","see_also":["anava","avastha","evolution of the soul","sakala avastha","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"Family, relatives, kin.  ","word":"kindred","see_also":["extended family","joint family","evolution of the soul","sakala avastha","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Praising.\" Devotional singing and dancing in celebration of God, Gods or guru. An important form of congregational worship in many Hindu denominations.  ","word":"kirtana","see_also":["bhajana","joint family","evolution of the soul","sakala avastha","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"Ability to do something easily; a particular skill, dexterity.  ","word":"knack","see_also":["bhajana","joint family","evolution of the soul","sakala avastha","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"One who knows. In philosophy, that within conscious beings which understands or is conscious.  ","word":"knower","see_also":["awareness","chit","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"Traditional household and priestly art of \"drawing\" intricate decorative patterns at the entrance to a home or temple or at the site of a religious ceremony. Known as rangoli in Sanskrit. Kolam designs are made with rice powder mixed to a watery paste, and sometimes with flowers and various-colored powdered pulses. ","word":"kolam","see_also":["awareness","chit","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"The Golden Shower tree, Cassia fistula; symbol of Siva's cascading, abundant, golden grace. Konrai flowers are sacred to Siva.  ","word":"konrai","see_also":["awareness","chit","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"The Islamic religion's sacred book, God's word transmitted through the angel Gabriel to Mohammed, the prophet of Islam. Its official version appeared around 650, 18 years after Mohammed's death.  ","word":"Koran","see_also":["awareness","chit","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Sheath; vessel, container; layer.\" Philosophically, five sheaths through which the soul functions simultaneously in the various planes or levels of existence. -- annamaya kosha: \"Sheath composed of food;\" the physical or odic body. -- pranamayakosha: \"Sheath composed of prana (vital force);\" also known as the pranic or health body, or the etheric body or etheric double. -- manomaya kosha: \"Mind-formed sheath;\" the lower astral body (from manas, \"thought, will, wish\"); the instinctive-intellectual sheath of ordinary thought, desire and emotion. -- vijnanamaya kosha: \"Sheath of cognition;\" the mental or cognitive-intuitive sheath, also called the actinodic sheath. -- anandamaya kosha:\"Body of bliss;\" the intuitive-superconscious sheath or actinic-causal body. Anandamaya kosha is not a sheath in the same sense as the four outer koshas. It is the soul itself, a body of light, also called karana sharira, causal body, and karmashaya, holder of karmas of this and all past lives. Anandamaya kosha is that which evolves through all incarnations and beyond until the soul's ultimate, fulfilled merger, vishvagrasa, in the Primal Soul, Parameshvara. Then anandamaya kosha becomes Sivamayakosha, the body of God Siva. ","word":"kosha","see_also":["awareness","chit","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"An enclosure for livestock (Afrikaans); the herd itself. ","word":"kraal","see_also":["awareness","chit","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Black.\" Also related to krishtih, meaning \"drawing, attracting.\" One of the most popular Gods of the Hindu pantheon. He is worshiped by Vaishnavas as the eighth avatara, incarnation, of Vishnu. He is best known as the Supreme Personage depicted in the Mahabharata, and specifically in the Bhagavad Gita. For Gaudiya Vaishnavism, Krishna is the Godhead.   ","word":"Krishna","see_also":["awareness","chit","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Black gifts.\" Bad money, funds derived through adharmic activities, which should not be received as donations by institutions, temples or ashramas. Bad money can never do good. It has a curse upon it. ","word":"krishnadana","see_also":["yama-niyama","chit","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"A joyous one-day festival on the Krittika nakshatra (Pleiades constellation), in November-December, when God Siva is worshiped as an infinite pillar of light. Great bonfires are lit at night on hills and in villages in India and elsewhere to represent the divine, all-permeating light of Parashakti.  ","word":"Krittika Dipa","see_also":["festival","chit","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"A joyous one-day festival on the Krittika nakshatra (Pleiades constellation), in November-December, when God Siva is worshiped as an infinite pillar of light. Great bonfires are lit at night on hills and in villages in India and elsewhere to represent the divine, all-permeating light of Parashakti.  ","word":"Krittika Dipam","see_also":["festival","chit","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Action.\" 1) In a general sense, kriya can refer to doing of any kind. Specifically, it names religious action, especially rites or ceremonies. 2) In yoga terminology, kriya names involuntary physical movements occuring during meditation that are pretended or caused by lack of emotional self-control or by the premature or unharnessed arousal of the kundalini. 3) Various traditional hatha yoga techniques for cleansing the mucous membranes. 4) The second stage of the Saiva path, religious action, or kriya pada.  ","word":"kriya","see_also":["pada","chit","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":null,"word":"kriya marga","see_also":["See kriya pada","chit","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Stage of religious action; worship.\" The stage of worship and devotion, second of four progressive stages of maturation on the Saiva Siddhanta path of attainment.  ","word":"kriya pada","see_also":["pada","chit","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Action power.\" The universal force of doing.  ","word":"kriya shakti","see_also":["Shakti","trishula","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Action union.\" A term for various schools of meditative yoga practice emphasizing pranayama, breathing techniques, to accelerate spiritual progress, aggressively breaking awareness free of day-to-day consciousness and arousing the kundalini with the goal of expanded consciousness and self transformation. Paramahansa Yogananda (1893-1952), who taught kriya yoga, called it the \"airplane route\" to God. The modern revival of this ancient meditation system is said to have begun with the deathless avatara Babaji in 1861.  ","word":"kriya yoga","see_also":["Shakti","trishula","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"A manual by Aghorasiva (ca 1050) detailing Agamic Saiva ritual. It is used widely by South Indian priests to this day.  ","word":"Kriyakramadyotika","see_also":["Shakti","trishula","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Actions being made.\"  ","word":"kriyamana karma","see_also":["karma","trishula","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Anger.\" The emotion of the second chakra below the muladhara, called vitala. Scripture describes it as one of the gates to hell. ","word":"krodha","see_also":["karma","trishula","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Patience, Forebearance.\" Kshama is the restraint of intolerance with people and impatience with circumstances. It is among the ten yamas.  ","word":"kshama","see_also":["yama-niyama","trishula","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Governing; sovereign.\" The social class of lawmakers, law-enforcers and the military.  ","word":"kshatriya","see_also":["varna dharma","trishula","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Place,\" \"field.\"A property or region; often naming a sacred place. ","word":"kshetra","see_also":["varna dharma","trishula","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"A name and traditional murti, or form, of Ganesha. \"He who is immediate\" (or quick). He holds a kalpavriksha sprig and a pot of gems. ","word":"Kshipra Ganapati","see_also":["varna dharma","trishula","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"The quick rewarder\" presides from a kusha-grass throne holding pomegranate,noose, goad and more. ","word":"Kshipra Prasada Ganapati","see_also":["varna dharma","trishula","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"The Hawaiian Deity worshiped for prosperity, good fishing, abundant crops, good will, noble offspring, righteous leaders and victory in battle. In the Hindu pantheon, Ku is known as Kumara, Skanda or Karttikeya .  ","word":"Ku","see_also":["varna dharma","trishula","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"A name of Siva meaning \"Lord of rivers' confluence.\"   ","word":"Kudalasangama","see_also":["varna dharma","trishula","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Unwholesome acts,\" or the fruit therefrom. ","word":"kukarma","see_also":["karma","trishula","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Family; home; group of families.\"  ","word":"kula","see_also":["extended family","joint family","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"The spiritual preceptor of the family or extended family.   ","word":"kula guru","see_also":["extended family","joint family","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"The divine way of life;\" the state of jivanmukti, \"liberation while living\" in Shaktism. It is attained through sadhana and grace.  ","word":"kulachara","see_also":["extended family","joint family","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Family preceptor\" or \"family teacher.\" The kulaguru guides the joint and extended family, particularly through the heads of families, and provides spiritual education. He may or may not be a satguru.  ","word":"kulaguru","see_also":["extended family","joint family","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"A married man who is the head of his joint family and its extended family. His wife is a kulamata. A husband and wife who are part of a kulapati's extended family are known as mukhya and grihini respectively.  ","word":"kulapati","see_also":["extended family","joint family","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"A leading scripture of the Kaula school of Shaktism. It comprises 17 chapters totaling 2,058 verses which focus on ways to liberation, with notable chapters on the guru-shishya relationship.  ","word":"Kularnava Tantra","see_also":["extended family","joint family","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Virgin youth; ever-youthful.\" A name of Lord Karttikeya as an eternal bachelor.  ","word":"Kumara","see_also":["Karttikeya","joint family","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Ever youthful.\" A young virgin girl, particularly age 10-12. ","word":"kumari","see_also":["Karttikeya","joint family","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Water vessel,\" Another name for kalasha, a pot of water on which a husked coconut is nested on five mango leaves to represent the Deity; integral to certain sacred Hindu rites. ","word":"kumbha","see_also":["Karttikeya","joint family","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Water pot ablution.\" The formal consecration of a new temple and its periodic reconsecration, usually at twelve-year intervals, following renovation, extensive cleaning and renewal. The rites culminate with the priests' pouring sanctified water over the temple spires, which resemble an inverted pot, or kumbha. Leading up to the consecration, during the construction of a temple, the following rituals are performed by the sthapati (architect) assisted by the temple priest: 1) pancha silanyasa: setting five stones in the foundation at the northeast corner of the main sanctum; 2) prathama silanyasa: laying of first stone on foundation bed; 3) nilayasthapanam: placement of the door frame; 4) garbhanyasam: encasement of a cubical silver or gold box of gems, silver, gold and herbs; 5) sthupi sthapanam: placement of the tower capstone; 6) nethron meelanam: awakening the Deity by completing the chiseling of the eyes with a gold chisel dipped in milk and honey; 7) mulalinga sthapanam: installing the Deity.  ","word":"kumbhabhisheka","see_also":["Karttikeya","joint family","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"A large and popular temple to Lord Ganesha located in Alaveddy, Northern Sri Lanka, near Gurudeva's Sri Subramuniya Ashram.  ","word":"Kumbhalavalai","see_also":["Karttikeya","joint family","jnana","sakshin","soul","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"She who is coiled; serpent power.\" The primordial cosmic energy in every individual which, at first, lies coiled like a serpent at the base of the spine and eventually, through the practice of yoga, rises up the sushumna nadi. As it rises, the kundalini awakens each successive chakra. Nirvikalpa samadhi, enlightenment, comes as it pierces through the door of Brahman at the core of the sahasrara and enters it. Kundalini shakti then returns to rest in any one of the seven chakras. Sivasayujya, perpetual Siva consciousness, is complete when the kundalini arrives back in the sahasrara and remains coiled in this crown chakra. ","word":"kundalini","see_also":["chakra","door of Brahman","samadhi","nadi","tantra","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"The pure (neither masculine nor feminine) force that flows through the sushumna nadi.  ","word":"kundalini shakti","see_also":["kundalini","shakti","sushumna nadi","nadi","tantra","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Uniting the serpent power.\" Advanced meditative practices and sadhana techniques, a part of raja yoga, performed to deliberately arouse the kundalini power and guide it up the spine into the crown chakra, sahasrara. In its highest form, this yoga is the natural result of sadhanas and tapas well performed, rather than a distinct system of striving and teaching in its own right.    ","word":"kundalini yoga","see_also":["kundalini","shakti","sushumna nadi","nadi","tantra","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Saffron; red.\" (Tamil: kumkum.) The red powder, made of turmeric and lime, worn by Hindus as the pottu or bindu, dot, at the point of the third eye on the forehead. Names the saffron plant, Crocus sativus, and its pollen.  ","word":"kunkuma","see_also":["ajna chakra","shakti","sushumna nadi","nadi","tantra","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":null,"word":"Kural","see_also":["Tirukural","shakti","sushumna nadi","nadi","tantra","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"The Tortoise Saga.\" One of the six Siva Puranas, it glorifies the worship of Siva and Durga.   ","word":"Kurma Purana","see_also":["Tirukural","shakti","sushumna nadi","nadi","tantra","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"Traditional men's shirt of India, usually thigh length and collarless.  ","word":"kurta shirt","see_also":["Tirukural","shakti","sushumna nadi","nadi","tantra","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"An extensive plain near Delhi, scene of the great war between the Kauravas and Pandavas.  ","word":"Kurukshetra","see_also":["Bhagavad Gita","Mahabharata","sushumna nadi","nadi","tantra","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"One of four known disciples of Lakulisa.   ","word":"Kusika (Kushika)","see_also":["Bhagavad Gita","Mahabharata","sushumna nadi","nadi","tantra","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"A standing metal lamp kept in the temple, shrine room or home. It is made of metal, with several wicks fed by ghee or special oils. Used to light the home and used in puja. Part of temple and shrine altars, the standing lamp is sometimes worshiped as the divine light, Parashakti or Parajyoti. Returning from the temple and lighting one's kuttuvilakku courts the accompanying devas to remain in the home and channels the vibration of the temple sanctum sanctorum into the home shrine. Called dipastambha in Sanskrit.   ","word":"kuttuvilakku","see_also":["Bhagavad Gita","Mahabharata","sushumna nadi","nadi","tantra","shuddha avastha","Yogaswami"],"production_notes":null},{"definition":"\"Joint family.\"  ","word":"kutumba","see_also":["extended family","joint family","sushumna nadi","nadi","tantra","shuddha avastha","Yogaswami"],"production_notes":null}],"results":142}