{"entries":[{"definition":"A sweet made with milk, flour and sugar in South India, and with chickpea flour, ghee and sugar in North India. ","word":"laddu","see_also":null,"production_notes":null},{"definition":null,"word":"Lahiri Ayanamsha","see_also":["ayanamsha"],"production_notes":null},{"definition":"\"Mark or sign,\" often of success or prosperity. Shakti, the Universal Mother, as Goddess of wealth. The mythological consort of Vishnu. Usually depicted on a lotus flower. Prayers are offered to Lakshmi for wealth, beauty and peace. ","word":"Lakshmi","see_also":["Bestower of wealth"],"production_notes":null},{"definition":"A name and traditional murti, or form, of Ganesha. \"Lord of abundance.\" Flanked by Wisdom and Achievement (Buddhi and Siddhi) and holds a green parrot, shukhi. ","word":"Lakshmi Ganapati","see_also":["Bestower of wealth"],"production_notes":null},{"definition":"The most prominent guru (ca 200) of the ancient Pashupata school of Saivism. The Pashupata Sutras are attributed to him.  ","word":"Lakulisa (Lakulisha)","see_also":["Saivism"],"production_notes":null},{"definition":"(Lalasa  in Sanskrit.) A Kashmir Saivite saint (ca 1300) whose intensely mystical poems, Lalla Vakyani, describe her inner experiences of oneness with Siva.  ","word":"Lalla","see_also":["Kashmir Saivism"],"production_notes":null},{"definition":"\"Large belly.\" A name of Lord Ganesha cited in the Mudgala Purana as the conqueror of krodha, anger. ","word":"Lambodara","see_also":["Kashmir Saivism"],"production_notes":null},{"definition":"To express grief for or mourn.  ","word":"lament","see_also":["Kashmir Saivism"],"production_notes":null},{"definition":"A spear.  ","word":"lance","see_also":["Karttikeya","vel"],"production_notes":null},{"definition":"Chinese philosopher (6th century BCE), author of Tao-te Ching, traditionally regarded as the founder of Taoism. ","word":"Lao Tzu","see_also":["Taoism","vel"],"production_notes":null},{"definition":"To fall (or slip) down, away or back. To cease or become forfeit or void by default.  ","word":"lapse","see_also":["Taoism","vel"],"production_notes":null},{"definition":"Stealing personal property; theft.  ","word":"larceny","see_also":["Taoism","vel"],"production_notes":null},{"definition":"Pantry; room where food supplies are kept.  ","word":"larder","see_also":["Taoism","vel"],"production_notes":null},{"definition":"Present but hidden or potential; not evident or active.  ","word":"latent","see_also":["Taoism","vel"],"production_notes":null},{"definition":"To praise. To sing, chant or speak the qualities or glories of.  ","word":"laud","see_also":["Taoism","vel"],"production_notes":null},{"definition":"Very abundant in giving or spending.  ","word":"lavish","see_also":["Taoism","vel"],"production_notes":null},{"definition":"A man who is not a cleric or monastic.  ","word":"layman","see_also":["Taoism","vel"],"production_notes":null},{"definition":"A book in which monetary transactions are posted in the form of debits and credits.  ","word":"ledger","see_also":["Taoism","vel"],"production_notes":null},{"definition":"Vama marga. A term describing certain tantric practices where the instincts and intellect are transcended, and detachment is sought through practices and behavior which are contrary to orthodox social norms.  ","word":"left-handed","see_also":["tantra","tantrika","tantrism"],"production_notes":null},{"definition":"A story of uncertain historical basis, transmitted from generation to generation.  ","word":"legend","see_also":["folk narratives","katha","mythology"],"production_notes":null},{"definition":"To make or pass laws.  ","word":"legislate","see_also":["folk narratives","katha","mythology"],"production_notes":null},{"definition":"According to the rules or the law. Authentic; reasonable.  ","word":"legitimate","see_also":["folk narratives","katha","mythology"],"production_notes":null},{"definition":"\"Written-prayer-burning rite.\" A term coined for the ancient practice of sending written prayers to the Gods by burning them in a sanctified fire in a temple or shrine. Alternately this rite can be performed at other appropriate sites, with four persons sitting around a fire and chanting to create a temporary temple. Prayers can be written in any language, but should be clearly legible, in black ink on white paper. The devas have provided a special script, called Tyeif, especially for this purpose. Its letters, from A to Z, which replace the letters of the Roman script, looks like this:   ","word":"lekhaprartha havana","see_also":["folk narratives","katha","mythology"],"production_notes":null},{"definition":"A work like none other on the planet, Lemurian Scrolls came to Gurudeva in a series of clairvoyant revelations during 1973-1974 in answer to his need, inwardly expressed, for the ancient ideal pattern on which to begin molding his several Saivite monasteries in the Western world. Thus, as a boon from the Gods, Gurudeva began developing the siddhi, or psychic ability, to perceive and read from a series of ancient manuscripts with his inner eye. These were presented to him by a librarian on the astral plane, and as Gurudeva read from them, he dictated them word by word to a scribe who recorded them on paper. The manuscripts, written some two million years ago, unfolded the nature of life in Saivite monasteries in the Treta and Dvapara Yugas. This text, along with subsequent writings, gave Gurudeva the pattern of culture and administration that he sought for his own monasteries. In addition, they disclosed much new knowledge about how man came to this planet, journeying millions of years ago from the Pleiades and other planets to further the soul's unfoldment. Lemurian Scrolls was for 25 years entrusted only to the resident monastics of Gurudeva's monasteries, until 1998 when they were released to the world. These angelic prophecies, exquisitely illustrated, overwhelm the reader with a sense of his divine origin, purpose and destiny and have the power to motivate a profound rededication to anyone's spiritual quest.  ","word":"Lemurian Scrolls","see_also":["folk narratives","katha","mythology"],"production_notes":null},{"definition":"For fear that a thing might happen.   ","word":"lest","see_also":["folk narratives","katha","mythology"],"production_notes":null},{"definition":"A state of sluggishness, inactivity and apathy.  ","word":"lethargy","see_also":["folk narratives","katha","mythology"],"production_notes":null},{"definition":"The power or ability to float in the air or to cause objects to do so at will.  ","word":"levitation","see_also":["folk narratives","katha","mythology"],"production_notes":null},{"definition":"Free; broad-minded; tolerant; unconfined; generous.  ","word":"liberal","see_also":["folk narratives","katha","mythology"],"production_notes":null},{"definition":"A synonym for Smartism and the closely related neo-Indian religion. The latter form carries forward basic Hindu cultural values -- such as dress, diet and the arts -- while allowing religious values to subside. Neo-Indian religion encourages Hindus to follow any combination of theological, scriptural, sadhana and worship patterns, regardless of sectarian or religious origin.  ","word":"liberal Hinduism","see_also":["Smartism","katha","mythology"],"production_notes":null},{"definition":"Moksha, release from the bonds of pasha, after which the soul is liberated from samsara (the round of births and deaths). In Saiva Siddhanta, pasha is the threefold bondage of anava, karma and maya, which limit and confine the soul to the reincarnational cycle so that it may evolve. Moksha is freedom from the fettering power of these bonds, which do not cease to exist, but no longer have the power to fetter or bind the soul.  ","word":"liberation","see_also":["jivanmukti","mala","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"Morally unrestrained, especially in sexual behavior.  ","word":"licentious","see_also":["jivanmukti","mala","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"In an ordinary sense, a form of energy which makes physical objects visible to the eye. In a religious-mystical sense, light also illumines inner objects (i.e., mental images).  -- inner light: light perceived inside the head and body, of which there are varying intensities. When the karmas have been sufficiently quieted, the meditator can see and enjoy inner light independently of mental images.  -- moon-like inner light: Inner light perceived at a first level of intensity, glowing softly, much like the moon. The meditator's first experience of it is an important milestone in unfoldment.  -- clear white light: Inner light at a high level of intensity, very clear and pure. When experienced fully, it is seen to be permeating all of existence, the universal substance of all form, inner and outer, pure consciousness, Satchidananda. This experience, repeated at regular intervals, can yield \"a knowing greater than you could acquire at any university or institute of higher learning.\"  ","word":"light","see_also":["Siva consciousness","tattva","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"\"Play.\" Ease or facility in doing. A term used to describe God's Divine cosmic drama of creation, preservation, dissolution, concealment and revelation. ","word":"lila","see_also":["Siva consciousness","tattva","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"Bending or flexing readily; pliable.  ","word":"limber","see_also":["Siva consciousness","tattva","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"A central, key element; a locking pin inserted in a hole at the end of an axle or other shaft to prevent a wheel from slipping off.  ","word":"linchpin","see_also":["Siva consciousness","tattva","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"A direct line of ancestors and descendants or predecessors and successors.  ","word":"lineage","see_also":["Siva consciousness","tattva","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"\"Mark.\"  ","word":"Linga","see_also":["Sivalinga","svayambhu Linga","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"The Vira Saiva initiation ceremony in which the guru ties a small Sivalinga (Ishtalinga) around the neck of the devotee and enjoins him to worship it twice daily. This initiation replaces the sacred thread ceremony, upanayana.  ","word":"Linga Diksha","see_also":["Vira Saivism","svayambhu Linga","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"One of the six principal Siva Puranas. This text explains the purusharthas (the four goals of life) and the significance of Sivalinga worship.  ","word":"Linga Purana","see_also":["Purana","svayambhu Linga","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"Daily worship of the Sivalinga. One of the five essential codes of conduct for Vira Saivites.  ","word":"Lingachara","see_also":["Panchachara","Vira Saivism","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"A short hymn of eight verses in praise of the Sivalinga.  ","word":"Lingashtakam","see_also":["Panchachara","Vira Saivism","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"\"Wearer of the Linga.\" (Hindi: Lingayat.) Alternate term for Vira Saivite.  ","word":"Lingavanta","see_also":["Vira Saivism","Vira Saivism","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"To be slow in leaving, especially out of reluctance; tarry. To persist.  ","word":"linger","see_also":["Vira Saivism","Vira Saivism","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"The proper, prescribed forms of ritual.  ","word":"liturgy","see_also":["Vira Saivism","Vira Saivism","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"\"Greed.\" One of the principal obstacles on the path, counteracted by dana (selfless giving) and aparigraha, greedlessness.  ","word":"lobha","see_also":["See Gajanana","Vira Saivism","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"\"World, habitat, realm, or plane of existence.\" From loc, \"to shine, be bright, visible.\" A place of a particular level of vibration and associated beings, Gods, devas or men. A dimension of manifest existence; cosmic region. Each loka reflects or involves a particular range of consciousness. Three primary lokas and fourteen sub-classifications of the cosmos are designated in Hindu scripture. The three primary lokas are 1) -- Bhuloka: \"Earth world.\" The world perceived through the five senses, also called the gross plane, as it is the most dense of the worlds. Sometimes referred to as the First World. 2) -- Antarloka: \"Inner\" or \"in-between world.\" Known in English as the subtle or astral plane, the intermediate dimension between the physical and causal worlds, where souls in their astral bodies sojourn between incarnations and when they sleep. Also referred to as the Second World. 3) --Sivaloka: \"World of Siva,\" and of the Gods and highly evolved souls. The causal plane, also called Karanaloka, existing deep within the Antarloka at a higher level of vibration. It is a world of superconsciousness and extremely refined energy, the plane of creativity and intuition, the quantum level of the universe where souls exist in self-effulgent bodies made of actinic particles of light. It is here that God and Gods move and lovingly guide the evolution of all the worlds and shed their ever-flowing grace. Its vibratory rate is that of the vishuddha, ajna and sahasrara chakras and those above. Also referred to as the Third World.  ","word":"loka","see_also":["See three worlds","Vira Saivism","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"The Hawaiian God of weather, worshiped to bring the rains and dispense fertility. One of four primary Gods, along with Ku, Kane and Kanaloa. Lono, also the God of harvest, is known as Ganesha in the Hindu tradition.  ","word":"Lono","see_also":["See three worlds","Vira Saivism","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"Accumulated facts, traditions, or beliefs about a particular subject.  ","word":"lore","see_also":["See three worlds","Vira Saivism","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"The most famous of hatha yoga poses and the optimum position for meditation. It is known as the padmasana (lotus pose), as the legs are crossed, turning the soles of the feet up, which then resemble a lotus flower.  ","word":"lotus asana","see_also":["asana","hatha yoga","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"An aquatic plant (Nelumbo nucifera) native to southern Asia and Australia, with large leaves, fragrant, pinkish flowers, a broad, rounded, perforated seedpod, and fleshy rhizomes.  ","word":"lotus flower","see_also":["asana","hatha yoga","moksha","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"Padmasana. The most famous of hatha yoga poses and the optimum position for meditation. The legs are crossed, turning the soles of the feet up, which then resemble a lotus flower. ","word":"lotus pose","see_also":["asana","hatha yoga","padmasana","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"Clear to the mind; easily understood; intelligible.  ","word":"lucid","see_also":["asana","hatha yoga","padmasana","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"The practice of remaining conscious in the dream state and directing the course of one's dream.  ","word":"lucid dreaming","see_also":["asana","hatha yoga","padmasana","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"An object, such as a celestial body, that emits light.  ","word":"luminary","see_also":["asana","hatha yoga","padmasana","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"Giving off light, shining.  ","word":"luminous","see_also":["asana","hatha yoga","padmasana","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"A calendar based primarily on the cycles of the moon rather than the sun. For example, a month is from one full moon to the next or from the new moon to the next new moon. There are both lunar and solar based calendars in India, though today the solar is becoming prevalent. ","word":"lunar calendar","see_also":["ayanamsha","panchanga","padmasana","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"To wait unobserved or unsuspected in order to harm or attack.  ","word":"lurk","see_also":["ayanamsha","panchanga","padmasana","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"Intense desire or craving, especially sexual.  ","word":"lust","see_also":["ayanamsha","panchanga","padmasana","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"Ritual cleansing. ","word":"lustration","see_also":["ayanamsha","panchanga","padmasana","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"A stringed instrument of highly pleasant sound.  ","word":"lute","see_also":["ayanamsha","panchanga","padmasana","pasha","reincarnation","satguru","Self Realization","soul"],"production_notes":null},{"definition":"A clear, yellowish fluid of the body containing white blood cells and circulating throughout the lymphatic system. Among its functions, it removes bacteria and certain proteins from tissues, and transports fat from the small intestine. In ayurveda, lymph is part of rasa, the first of the human body's seven dhatus (constituents; tissues), each of which is transformed into the next: 1) rasa (which includes plasma, lymph, serum, cytoplasm and chyle); 2) rakta (red blood cells, blood tissue -- the oxygen-carrying unit); 3) mamsa (muscle tissue); 4) meda (adipose tissue -- subcutaneous fat and sweat); 5) asthi (bone tissue); 6) maija (nerve tissue and bone marrow); and 7) shura (reproductive tissue, semen).  ","word":"lymph","see_also":["ayurveda","ojas","tejas","transmutation","reincarnation","satguru","Self Realization","soul"],"production_notes":null}],"results":61}