{
	"entries": [{
		"definition": "\"Sound; tone, vibration.\" Metaphysically, the mystic sounds of the Eternal, of which the highest is the transcendent, Soundless Sound, Paranada, the first vibration from which creation emanates. Paranada is so pure and subtle that it cannot be identified to the denser regions of the mind. From Paranada comes Pranava, Aum, and further evolutes of nada. These are experienced by the meditator as the nada-nadi shakti, \"energy current of sound,\" heard pulsing through the nerve system as a steady high-pitched hum, much like a tambura, an electrical transformer, a swarm of bees or a shruti box. Listening to the inner sounds is a contemplative practice called nada upasana, \"worship through sound,\" nada anusandhana, \"cultivation of inner sound,\" or nada yoga \"union through sound.\" Subtle variations of the nada-nadi shakti represent the psychic wavelengths of established guru lineages of many Indian religions. Nada also refers to other psychic sounds heard during deep meditation, including those resembling various musical instruments. Nada also refers to ordinary sound.  ",
		"word": "nada",
		"see_also": ["Aum", "nadi", "pranava", "sound"],
		"production_notes": null
	}, {
		"definition": "\"Energy current of sound.\"  ",
		"word": "nada-nadi shakti",
		"see_also": ["nada", "nadi", "pranava", "sound"],
		"production_notes": null
	}, {
		"definition": null,
		"word": "Nadantar ",
		"see_also": ["Kailasa Parampara", "nadi", "pranava", "sound"],
		"production_notes": null
	}, {
		"definition": "\"Conduit; river.\" A nerve fiber or energy channel of the subtle (inner) bodies of man. It is said there are 72,000 nadis. These interconnect the chakras. The three main nadis are ida, pingala and sushumna. Ida and pingala intertwine the spinal column, beginning at the muladhara chakra, ending at the sahasrara and crossing at the manipura and the vishuddha chakras.  -- ida, also known as chandra (moon) nadi, is pink in color. Its flows downward, ending on the left side of the body. This current is feminine in nature and is the channel of physical-emotional energy. -- pingala, also known as surya (sun) nadi, is blue in color. It flows upward, ending on the right side of the body. This current is masculine in nature and is the channel of intellectual-mental energy.  -- sushumna is the major nerve current which passes through the spinal column from the muladhara chakra at the base to the sahasrara at the crown of the head. It is the channel of kundalini. Through yoga, the kundalini energy lying dormant in the muladhara is awakened and made to rise up this channel through each chakra to the sahasrara chakra.  ",
		"word": "nadi",
		"see_also": ["chakra", "kundalini", "raja yoga", "tantrism"],
		"production_notes": null
	}, {
		"definition": "\"Serpent,\" often the cobra; symbol of the kundalini coiled on the four petals of the muladhara chakra.  ",
		"word": "naga",
		"see_also": ["kundalini", "muladhara chakra", "raja yoga", "tantrism"],
		"production_notes": null
	}, {
		"definition": "\"Snake cord,\" worn by Ganesha in His various murtis, both as a waistband and as a sacred thread (yajnopavita), representing mastery of the life forces and transmutation of instinctiveness into spirituality. ",
		"word": "nagapasha",
		"see_also": ["kundalini", "muladhara chakra", "raja yoga", "tantrism"],
		"production_notes": null
	}, {
		"definition": "\"Surpentine tone.\" Often nadaswaram. A double-reed woodwind musical instrument about three feet long, similar to an oboe, but more shrill and piercing. Common in South India, played at Hindu pujas and processions with the tavil, a large drum.   ",
		"word": "nagasvara",
		"see_also": ["kundalini", "muladhara chakra", "raja yoga", "tantrism"],
		"production_notes": null
	}, {
		"definition": "Lacking critical ability or analytical insight; not subtle or learned. Simple and gullible.  ",
		"word": "naive",
		"see_also": ["kundalini", "muladhara chakra", "raja yoga", "tantrism"],
		"production_notes": null
	}, {
		"definition": "Food offered to the Deity at the temple or home altar. An important element in puja.  ",
		"word": "naivedya",
		"see_also": ["prasada", "puja", "raja yoga", "tantrism"],
		"production_notes": null
	}, {
		"definition": "\"Star cluster.\" Central to astrological determinations; One of 27 principle asterisms (star clusters, also called Lunar Mansions) in the Hindu system of astrology. Usually refers to one's birthstar. In this sense, a person's nakshatra is determined by drawing a straight line from the earth through the moon at the exact time of birth and noting the group of stars the line points toward. The nakshatra is an important factor in determining the characteristics of an individual.   ",
		"word": "nakshatra",
		"see_also": ["prasada", "puja", "raja yoga", "tantrism"],
		"production_notes": null
	}, {
		"definition": "\"Four devout beings.\" Four renowned saints of the Saiva religion (7th to 9th century): Appar, Sundarar, Sambandar and Manikkavasagar -- devotional mystics whose lives and teachings helped catalyze a resurgence of Saivism in Tamil Nadu. All but Manikkavasagar are among the Nayanars, 63 saints canonized by Sekkilar in his Periyapuranam (ca1140). These four are also known as the Samayacharyas, \"teachers of the faith.\" Their devotional poems are embodied in the Tirumurai, along with the writings of other Nayanars. Numerous South Indian temples celebrate their historic pilgrimages from shrine to shrine where they beseeched the grace of Siva through heartfelt song. Nalvar is a term not to be confused with Alvar, naming certain Vaishnava saints of the same period.  ",
		"word": "Nalvar",
		"see_also": ["Alvar", "Nayanar", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "\"Name initiation.\" Also known as namakarana samskara.  ",
		"word": "namadiksha",
		"see_also": ["samskaras of childhood", "Nayanar", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "\"Adoration (or homage) to.\" ",
		"word": "namah",
		"see_also": ["samskaras of childhood", "Nayanar", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": " \"Adoration (homage) to Siva.\" The supreme mantra of Saivism, known as the Panchakshara, or \"five syllables.\" Na is the Lord's veiling grace; Ma is the world; Shi is Siva; Va is His revealing grace; Ya is the soul. The syllables also represent the physical body: Na the legs, Ma the stomach, Shi the shoulders, Va the mouth and Ya the eyes. Embodying the essence of Saiva Siddhanta, this mantra is found in the center of the central Veda (the Yajur) of the original three Vedas (Rig, Yajur and Sama). Namastaraya namah shambhave cha mayobhave cha, namah shankaraya cha mayaskaraya cha, namah shivaya cha shivayataraya cha. \"Homage to the source of health and to the source of delight. Homage to the maker of health and to the maker of delight. Homage to the Auspicious, and to the more Auspicious\" (Krishna Yajur Veda, Taittiriya Samhita 4.5.8). When applied to the symbolism of Lord Nataraja, a second and partly differing rendering relates Na-Ma-Shi-Va-Ya to Siva's five actions as follows. Na represents samhara, destruction or dissolution, corresponding to the hand which which holds a blazing flame. Ma stands for His concealing grace, tirodhana shakti, symbolized by Lord Nataraja's planted foot. Va indicates revealing grace, anugraha shakti, by which souls return to Him, reflected in the left front hand in the elephant trunk pose, gajahasta, pointing to His left foot, source of revealing grace. Shi stands for srishti, creation, and Siva's back right hand holding the drum. Ya stands for Siva's power of stithi, preservation and protection, shown in His hand gesturing abhaya, \"fear not.\" Na-Ma-Shi-Va-Ya also stands for the five elements: Na as earth; Ma, water; Shi, fire; Va, air; and Ya, akasha.  ",
		"word": "Namah Sivaya",
		"see_also": ["japa", "mantra", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "\"Name giving.\"  ",
		"word": "namakarana",
		"see_also": ["samskaras of childhood", "mantra", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "\"Adoration (or homage) to Siva.\" The supreme mantra of Saivism, known as the Panchakshara or \"the five letters.\" Embodying the essence of Saiva Siddhanta, it is found in the center of the central Veda (the Yajur) of the original three Vedas (Rig, Yajur and Sama) . The meanings of the five letters are: Na is the Lord's veiling grace; Ma is the world; Si is Siva; Va is His revealing grace; Ya is the soul. Namasivaya is a mystic chant which should be given by an authorized teacher.   ",
		"word": "Namasivaya",
		"see_also": ["samskaras of childhood", "mantra", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "\"Reverent salutations.\" The traditional Hindu verbal greeting and mudra in which the palms are joined together and held before the heart or raised to the level of the forehead. The mudra is also called anjali. It is a devotional gesture made equally before a Deity, holy person, friend or momentary acquaintance. Holding the hands together connects the right side of the body with the left, and brings the nerve and nadi currents into poised balance, into a consciousness of the sushumna, awakening the third eye within the greeter to worship God in the greeted.  ",
		"word": "namaskara",
		"see_also": ["anjali mudra", "pranama", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "\"Reverent salutations to you.\" A traditional verbal greeting. A form of namas, meaning \"bowing, obeisance.\"  ",
		"word": "namaste",
		"see_also": ["namaskara", "pranama", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "\"Glory to the marvelous Lotus Sutra.\" A foremost Japanese Nichiren Buddhist mantra.  ",
		"word": "Namo Myoho Renge Kyo",
		"see_also": ["namaskara", "pranama", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "\"Salutations to Narayana (Lord Vishnu).\" The great mantra of the Vaishnava faith. Also a popular greeting among Vaishnavites and Smartas.  ",
		"word": "Namo Narayanaya",
		"see_also": ["Vaishnavism", "Vishnu", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "\"The joyful.\" A white bull with a black tail, the vahana, or mount, of Lord Siva, symbol of the powerful instinctive force tamed by Him.  ",
		"word": "Nandi",
		"see_also": ["vahana", "Vishnu", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "\"The joyful.\" A white bull with a black tail, the vahana, or mount, of Lord Siva, symbol of the powerful instinctive force tamed by Him.  ",
		"word": "Nandi",
		"see_also": ["vahana", "Vishnu", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "\"Lord of Nandi.\" A name of Siva. Also another name for Nandinatha, the first historically known guru of the Nandinatha Sampradaya.  ",
		"word": "Nandikeshvara",
		"see_also": ["Kailasa Parampara", "Natha Sampradaya", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "The only surviving work of Nandikesvara (ca 250 BCE). Its 26 verses are the earliest extant exposition of advaitic Saivism, aside from the Saiva Agamas.  ",
		"word": "Nandikeshvara Kashika",
		"see_also": ["Kailasa Parampara", "Natha Sampradaya", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "(ca 250 BCE) The first siddha satguru of the major stream of the Nandinatha Sampradaya, the Kailasa Parampara, recorded in Panini's book of grammar as the teacher of rishis Patanjali, Vyaghrapada and Vasishtha. Among its representatives today are counted Satguru Sivaya Subramuniyaswami (1927-2001) and his successor Satguru Bodhinatha Veylanswami (1942-).  ",
		"word": "Nandinatha ",
		"see_also": ["Kailasa Parampara", "Natha Sampradaya", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": null,
		"word": "Nandinatha Sampradaya",
		"see_also": ["See: Natha Sampradaya", "Natha Sampradaya", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "(ca 250 BCE) A synonym of Nandikeshvara. The first siddha satguru of the major stream of the Nandinatha Sampradaya, the Kailasa Parampara, recorded in Panini's book of grammar as the teacher of rishis Patanjali, Vyaghrapada and Vasishtha. Among its representatives today is Satguru Bodhinatha Veylanswami, the successor of Satguru Sivaya Subramuniyaswami. ",
		"word": "Nandinatha, Maharishi",
		"see_also": ["Kailasa Parampara", "Natha Sampradaya", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "An Upanishad of the Atharva Veda which teaches of asceticism, sannyasa, true brahminhood, and more.  ",
		"word": "Narada Parivrajaka",
		"see_also": ["Kailasa Parampara", "Natha Sampradaya", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "A Vaishnava text of 84 aphorisms in which Sage Narada explains bhakti yoga (ca 1200).   ",
		"word": "Narada Sutra(s)",
		"see_also": ["Kailasa Parampara", "Natha Sampradaya", "Tirumurai", "tantrism"],
		"production_notes": null
	}, {
		"definition": "Abode of darkness. Literally, \"pertaining to man.\" The nether worlds. Equivalent to the Western term hell, a gross region of the Antarloka. Naraka is a congested, distressful area where demonic beings and young souls may sojourn until they resolve the darksome karmas they have created. Here beings suffer the consequences of their own misdeeds in previous lives. Naraka is understood as having seven regions, called tala, corresponding to the states of consciousness of the seven lower chakras as follows: 1) Put, \"childless\" -- atala chakra, \"wheel of the bottomless region.\" Fear and lust (located in the hips). 2) Avichi, \"joyless\" -- vitala chakra: \"wheel of negative region.\" Center of anger (thighs). 3) Samhata, \"abandoned\" -- sutala chakra: \"Great depth.\" Region of jealousy (knees). 4) Tamisra, \"darkness\" -- talatala chakra: \"wheel of the lower region.\" Realm of confused thinking (calves). 5) Rijisha, \"expelled\" -- rasatala chakra: \"wheel of subterranean region.\" Selfishness (ankles). 6) Kudmala, \"leprous\" -- mahatala chakra: \"wheel of the great lower region.\" Region of consciencelessness (feet). The intensity of \"hell\" begins at this deep level. 7) Kakola, \"black poison\" -- patala chakra, \"wheel of the fallen or sinful level.\" Region of malice (soles of the feet). The sevenfold hellish region in its entirety is also called patala, \"fallen region.\" Scriptures offer other lists of hells, numbering 7 or 21. They are described as places of torment, pain, darkness, confusion and disease, but these are only temporary abodes for the evolving soul. Hinduism has no eternal hell.  ",
		"word": "Naraka",
		"see_also": ["hell", "loka", "purgatory", "tala"],
		"production_notes": null
	}, {
		"definition": "\"The ascetic's surrender to Narasinha (incarnation of Vishnu as half-man, half-lion).\" An Upanishad of the Atharva Veda which deals with worship of Vishnu.   ",
		"word": "Narasinha Purvatapaniya",
		"see_also": ["hell", "loka", "purgatory", "tala"],
		"production_notes": null
	}, {
		"definition": "\"Abode of men.\" A name of Lord Vishnu.  ",
		"word": "Narayana",
		"see_also": ["Vishnu", "loka", "purgatory", "tala"],
		"production_notes": null
	}, {
		"definition": "A great exponent of Saiva Siddhanta (ca 1050).   ",
		"word": "Narayanakantha",
		"see_also": ["Vishnu", "loka", "purgatory", "tala"],
		"production_notes": null
	}, {
		"definition": "\"Coconut.\" In front of Ganesha shrines the world over, husked coconuts are broken as an act of prayer, symbolizing the ego's shattering to reveal the soul's innate sweet, pure nature. The coconut, circled by five mango leaves, nested on a pot of water, is worshiped as a Deity image, especially as Lord Ganesha, during certain puja rites. ",
		"word": "narikela",
		"see_also": ["Vishnu", "loka", "purgatory", "tala"],
		"production_notes": null
	}, {
		"definition": "\"One who denies; unbeliever.\" Opposite of astika, \"one who affirms.\" The terms astika (orthodox) and nastika (unorthodox) are a traditional classification of Indian schools of thought. Nastika refers to traditions that reject and deny the scriptural authority of the Vedas. This includes Sikhism, Jainism, Buddhism and Charvaka materialists. Astika refers to those schools that accept the revealed authority of the Vedas as supreme scripture. This includes the four major sects: Saivism, Shaktism, Vaishnavism and Smartism.  ",
		"word": "nastika",
		"see_also": ["atheism", "Charvaka", "materialism", "tala"],
		"production_notes": null
	}, {
		"definition": "\"King of Dance, or King of Dancers.\" God as the Cosmic Dancer. Perhaps Hinduism's richest and most eloquent symbol, Nataraja represents Siva, the Primal Soul, Parameshvara, as the power, energy and life of all that exists. This is Siva's intricate state of Being in Manifestation. The dance of Siva as Natesha, Lord of Dancers, is the dance of the entire cosmos, the rhythmic movements in all. All that is, whether sentient or insentient, pulsates in His body. Nataraja is art and spirituality in perfect oneness, chosen to depict the Divine because in dance that which is created is inseparable from its creator, just as the universe and soul cannot be separated from God. Nataraja is also stillness and motion wrought together. The stillness speaks of the peace and poise that lies within us all, at the center. The intense motion, depicted by His hair flying wildly in all directions, is an intimation of the fury and ferocity, the violent vigor, which fills this universe wherein we dwell. The implication of these opposites is that God contains and allows them both, that there is divine purpose at work in our life, whether we find ourselves engaged in its beauty or its \"madness.\" Dance and dancer are one; not an atom moves on any plane of existence but by His Will. Thus, this elegant symbol embodies the underlying unity of all. Siva's Dance, or all that happens, is composed of an ever-flowing combination of His five potent actions, panchakritya: 1) srishti: creation, or emanation, represented by His upper right hand and the damaru (drum), upon which he beats Paranada, the Primal Sound from which issue forth the rhythms and cycles of creation; 2) sthiti: preservation, represented by His lower right hand in a gesture of blessing, abhaya mudra, saying \"fear not;\" 3) samhara: destruction, dissolution or absorption, represented by the fire in His upper left hand, posed in ardhachandra mudra, \"half-moon gesture;\" 4) tirobhava: obscuring grace, the power which hides the truth, thereby permitting experience, growth and eventual fulfillment of destiny, represented by His right foot upon the prostrate figure (Apasmarapurusha), the principle of ignorance, or anava; 5) anugraha: revealing grace -- which grants knowledge and severs the soul's bonds -- represented by Siva's raised left foot, and by His lower left hand, held in gajahasta (\"elephant trunk\") mudra, inviting approach. These five cosmic activities are sometimes personalized respectively as Brahma, Vishnu, Rudra, Maheshvara and Sadashiva -- or as Sadyojata (creation), Vamadeva (preservation), Aghora (reabsorption), Tatpurusha (obscuration) and Ishana (granting grace). The ring of fire (prabhamandala), in which Siva dances is the hall of consciousness, chitsabha; in other words, the light-filled heart of man, the central chamber of the manifest cosmos. Siva dances the universe into and out of existence, veiling Ultimate Reality for most, unveiling it for devotees who draw near and recognize Parashiva, Ultimate Reality, in the chamber of their own inner being. Yea, all are dancing with Siva. ",
		"word": "Nataraja",
		"see_also": ["nada", "Parameshvara", "Parashakti", "Parashiva", "Sadashiva"],
		"production_notes": null
	}, {
		"definition": "The collected songs of Sage Yogaswami (1872-1964) of Jaffna, Sri Lanka, extolling the power of the satguru, worship of Lord Siva, adherance to the path of dharma and striving for the attainment of Self Realization. ",
		"word": "Natchintanai",
		"see_also": ["Kailasa Parampara", "Yogaswami", "Parashakti", "Parashiva", "Sadashiva"],
		"production_notes": null
	}, {
		"definition": "\"Master, lord; adept.\" Names an ancient Himalayan tradition of Saiva-yoga mysticism whose first historically known exponent was Nandikesvara (ca 250 bce). Natha -- Self-Realized adept -- designates the extraordinary ascetic masters (or devotees) of this school who through siddha yoga have attained tremendous powers, siddhis, and are sometimes called siddha yogis (accomplished or fully enlightened ones). The words of such beings naturally penetrate deeply into the psyche of their devotees, causing mystical awakenings. Like all tantrics, Nathas have refused to recognize caste distinctions in spiritual pursuits. Their satgurus bestow initiation according to spiritual worthiness, accepting devotees from the lowest to the highest rungs of society. Natha also designates a follower of the Natha tradition. The Nathas are considered the source of hatha as well as raja yoga.  ",
		"word": "Natha",
		"see_also": ["Kailasa Parampara", "Natha Sampradaya", "siddha yoga", "Parashiva", "Sadashiva"],
		"production_notes": null
	}, {
		"definition": "\"Adepts' monastery.\" As a proper noun, a synonym for Siddha Siddhanta.  ",
		"word": "Natha Matha",
		"see_also": ["Siddha Siddhanta", "Natha Sampradaya", "siddha yoga", "Parashiva", "Sadashiva"],
		"production_notes": null
	}, {
		"definition": "\"Lineage of Masters.\" Natha means lord or master, one who has mastered the intricacies of his inner and outer bodies and realized Parasivam. Sampradaya means an established oral teaching tradition or lineage. The Natha Sampradaya is the oldest Saivite sampradaya existing today, currently consisting of two lineages: the Nandinatha lineage and the Adinatha lineage. Historically, the Natha Sampradaya first appears with Sat Guru Nandinatha and his disciples, including Tirumular, who powerfully articulated the Natha teachings in his Tirumantiram. Gurudeva Sivaya Subramuniyaswami and his devotees are of this Nandinatha lineage of the Natha Sampradaya, the Siva Yogaswami Guru Paramparai being one stream of this ancient lineage.   ",
		"word": "Natha Sampradaya",
		"see_also": ["Siddha Siddhanta", "Natha Sampradaya", "siddha yoga", "Parashiva", "Sadashiva"],
		"production_notes": null
	}, {
		"definition": "Natyam is the title for a sadhaka in Gurudeva's monastic community who is qualifying to be a Yogi Tapsvin. They wear a yellow sash around their waist.",
		"word": "Natyam",
		"see_also": ["Bharatanatyam", "monastic", "siddha yoga", "Parashiva", "Sadashiva"],
		"production_notes": null
	}, {
		"definition": "\"One who shows the way.\" The 63 canonized Tamil saints of South India, as documented in the Periyapuranam by Sekkilar (ca 1140). All but a few were householders, honored as exemplars of radical devotion to Lord Siva, though their biographies are perhaps historically inaccurate and the actions of some were violent, even heinous. Several contributed to the Saiva Siddhanta scriptural compendium called Tirumurai.  ",
		"word": "Nayanar",
		"see_also": ["Bharatanatyam", "monastic", "siddha yoga", "Parashiva", "Sadashiva"],
		"production_notes": null
	}, {
		"definition": "Drawing very near the point of death, without actually dying.  ",
		"word": "near-death",
		"see_also": ["Bharatanatyam", "monastic", "siddha yoga", "Parashiva", "Sadashiva"],
		"production_notes": null
	}, {
		"definition": "A fear, worry or doubt about the future or a lingering regret about the past that keeps one from \"flowing with the river of life,\" living fully in the moment as an independent, spiritual being, facing each experience in the light of understanding.  ",
		"word": "negative attachment",
		"see_also": ["Bharatanatyam", "monastic", "siddha yoga", "Parashiva", "Sadashiva"],
		"production_notes": null
	}, {
		"definition": "A major political influence in India's movement for independence, Nehru (1889-1964) was born in Allahabad, educated at Harvard. With Mahatma Gandhi he helped negotiate India's freedom from Britain. After the formation of Pakistan in August, 1947, he became Prime Minister of India.  ",
		"word": "Nehru, Jawaharlal",
		"see_also": ["Bharatanatyam", "monastic", "siddha yoga", "Parashiva", "Sadashiva"],
		"production_notes": null
	}, {
		"definition": "(1861-1931) Indian nationalist politician who was an associate of Mahatma Gandhi and an influential leader in the years leading to India's independence. His son Jawaharlal Nehru (1889-1964), also greatly involved in the movement for self-governance, was the political heir to Gandhi and the first Prime Minister of independent India (1947-1964).  ",
		"word": "Nehru, Pandit Motilal",
		"see_also": ["Bharatanatyam", "monastic", "siddha yoga", "Parashiva", "Sadashiva"],
		"production_notes": null
	}, {
		"definition": "A prefix meaning new and different; modified.  ",
		"word": "neo",
		"see_also": ["Bharatanatyam", "monastic", "siddha yoga", "Parashiva", "Sadashiva"],
		"production_notes": null
	}, {
		"definition": "Navabharata Dharma. A modern form of liberal Hinduism that carries forward basic Hindu cultural values -- such as dress, diet and the arts -- while allowing religious values to subside. It emerged after the British Raj, when India declared itself an independent, secular state. It was promoted by the Macaulay educational system, installed in India by the British, which aggressively undermined Hindu thought and belief. Neo-Indian religion encourages Hindus to follow any combination of theological, scriptural, sadhana and worship patterns, regardless of sectarian or religious origin. Extending out of and beyond the Smarta system of worshiping the Gods of each major sect, it incorporates holy icons from all religions, including Jesus, Mother Mary and Buddha. Many Navabharatis choose not to call themselves Hindus but to declare themselves members of all the world's religions.  ",
		"word": "neo-Indian religion",
		"see_also": ["panchayatana puja", "Smarta Sampradaya", "Smartism", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "A term used by the International Society for Krishna Consciousness (ISKCON) referring to non-Indian devotees of Shri Krishna.  ",
		"word": "Neo-Vaishnavas",
		"see_also": ["panchayatana puja", "Smarta Sampradaya", "Smartism", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "Ancient land between India and Tibet -- 50,000 sq. miles, population 24 million. It was the birthplace of Buddha and Sata, the home of Matsyendranatha and is renowned for its Pashupatinatha Siva temple. Hinduism is the state religion.  ",
		"word": "Nepal",
		"see_also": ["panchayatana puja", "Smarta Sampradaya", "Smartism", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"Path.\"  ",
		"word": "neri",
		"see_also": ["panchayatana puja", "Smarta Sampradaya", "Smartism", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "Cord-like bundles of fibers made up of neurons through which impulses pass between the brain, central nervous system and other parts of the body. Here also names the fibrous network of inner bodies.  ",
		"word": "nerves",
		"see_also": ["panchayatana puja", "Smarta Sampradaya", "Smartism", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "An ingestive substance that strengthens activity of the nervous system, such as stimulants and sedatives. ",
		"word": "nervine",
		"see_also": ["panchayatana puja", "Smarta Sampradaya", "Smartism", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "The system of the brain, spinal cord, nerves, ganglia and parts of the receptor and effector organs that regulates the body's responses to internal and external stimuli.  ",
		"word": "nervous system",
		"see_also": ["panchayatana puja", "Smarta Sampradaya", "Smartism", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"Not this, not that.\" An Upanishadic formula connoting, through negation, the undefinable and inconceivable nature of the Absolute. It is an affirmation which the meditating yogi applies to each thought and phase of the mind as he penetrates deeper and deeper in his quest for Truth. Ultimately he transcends all \"this-ness\" to realize That which is beyond the mind.  ",
		"word": "neti neti",
		"see_also": ["kundalini", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "A mental or emotional disorder with symptoms such as insecurity, anxiety, depression and irrational fears.  ",
		"word": "neuroses",
		"see_also": ["kundalini", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"Neither one, nor the other.\" Often: \"having no sex or gender.\"  ",
		"word": "neuter",
		"see_also": ["kundalini", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "To counteract and affect or make useless; to balance.  ",
		"word": "neutralize",
		"see_also": ["kundalini", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "A star of such strong gravitational force that the atomic structure collapses, leaving only the nucleus; hence the name. A neutron star the size of an orange would weigh more than the entire Earth.  ",
		"word": "neutron star",
		"see_also": ["kundalini", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "According to Webster's New World Dictionary: \"Of or pertaining to a cultural movement popular in the 1980s [and '90s] characterized by a concern with spiritual consciousness, and variously combining belief in reincarnation and astrology with such practices as meditation, vegetarianism and holistic medicine.\"  ",
		"word": "New Age",
		"see_also": ["kundalini", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "The religious New Year is celebrated by the majority of Hindus in India according to traditional, pre-colonial calendars, several of which are still in use. There are, therefore, various New Year's days in different states of India, the two major ones being Dipavali in October-November, observed in North India, and the day when the sun enters Mesha (Aries) in April, celebrated in Tamil Nadu, Bengal and Nepal.  ",
		"word": "New Year",
		"see_also": ["kundalini", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "A small European songbird known for its melodious singing, especially at night.  ",
		"word": "nightingale",
		"see_also": ["kundalini", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "English hospital administrator ( 1820-1910 ) born in Florence, Italy, was influential in modernizing training for nursing. In 1854 during the Crimean War she organized a new type of hospital unit, introducing sanitary reforms, and securing necessary supplies. In 1907 she became the first woman to receive the British Order of Merit.  ",
		"word": "Nightingale, Florence",
		"see_also": ["kundalini", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "A dream arousing feelings of intense fear, horror and distress.  ",
		"word": "nightmare",
		"see_also": ["kundalini", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "(Shum) Withdrawing all the physical\/astral energies into the spinal current. Pronounced nee-kaw-shoom.  ",
		"word": "nikashum",
		"see_also": ["Shum", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"Bluewater lily.\" ",
		"word": "nilapadma",
		"see_also": ["Shum", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "Mystic, philosopher and founder of the Minandi Vaishnava school of Vedanta (ca 1150). He acclaimed the guru's grace as the only true means to salvation.  ",
		"word": "Nimbarka",
		"see_also": ["Vedanta", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "A radiant light surrounding a person or thing; an aura.  ",
		"word": "nimbus",
		"see_also": ["Vedanta", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"God without qualities.\"  ",
		"word": "Nirguna Brahman",
		"see_also": ["Brahman", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"Etymology Veda-limb.\" Auxiliary treatises discussing the origin and development of words; one of the four linguistic skills taught for mastery of the Vedas and the rites of yajna. Nirukta relies upon ancient lexicons, nighantu, as well as detailed hymn indices, anukramani. Five nighantus existed at the time of Yaska (Yaska) (320 BCE), whose compilation is regarded a standard work on Vedic etymology.  ",
		"word": "Nirukta Vedanga",
		"see_also": ["Vedanga", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"End; completion.\" Conclusion.   ",
		"word": "nirvahana",
		"see_also": ["Vedanga", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"Extinction.\" In Buddhism it is the indescribable ultimate attainment or disinterested wisdom and compassion. In Hinduism it is the emancipation from ignorance and the end of all attachment. Also an ideal condition of rest, harmony, stability, or joy.  ",
		"word": "nirvana",
		"see_also": ["Vedanga", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "Title for a senior sadhaka in Saiva Siddhanta Church who has followed the pattern of wearing white throughout monastic life and not entering the auxiliary training of the natyam. Nirvana sadhakas may qualify for holy orders of sannyasa after age 72.",
		"word": "nirvana sadhaka",
		"see_also": ["Vedanga", "samadhi", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "Nirvani is the title used in Gurudeva’s monastic community to refer to a senior sadhaka.",
		"word": "nirvani and upadeshi",
		"see_also": ["satguru", "vishvagrasa", "raja yoga", "syncretism", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"Undifferentiated trance, enstasy (samadhi) without form or seed.\" The realization of the Self, Parashiva, a state of oneness beyond all change or diversity; beyond time, form and space.  ",
		"word": "nirvikalpa samadhi",
		"see_also": ["enstasy", "raja yoga", "samadhi", "Self Realization", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"Undifferentiated trance, enstasy (samadhi) without form or seed.\" The realization of the Self, Parashiva, a state of oneness beyond all change or diversity; beyond time, form and space.  ",
		"word": "nirvikalpa samadhi",
		"see_also": ["enstasy", "raja yoga", "samadhi", "Self Realization", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"Engagement (to marry);\" \"declaration of intention.\" Same as vagdana.  ",
		"word": "nishchitartha",
		"see_also": ["marriage covenant", "samskaras of adulthood", "samadhi", "Self Realization", "universalist"],
		"production_notes": null
	}, {
		"definition": "The reclusive sage (? -- 1961) known as Bhagavan, \"the exalted one,\" who lived an extraordinary mystic life near Mumbai, India, and initiated a number of disciples, including Swami Muktananda.  ",
		"word": "Nityananda, Swami",
		"see_also": ["marriage covenant", "samskaras of adulthood", "samadhi", "Self Realization", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"The eternal Word.\" An expression from the Vedas describing the primal sound, the Word, the first impulse of creation.  ",
		"word": "nityavak",
		"see_also": ["vak", "samskaras of adulthood", "samadhi", "Self Realization", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"Announcement, presentation, making known.\"   ",
		"word": "nivedana",
		"see_also": ["vak", "samskaras of adulthood", "samadhi", "Self Realization", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"To unleash.\" The niyamas are ethical and religious practices which release or cultivate refined, soul qualities. These observances comprise the second limb of the ashtanga (\"eight-limbed\") yoga system codified in numerous Saivite scriptures including the Sandilya and Varuha Upanishads, Hatha Yoga Pradipika by Sri Gorakhnath, the Tirumantiram (circa 200 BCE) by Saint Tirumular and the Yoga Sutras (circa 200 BCE) of sage Patanjali. There are ten yamas and ten niyamas in all, though Patanjali listed only five yamas and five niyamas in his classic work, & these have become widely known. Along with the yamas (restraints), the niyamas provide guidelines for ethical, moral life and lay the foundation for yoga. The ten niyamas are: 1) santosha (contentment), 2) tapaha (austerity), 3) dana (charity), 4) astikya (faith), 5) Isvarapujana (worship), 6) mati (cognition), 7) Siddhantasravana (scriptural study), 8) hri (remorse), 9) vrata (sacred vows) and 10) japa (recitation). Note that Sage Patanjali's niyamas are saucha (purity, which other texts list as a yama), santosha, tapaha, svadhaya (scriptural study) and Isvarapranidhana (worship).  ",
		"word": "niyama",
		"see_also": ["vak", "samskaras of adulthood", "samadhi", "Self Realization", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"Necessity, restriction; the fixed order of things, destiny.\" A synonym for karma, niyati is the eighth tattva. It is part of the soul's fivefold \"sheath,\" pancha kanchuka (or vijnanamaya kosha), along with kala (time), kala (creativity), vidya (knowing) and raga (attachment, desire). The soul thus encased is called purusha.  ",
		"word": "niyati",
		"see_also": ["karma", "tattva", "samadhi", "Self Realization", "universalist"],
		"production_notes": null
	}, {
		"definition": null,
		"word": "nondual (nondualism)",
		"see_also": ["dvaita-advaita", "monistic theism", "Vedanta", "Self Realization", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"Not two-ness.\" Monistic philosophy.  ",
		"word": "nondualism",
		"see_also": ["advaita", "monism", "monistic theism", "Vedanta", "universalist"],
		"production_notes": null
	}, {
		"definition": "The phenomenon of the soul being born as nonhuman life forms, explained in various scriptures. For example, Saint Manikkavasagar's famous hymn (Tiruvasagam 8.14): \"I became grass and herbs, worm and tree. I became many beasts, bird and snake. I became stone and man, goblins and sundry celestials. I became mighty demons, silent sages and the Gods. Taken form in life, moveable and immovable, born in all, I am weary of birth, my Great Lord.\" The Upanishads, too, describe the soul's course after death and later taking a higher or lower birth according to its merit or demerit of the last life (Kaushitaki Upanishad 1.2, Chhandogya Upanishad 5.3 -- 5.10, Brihadaranyaka Upanishad 6.2). These statements are sometimes misunderstood to mean that each soul must slowly, in sequential order incarnate as successively higher beings, beginning with the lowest organism, to finally obtain a human birth. In fact, as the Upanishads explain, after death the soul, reaching the inner worlds, reaps the harvest of its deeds, is tested and then takes on the appropriate incarnation -- be it human or nonhuman -- according to its merit or demerit. Souls destined for human evolution are human-like from the moment of their creation in the Sivaloka. This is given outer expression in the Antarloka and Bhuloka, on Earth or other similar planets, as the appropriate sheaths are developed. However, not all souls are human souls. There are many kinds of souls, such as genies, elementals and certain Gods, who evolve toward God through different patterns of evolution than do humans. One cause of unclarity is to confuse the previously mentioned scriptural passages with the theory of biological evolution developed by Charles Darwin (1809 -- 1882), which states that plant and animal species develop or evolve from earlier forms due to hereditary transmission of variations that enhance the organism's adaptability and chances of survival. These principles are now considered the kernel of biology. Modern scientists thus argue that the human form is a development from earlier primates, including apes and monkeys. The Darwinian theory is reasonable but incomplete, as it is based in a materialistic conception of reality that does not encompass the existence of the soul. While the Upanishadic evolutionary vision speaks of the soul's development and progress through reincarnation, the Darwinian theory focuses on evolution of the biological organism, with no relation to a soul or individual being.  ",
		"word": "nonhuman birth",
		"see_also": ["evolution of the soul", "kosha", "reincarnation", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": " Which does not cause harm or injury. -- noninjuriousness: A translation of ahimsa, the principle of not causing harm or injury to living beings, whether by thought, word or deed. ",
		"word": "noninjurious",
		"see_also": ["ahimsa", "kosha", "reincarnation", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "The act, practice or attitude of not persisting, giving up too easily.  ",
		"word": "nonperseverance",
		"see_also": ["yama-niyama", "kosha", "reincarnation", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "Not limited to or associated with a particular religious denomination.  ",
		"word": "nonsectarian",
		"see_also": ["yama-niyama", "kosha", "reincarnation", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": null,
		"word": "nonviolence",
		"see_also": ["ahimsa", "kosha", "reincarnation", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "A hidden or secluded spot. Here it refers to areas of the mind.  ",
		"word": "nook",
		"see_also": ["ahimsa", "kosha", "reincarnation", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "A name for Kashmir Saivism.  ",
		"word": "Northern Saivism",
		"see_also": ["Kashmir Saivism", "kosha", "reincarnation", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "A longing for past events, people or things; homesickness.  ",
		"word": "nostalgia",
		"see_also": ["Kashmir Saivism", "kosha", "reincarnation", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "Worthy of being noted. Remarkable.  ",
		"word": "notable",
		"see_also": ["Kashmir Saivism", "kosha", "reincarnation", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "Newness. The constant changes and enchantments of life.   ",
		"word": "novelty",
		"see_also": ["Kashmir Saivism", "kosha", "reincarnation", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "The state or period of being a novice. i.e., a newcomer on probation to a monastic or religious community before taking final vows.  ",
		"word": "novitiate",
		"see_also": ["Kashmir Saivism", "kosha", "reincarnation", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "A name and traditional murti, or form, of Ganesha. \"He who is dancing,\" a four-armed golden murti under a kalpavriksha, wish-fulfilling, tree. ",
		"word": "Nritya Ganapati",
		"see_also": ["Kashmir Saivism", "kosha", "reincarnation", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "Subtle or slight degrees of difference, as in meaning, feeling or tone. Here it refers to shades of the mind and thought.  ",
		"word": "nuances",
		"see_also": ["Kashmir Saivism", "kosha", "reincarnation", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "A central part with other parts grouped around it; a core.  ",
		"word": "nucleus",
		"see_also": ["Kashmir Saivism", "kosha", "reincarnation", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": null,
		"word": "nucleus of the soul",
		"see_also": ["atman", "impersonal being", "soul", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "To make invalid or useless.  ",
		"word": "nullify",
		"see_also": ["atman", "impersonal being", "soul", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "The study of the hidden meanings of numbers and how they influence human life.  ",
		"word": "numerology",
		"see_also": ["atman", "impersonal being", "soul", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "A nun is a celibate woman following strict, perhaps austere and usually solitary, spiritual disciplines and lifestyle. By balancing the masculine and feminine energies within herself through sadhana and yoga, she is a complete being, detached from the thoughts and feelings of others, free to follow the contemplative and mystical life in pursuit of the Self within. To accomplish this, she works to permanently conquer her feminine instincts and the emotional tendencies of a woman's body. She strives to transmute her sexuality into the Divine, giving up her womanliness so thoroughly that she is indistinguishable from a monk. In Hinduism, nuns may be sannyasinis, yoginis or sadhikas.  ",
		"word": "nun",
		"see_also": ["monastic", "sannyasin", "monk", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "To raise or promote development, train; educate or foster. ",
		"word": "nurture",
		"see_also": ["monastic", "sannyasin", "monk", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "The act or process or furnishing nurture, nourishment for growth, development or education.  ",
		"word": "nurturing (nurturance)",
		"see_also": ["monastic", "sannyasin", "monk", "soul", "universalist"],
		"production_notes": null
	}, {
		"definition": "\"System; rule; logic.\"  ",
		"word": "Nyaya",
		"see_also": ["Gautama", "shad darshana", "monk", "soul", "universalist"],
		"production_notes": null
	}],
	"results": 105
}