{"entries":[{"definition":"1) Quality of thinking or perception relating to the object as it truly is. Not biased or colored by one's personal point of view or prejudices, which then would be subjective thinking. 2) A target, goal or anything sought for or aimed at. Cf: subjective.  ","word":"objective","see_also":null,"production_notes":null},{"definition":"An offering or sacrifice ceremoniously given to a God or guru.  ","word":"oblation","see_also":["sacrifice","yajna"],"production_notes":null},{"definition":"To constrain, make indebted or grateful.  ","word":"oblige","see_also":["sacrifice","yajna"],"production_notes":null},{"definition":"A thorough blotting out; wiping out.  ","word":"obliteration","see_also":["sacrifice","yajna"],"production_notes":null},{"definition":"The power to make obscure, to conceal or veil, as in Siva's veiling or obscuring grace.  ","word":"obscuration","see_also":["grace","Nataraja"],"production_notes":null},{"definition":"Dark, hidden; not noticed or seen. Not clearly understood or explained; vague.  ","word":"obscure","see_also":["grace","Nataraja"],"production_notes":null},{"definition":" ","word":"obscuring grace","see_also":["See: grace","Nataraja"],"production_notes":null},{"definition":"The act, power or practice of noting, or being aware, of facts and events.  ","word":"observation","see_also":["See: grace","Nataraja"],"production_notes":null},{"definition":null,"word":"obstacle","see_also":["upasarga","Nataraja"],"production_notes":null},{"definition":"Overly determined to have one's own way. Stubborn.  ","word":"obstinate (obstinacy)","see_also":["upasarga","Nataraja"],"production_notes":null},{"definition":"An obstacle; something that prevents a desired result.  ","word":"obstruction","see_also":["upasarga","Nataraja"],"production_notes":null},{"definition":"Hidden, or kept secret; revealed only after initiation.  ","word":"occult","see_also":["mysticism","Nataraja"],"production_notes":null},{"definition":"The study of, and attempted control over, the supernatural.  ","word":"occultism","see_also":["mysticism","Nataraja"],"production_notes":null},{"definition":"Spiritually magnetic -- of or pertaining to consciousness within ashuddha maya, the realm of the physical and lower astral planes. Odic force in its rarified state is prakriti, the primary gross energy of nature, manifesting in the three gunas: sattva, rajas and tamas. It is the force of attraction and repulsion between people, people and their things, and manifests as masculine (aggressive) and feminine (passive), arising from the pingala and ida currents. These two currents (nadi) are found within the spine of the subtle body. Odic force is a magnetic, sticky, binding substance that people seek to develop when they want to bind themselves together, such as in partnerships, marriage, guru-shishya relationships and friendships. Odic energy is the combined emanation of the pranamaya and annamaya koshas. The term odic is the adjective form of od (pronounced like mode), defined in the Oxford English Dictionary as \"a hypothetical force held by Baron von Reichenbach (1788 -- 1869) to pervade all nature, manifesting itself in certain persons of sensitive temperament (streaming from their fingertips), and exhibited especially by magnets, crystals, heat, light and chemical action; it has been held to explain the phenomena of mesmerism and animal magnetism.\"  ","word":"odic","see_also":["actinic","actinodic","guna","kosha","odic","subtle body","tattva"],"production_notes":null},{"definition":"Spiritually magnetic -- of or pertaining to consciousness within ashuddha maya, the realm of the physical and lower astral planes. Odic force in its rarefied state is prakriti, the primary gross energy of nature, manifesting in the three gunas: sattva, rajas and tamas. All matter -- earth, air, fire and water, as well as thought -- is composed of odic force. It is the force of attraction and repulsion between people, people and their things, and manifests as masculine (aggressive) and feminine (passive), arising from the pingala and ida currents. These two currents (nadi) are found within the spine of the subtle body. Odic force is a magnetic, sticky, binding substance that people seek to develop when they want to bind themselves together, such as in partnerships, marriage, guru-shishya relationships and friendships. It, of itself, is stagnant and unflowing. Odic energy is the combined emanation of the pranamaya and annamaya koshas.  ","word":"odic force","see_also":["actinic","kosha","subtle body","tattva","odic","subtle body","tattva"],"production_notes":null},{"definition":"Physical vitality. During the process of making the mind return to an object or subject of concentration, odic as well as actinic prana is forced through the subtle nerve currents, causing them to grow strong so that concentration becomes effortless as the subconscious responds to the conscious-mind concentration efforts, causing a new process called meditation to occur.  ","word":"odic prana","see_also":["actinic force","actinic prana","odic force","willpower","odic","subtle body","tattva"],"production_notes":null},{"definition":null,"word":"offering basket","see_also":["archana basket","actinic prana","odic force","willpower","odic","subtle body","tattva"],"production_notes":null},{"definition":"Performing duties and responsibilities of an officer or priest.  ","word":"officiate","see_also":["archana basket","actinic prana","odic force","willpower","odic","subtle body","tattva"],"production_notes":null},{"definition":"Made up for, compensated for, counterbalanced.  ","word":"offset","see_also":["archana basket","actinic prana","odic force","willpower","odic","subtle body","tattva"],"production_notes":null},{"definition":"Something that branches out or derives its existence or origin from a particular source.  ","word":"offshoot","see_also":["archana basket","actinic prana","odic force","willpower","odic","subtle body","tattva"],"production_notes":null},{"definition":"The young of animals or humans. Children. Sanskrit: apatya.  ","word":"offspring","see_also":["archana basket","actinic prana","odic force","willpower","odic","subtle body","tattva"],"production_notes":null},{"definition":"Describes oils that have been overused or overheated in the cooking process to the point of toxicity, such as in deep-frying, or that are exceedingly high in saturated fat or cholesterol, or that have been found to be unhealthy to use in cooking. The unhealthiest oils include coconut oil, cottonseed oil, rapeseed (canola) oil, palm oil, corn oil, peanut oil and all hydrogenated oils, as well as others. The most healthy cooking oils are ghee (clarified butter), olive oil and sesame oil. Olive oil and sesame oil are also nutritious in salads and other raw dishes. Flaxseed oil also has many health advantages, but it should never be heated.  ","word":"oils, degraded","see_also":["archana basket","actinic prana","odic force","willpower","odic","subtle body","tattva"],"production_notes":null},{"definition":"\"Vigor, force, strength, vitality.\" In ayurveda, the underlying life-sap or fluid-essence of the dhatus, the seven tissue systems of the body -- plasma, blood, muscle, fat, bone, nerves and reproductive tissue. Ojas pervades every part of the body and underlies all physical capacities. It is not a physical substance, but exists on a subtle level. Ojas is depleted by excessive sex, drugs, excessive talking, loud music, emotional burnout and insufficient rest. Signs of diminished ojas are fear, worry, sensory organ pain, poor complexion, cheerlessness, harshness, emaciation, immune system disorders and tendency to contract diseases (all the symptoms of the modern disease AIDS). Conservation of the vital sexual fluids increases the store of ojas, strengthens the immune system and enhances health and the quality of one's consciousness. Ojas is depleted by ejaculation in men, and by orgasm and menstruation in women. After 30 days of complete sexual abstinence, sperm is transmuted into ojas. This abundance of ojas rises to the brain and becomes centered in the head chakras, where it is expressed as spiritual and intellectual power. Such an individual develops a radiance, called tejas. In the realized being, the energy of ojas is transmuted to Absolute Consciousness as kundalini shakti.  ","word":"ojas","see_also":["ayurveda","lymph","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"\"Leaf.\" An ancient form of Indian books used in India, made of strips of fronds from the palmyra (trindruma) and talipot (talapatra, \"fan-leaf\") palms. Prepared birch bark (bhurja patra) was the medium in the North. The pages were loosely tied, with cord passed between one or two holes and usually bound between wooden covers. Ink, made from lampblack or charcoal, was applied with a reed pen. Or, more commonly in the South, the letters were scribed with a stylus, then rubbed with powdered lampblack. These books are small in size, averaging about 2 inches high and 8 inches wide and up to 11 or 12 inches thick, wound with string and generally protected in colored cloth.  ","word":"olai","see_also":["grantha","lymph","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"One who has reincarnated many times, experienced much and is therefore further along the path than young souls. Old souls may be recognized by their qualities of compassion, self-effacement and wisdom.  ","word":"old soul","see_also":["evolution of the soul","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"\"Yes, verily.\" The most sacred mantra of Hinduism. Om is an alternate transliteration of Aum (the sounds A and U blend to become O).  ","word":"Om","see_also":["Aum","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"A sign that portends the nature of future events, either auspicious or inauspicious.  ","word":"omen","see_also":["Aum","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"Foreboding; frightening, sinister.  ","word":"ominous","see_also":["Aum","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"\"Impulse of the cosmic sound.\" A name of God as the source, or creator, of Primal Sound, Aum.  ","word":"Omkara","see_also":["See Aum","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"All-powerful. Able to do anything.  ","word":"omnipotent","see_also":["See Aum","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"Present everywhere and in all things.   ","word":"omnipresent","see_also":["See Aum","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"Possessing infinite knowledge, all-knowing.  ","word":"omniscient","see_also":["See Aum","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"Quality or state of being one. Unity, identity, especially in spite of appearances to the contrary -- e.g., the oneness of soul and God.  ","word":"oneness","see_also":["monism","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"Burdensome; weighing heavily.  ","word":"onerous","see_also":["monism","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"The branch of metaphysics dealing with the nature of reality.  ","word":"ontology","see_also":["monism","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"Opal-like in appearance, a family of precious and semi-precious stones, milky white or of various colors, capable of refracting light and reflecting it into an array of colors. Showing a play of colors. Iridescent.  ","word":"opalescent (opaline)","see_also":["monism","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"A faculty of memory stored in the memory gridwork of the subconscious mind which provides a platform for the intellect, developing an ego. Knowledge gained through the study, hearing and quoting of opinions of others. Looking at the world through the eyes of others.  ","word":"opinionated knowledge","see_also":["monism","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"The path taken by a celestial body revolving around another.  ","word":"orbit","see_also":["monism","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"To bestow the duties and responsibilities, authority and spiritual power of a religious office, such as priest, minister or satguru, through religious ceremony or mystical initiation.  ","word":"ordain (ordination)","see_also":["diksha","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"  ","word":"orifice of Brahman","see_also":["door of Brahman","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":null,"word":"original sin","see_also":["sin","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"\"Of right (correct) opinion.\" Conforming to established doctrines or beliefs. Opposite of heterodox, \"different opinion.\"  ","word":"orthodox","see_also":["sin","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"To grow faster or larger than and, therefore, to lose or be rid of in the process of growing.   ","word":"outgrow (outgrown)","see_also":["sin","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"To cast a shadow over or be more important than; to dominate.   ","word":"overshadow","see_also":["sin","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"Open and observable to anyone; not covert, unconcealed.  ","word":"overt","see_also":["sin","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null},{"definition":"To overcome or overpower as with great force or emotion.  ","word":"overwhelm","see_also":["sin","soul","tejas","transmutation","yoni","subtle body","tattva"],"production_notes":null}],"results":46}