{"entries":[{"definition":"Technically speaking, each of the five varieties of man (Caucasoid, Congoid, Mongoloid, Australoid and Capoid) is a Homo sapiens subspecies. A subspecies is a branch showing slight but significant differences from another branch living in a different area. Few traits are unique to any one race. It is the combination of several traits that indicate racial identity. Accurate race determination can be made by blood analysis or by measuring and comparing certain body dimensions. Ninety-eight percent of all Hindus belong to the Caucasoid race. There are also large numbers of Hindu Mongoloids in Nepal and Assam and some Australoids, such as the Gond and Bhil tribes of India. North and South Indians are among Earth's 2.5 billion Caucasoids, whose traits include straight to wavy hair, thin lips, small to medium teeth, blue to dark brown eyes and a high incident of A -Rh and Gm blood genes. Skin color, often erroneously attached to the idea of race, is now known to be adaptation to climate: over generations, people in northern climates have developed lighter complexions than their southern brothers. In a more general sense, the term race can apply to any geographical, national or tribal ethnic group, or to mankind as a whole, as \"the human race.\"  ","word":"race","see_also":null,"production_notes":null},{"definition":"\"Queen of prosperity.\" Mythologically, Radha Rani is a consort of Lord Krishna. In Hindu mythology, Radha is the creative, life-sustaining, auspicious, benevolent, loving and redemptive Goddess, chief among the Gopis. In the bhakti tradition of Krishna she symbolizes the soul's yearning for salvation and union with God.  ","word":"Radha Rani","see_also":null,"production_notes":null},{"definition":"(1888-1975) The President of India from 1962 to 1967, an outstanding scholar, philosopher, prolific writer, compelling speaker and effective spokesman for Hinduism. Along with Vivekananda, Tagore, Aurobindo and others, he helped bring about the current Hindu revival. He made Hinduism better known and appreciated at home and abroad, especially in the intellectual world. He was a foremost proponent of panentheism.  ","word":"Radhakrishnan, Dr. S.","see_also":["Vedanta"],"production_notes":null},{"definition":"\"That which enraptures.\" In the structure of melody in Indian music, a specific collection of sounds or notes. Raga is similar to \"scale\" in Western notation, but raga includes the unique emotional or mystical mood created when the melody is heard.  Raga, while being a musical term, means much more. It is desire, passion, attraction, etc. for any object, person, position, attainment. Man's life revolves on 'raga,' desire. Man's bondage is because of raga. Scriptures teach man to have raga but make the object of raga divine and spiritual. When man develops deep dispassion to what could bind him and turn his attention to desire that which will free him from bondage, that is salvation. Raga for the worldly objects is denounced by scripture. Raga for Atman, God, Brahman, Ishvara, is called mumukshutvam, moksha icchaa, desire for liberation.","word":"raga","see_also":["Vedanta"],"production_notes":null},{"definition":"Uncontrolled anger. Fuming fit of fury.  ","word":"rage","see_also":["vitala chakra"],"production_notes":null},{"definition":"\"The seizer.\" In Hindu astrology, Rahu is one of the nine important planets (graha), but is an invisible or \"astral\" one, along with its counterpart, Ketu. Physically speaking, it is one of two points in the heavens where the moon crosses the ecliptic or path of the sun. The point where the moon crosses the ecliptic moving from south to north is Rahu, the north node. The south node is Ketu. Rahu and Ketu are depicted as a serpent demon who encircles the Earth. Ketu is the dragon's tail and Rahu is the head. Both are believed to cause general consternation among people.  ","word":"Rahu","see_also":["jyotisha"],"production_notes":null},{"definition":"\"King of yogas.\" Also known as ashtanga yoga, \"eight-limbed yoga.\" The classical yoga system of eight progressive stages to Illumination as described in various yoga Upanishads, the Tirumantiram and, most notably, the Yoga Sutras of Patanjali. The eight stages are: yama (restraints), niyama (observances), asana (posture), pranayama (breath control), pratyahara (withdrawal), dharana (concentration), dhyana (meditation) and samadhi (enstasy, mystic oneness).  ","word":"raja yoga","see_also":["enstasy","samadhi","yoga"],"production_notes":null},{"definition":"\"Rulership.\" A synonym for kshatriya.  ","word":"rajanya","see_also":["varna dharma","samadhi","yoga"],"production_notes":null},{"definition":"\"Royal lady.\" The Goddess of world-sustaining transcendental knowledge. She whose glances delight the universe. A form of Parvati.  ","word":"Rajarajeshvari","see_also":["varna dharma","samadhi","yoga"],"production_notes":null},{"definition":"\"Kingly seer.\"  ","word":"rajarishi","see_also":["varna dharma","samadhi","yoga"],"production_notes":null},{"definition":"\"Passion; activity.\"","word":"rajas","see_also":["guna","samadhi","yoga"],"production_notes":null},{"definition":"Having the quality of rajas, the second of the three gunas or fundamental cosmic qualities of nature as described in the Samkhya system--tamas (inertia), rajas (activity) and sattva (illumination, purity). The rajaguna is said to be the driving power animating the other two gunas. It is the stimulative, restless, expansive energy of growth and movement. (Literally, \"sphere of mist or clouds,\" in the Veda distinguished from svar, \"sphere of light.\")  ","word":"rajasic","see_also":["guna","samadhi","yoga"],"production_notes":null},{"definition":"Venerated hero of the Ramayana epic, and one of the two most popular incarnations of Vishnu, along with Krishna. His worship is almost universal among Vaishnavas, and extensive among Smartas and other liberal Hindus. He was a great worshiper of Siva, and a Siva temple, called Rameshvaram, was built in his name at the southern tip of India.   ","word":"Rama","see_also":["guna","samadhi","yoga"],"production_notes":null},{"definition":"One of the first Indian monks (1873-1906) to bring yoga and Vedanta to the West, he lectured throughout Japan and America, spreading \"practical Vedanta.\"  ","word":"Rama Tirtha","see_also":["guna","samadhi","yoga"],"production_notes":null},{"definition":"A great exponent of Saiva Siddhanta, ca 950. In the lineage of Aghorasiva.  ","word":"Ramakantha I","see_also":["guna","samadhi","yoga"],"production_notes":null},{"definition":"(1836 -- 1886) One of the great saints and mystics of modern Hinduism, a champion and exemplar of monistic theism. A fervent devotee of Mother Kali and staunch monist who taught oneness and the pursuit of nirvikalpa samadhi, realization of the Absolute. He was guru to the great Swami Vivekananda (1863 -- 1902), who internationalized Hindu thought and philosophy. ","word":"Ramakrishna","see_also":["guna","samadhi","yoga"],"production_notes":null},{"definition":"(1879-1950) Hindu Advaita renunciate renaissance saint of Tiruvannamalai, South India.  ","word":"Ramana Maharshi","see_also":["guna","samadhi","yoga"],"production_notes":null},{"definition":"Philosopher saint, great bhakta (1017 -- 1137), founder of one of five major Vaishnava schools, and considered the greatest critic of advaita. In his famous Shri Bhashya on the Brahma Sutras, he countered Sankara's absolute monism, point-by-point, with his qualified monism, called Vishishtadvaita Vedanta.  ","word":"Ramanuja","see_also":["shad darshana","Vedanta","yoga"],"production_notes":null},{"definition":"(1478 -- 1565). The last king of South India's Vijayanagara Empire.  ","word":"Ramaraja ","see_also":["shad darshana","Vedanta","yoga"],"production_notes":null},{"definition":"\"Vehicle of Rama.\" One of India's two grand epics (Itihasa) along with the Mahabharata. It is Valmiki's tragic love story of Rama and Sita, whose exemplary lives have helped set high standards of dignity and nobility as an integral part of Hindu dharma. Astronomical data in the story puts Rama's reign at about 2015 BCE.","word":"Ramayana","see_also":["Itihasa","Mahabharata","Rama"],"production_notes":null},{"definition":"Resulting effects and consequences.  ","word":"ramifications","see_also":["Itihasa","Mahabharata","Rama"],"production_notes":null},{"definition":"To branch out; make more complex.  ","word":"ramify","see_also":["Itihasa","Mahabharata","Rama"],"production_notes":null},{"definition":"Unchecked; unrestrained.  ","word":"rampant","see_also":["Itihasa","Mahabharata","Rama"],"production_notes":null},{"definition":"Great Bengali devotional saint-poet (1718 -- 1775) who composed hymns to Shakti.  ","word":"Ramprasad","see_also":["Itihasa","Mahabharata","Rama"],"production_notes":null},{"definition":"Traditional household and priestly art of \"drawing\" intricate decorative patterns at the entrance to a home or temple or at the site of a religious ceremony. Known as kolam in Tamil. Rangoli designs are made with rice powder mixed to a watery paste, and sometimes with flowers and various-colored powdered pulses. ","word":"rangoli","see_also":["Itihasa","Mahabharata","Rama"],"production_notes":null},{"definition":"Relationship, especially of trust and understanding  ","word":"rapport","see_also":["Itihasa","Mahabharata","Rama"],"production_notes":null},{"definition":"filled with great joy; ecstatic.  ","word":"rapturous","see_also":["Itihasa","Mahabharata","Rama"],"production_notes":null},{"definition":"Made thin or less dense; purified or refined.  ","word":"rarefied ","see_also":["Itihasa","Mahabharata","Rama"],"production_notes":null},{"definition":"\"Subterranean region.\" The fifth chakra below the muladhara, centered in the ankles. Corresponds to the fifth astral netherworld beneath the Earth's surface, called Rijisha (\"expelled\") or Rasatala. Region of selfishness, self-centeredness and possessiveness. Rasa means \"earth, soil;\" or \"moisture.\"  ","word":"rasatala","see_also":["chakra","loka","Naraka"],"production_notes":null},{"definition":"\"Subterranean region.\" The fifth chakra below the muladhara, centered in the ankles. Corresponds to the fifth astral netherworld beneath the earth's surface, called Rijisha (\"expelled\") or Rasatala. Region of selfishness, self-centeredness and possessiveness. Rasa means \"earth, soil; moisture.\" ","word":"rasatala chakra","see_also":["chakra","Naraka","Naraka"],"production_notes":null},{"definition":"Official or formal approval, sanction.  ","word":"ratification","see_also":["chakra","Naraka","Naraka"],"production_notes":null},{"definition":"Fundamental principles and reasons, especially in the sense of providing a plausible basis for a way of thinking or acting.  ","word":"rationales","see_also":["chakra","Naraka","Naraka"],"production_notes":null},{"definition":"To devise self-satisfying, often incorrect, reasons for behavior, way of thinking, reactions, etc.  ","word":"rationalize","see_also":["chakra","Naraka","Naraka"],"production_notes":null},{"definition":"\"Pot of gems.\" ","word":"ratnakumbha","see_also":["chakra","Naraka","Naraka"],"production_notes":null},{"definition":"Among the 28 Saiva Siddhanta Agamas, this scripture was conveyed by Lord Siva to sage Ruru (hence the name). Its extensive kriya pada section details the structure of the Siva temple and its annexes.   ","word":"Raurava Agama","see_also":["chakra","Naraka","Naraka"],"production_notes":null},{"definition":"Villain of the Ramayana epic. A legendary demon-king of Sri Lanka, adversary of Rama, eventually defeated by Rama and his armies.   ","word":"Ravana","see_also":["chakra","Naraka","Naraka"],"production_notes":null},{"definition":"To enact or perform again.  ","word":"re-enact","see_also":["chakra","Naraka","Naraka"],"production_notes":null},{"definition":"Taking in again, as is water squeezed from and then drawn back into a sponge. ","word":"reabsorption (reabsorb)","see_also":["mahapralaya","Naraka","Naraka"],"production_notes":null},{"definition":"A response to an action.  ","word":"reaction","see_also":["mahapralaya","Naraka","Naraka"],"production_notes":null},{"definition":"A new affirming or a declaration about a thing as true or still pertinent.  ","word":"reaffirmation","see_also":["affirmation","Naraka","Naraka"],"production_notes":null},{"definition":null,"word":"reality","see_also":["Absolute Reality","relative","Naraka"],"production_notes":null},{"definition":"A kingdom, region, area or sphere.  ","word":"realm","see_also":["loka","relative","Naraka"],"production_notes":null},{"definition":"A great amount.  ","word":"ream","see_also":["loka","relative","Naraka"],"production_notes":null},{"definition":"To cut for harvest. To gain as a result of effort.  ","word":"reap","see_also":["loka","relative","Naraka"],"production_notes":null},{"definition":"Resisting authority or any form of control.  ","word":"rebellious","see_also":["loka","relative","Naraka"],"production_notes":null},{"definition":"One who retreats from the world and lives in seclusion.  ","word":"recluse","see_also":["loka","relative","Naraka"],"production_notes":null},{"definition":"To settle or resolve, as a dispute. To make consistent or compatible, e.g., two conflicting ideas.  ","word":"reconcile (reconciliation)","see_also":["loka","relative","Naraka"],"production_notes":null},{"definition":"To harmonize quarrels or mend differences. A tithing reconciliation is a written accounting of income and tithing. ","word":"reconciliation","see_also":["loka","relative","Naraka"],"production_notes":null},{"definition":"To return to health or strength; recover.  ","word":"recuperate","see_also":["loka","relative","Naraka"],"production_notes":null},{"definition":"To recover, to set free from penalty or deliver from sin.  -- redemption: ","word":"redeem","see_also":["Act of redeeming","relative","Naraka"],"production_notes":null},{"definition":"Having or giving off fragrance.  ","word":"redolent","see_also":["Act of redeeming","relative","Naraka"],"production_notes":null},{"definition":"To come into a body again. To reincarnate.  ","word":"reembody","see_also":["Act of redeeming","relative","Naraka"],"production_notes":null},{"definition":"A regulated lifestyle system, such as diet, exercise, training, designed to achieve certain benefits.  ","word":"regimen","see_also":["Act of redeeming","relative","Naraka"],"production_notes":null},{"definition":"To go back; return to a previous state.  ","word":"regress","see_also":["Act of redeeming","relative","Naraka"],"production_notes":null},{"definition":"A spiritual healing system of laying on of hands, first popular in Japan.  ","word":"Reiki","see_also":["Act of redeeming","relative","Naraka"],"production_notes":null},{"definition":"To take birth in another body, having lived and died before.  ","word":"reincarnate","see_also":["Act of redeeming","relative","Naraka"],"production_notes":null},{"definition":"\"Re-entering the flesh.\" Punarjanma; metempsychosis. The process wherein souls take on a physical body through the birth process. Reincarnation is one of the fundamental principles of Hindu spiritual insight, shared by the mystical schools of nearly all religions, including Jainism, Sikhism, Buddhism (and even Christianity until condemned by the Nicene Council of 787). It is against the backdrop of this principle of the soul's enjoying many lives that other aspects of Hinduism can be understood. It is a repetitive cycle, known as punarjanma, which originates in the subtle plane (Antarloka), the realm in which souls live between births and return to after death. Here they are assisted in readjusting to the \"in-between\" world and eventually prepared for yet another birth. The quality and nature of the birth depends on the merit or demerit of their past actions (karma) and on the needs of their unique pattern of development and experience (dharma). The mother, the father and the soul together create a new body for the soul. At the moment of conception, the soul connects with and is irrevocably bound to the embryo. As soon as the egg is fertilized, the process of human life begins. It is during the mid-term of pregnancy that the full humanness of the fetus is achieved and the soul fully inhabits the new body, a stage which is acknowledged when the child begins to move and kick within the mother's womb. (Tirumantiram, 460: \"There in the pregnant womb, the soul lay in primordial quiescence [turiya] state. From that state, Maya [or Prakriti] and Her tribe aroused it and conferred consciousness and maya's evolutes eight -- desires and the rest. Thus say scriptures holy and true.\") Finally, at birth the soul emerges into earth consciousness, veiled of all memory of past lives and the inner worlds. The cycle of reincarnation ends when karma has been resolved and the Self God (Parashiva) has been realized. This condition of release is called moksha. Then the soul continues to evolve and mature, but without the need to return to physical existence. How many earthly births must one have to attain the unattainable? Many thousands to be sure, hastened by righteous living, tapas, austerities on all levels, penance and good deeds in abundance.  ","word":"reincarnation","see_also":["evolution of the soul","karma","moksha","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Quality or object which is meaningful only in relation to something else. Not absolute. -- relative reality: Maya. That which is ever changing and changeable. Describes the nature of manifest existence, indicating that it is not an illusion but is also not Absolute Reality, which is eternal and unchanging.  ","word":"relative","see_also":["Absolute Reality","maya","moksha","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Maya. That which is ever changing and changeable. Describes the nature of manifest existence, indicating that it is not an illusion, but is also not Absolute Reality, which is eternal and unchanging.  ","word":"relative reality","see_also":["Absolute","maya","moksha","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"To assign to an indistinct position, rank or class.  ","word":"relegate","see_also":["Absolute","maya","moksha","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"From Latin religare,\"to bind back.\" Any system of belief and worship of superhuman beings or powers and\/or of a Supreme Being or Power. Religion is a structured vehicle for soul advancement which often includes theology, scripture, spiritual and moral practices, priesthood and liturgy.  ","word":"religion","see_also":["Hinduism","maya","moksha","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"A member of a particular religion, or one who is excessively religious.  ","word":"religionist","see_also":["Hinduism","maya","moksha","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"To give up, let go of or abandon.  ","word":"relinquish","see_also":["sacrifice","tyaga","moksha","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Leftover; a surviving trace or vestige.  ","word":"remnant","see_also":["sacrifice","tyaga","moksha","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Deep, painful regret or guilt over a wrong one has done. Moral anguish.  ","word":"remorse","see_also":["absolution","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Distant, secluded; hidden away or difficult to reach.  ","word":"remote","see_also":["absolution","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"\"Rebirth\" or \"new birth.\" A renewal, revival or reawakening.  ","word":"renaissance","see_also":["absolution","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"To cause to be or to become.  ","word":"render","see_also":["absolution","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Famous.   ","word":"renowned","see_also":["absolution","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"A Vira Saiva philosopher and saint.  ","word":"Renukacharya","see_also":["absolution","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"One who has given up worldly life; a monk.  ","word":"renunciate","see_also":["sannyasin","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":null,"word":"renunciation","see_also":["sannyasa","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"The often indirect result or consequence of an action.  ","word":"repercussion","see_also":["sannyasa","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"To fill up or cause to be full again.  ","word":"replenish","see_also":["sannyasa","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"To rest peacefully.  -- to repose in one's realization:  To cease outward activity and enjoy communion with the Divine","word":"repose","see_also":["sannyasa","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"A place where things may be put or stored for safekeeping.  ","word":"repository","see_also":["sannyasa","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Experiences, desires or inner conflicts residing in the subconscious mind and hidden from the conscious mind. Suppressed desires.  ","word":"repressions","see_also":["sannyasa","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"To postpone punishment.  ","word":"reprieve","see_also":["sannyasa","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Public rejection of a condition, habit or way of being.   ","word":"repudiation","see_also":["sannyasa","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"To drive away, spurn.  ","word":"repulse","see_also":["sannyasa","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"To cancel or revoke.  ","word":"rescind","see_also":["sannyasa","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"To look like, or have similar qualities.  ","word":"resemble","see_also":["sannyasa","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"A feeling of ill-will, indignation or hostility from a sense of having been wronged.   ","word":"resent (resentment)","see_also":["sannyasa","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Remainder. That which is left over.  ","word":"residue","see_also":["sannyasa","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Radiance; brilliance.  ","word":"resplendence","see_also":["sannyasa","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Nervous, eager to go forward; hard to control.  ","word":"restive","see_also":["sannyasa","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"  ","word":"restraints","see_also":["yama-niyama","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"To pay back an injury like for like, to get even.  ","word":"retaliate","see_also":["yama-niyama","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Paying back an injury, returning like for like, hurt for hurt. Getting even; vengeance.   ","word":"retaliation","see_also":["yama-niyama","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"To slow, delay or impede progress.  ","word":"retard","see_also":["yama-niyama","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Applying back or operating prior to a particular time.  ","word":"retroactive","see_also":["yama-niyama","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"To fit new parts, terms or ideas to a pre-existing system.  ","word":"retrofit","see_also":["yama-niyama","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"A looking back on; thinking about the past.  ","word":"retrospect","see_also":["yama-niyama","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"The looking back or contemplating on past actions or events.  ","word":"retrospection","see_also":["yama-niyama","hri","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":null,"word":"revealing grace","see_also":["anugraha shakti","grace","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"A resounding or repeated result or consequence, like an echo.  ","word":"reverberation","see_also":["anugraha shakti","grace","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"To respect with love and devotion.  ","word":"revere","see_also":["anugraha shakti","grace","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"A state of abstract musing. Here, an intense and blissful state.  ","word":"reverie","see_also":["anugraha shakti","grace","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"\"Veda of verse (rik).\" The first and oldest of the four Veda corpora of revealed scriptures (shruti), including a hymn collection (Samhita), priestly explanatory manuals (Brahmanas), forest treatises (Aranyakas) elaborating on the Vedic rites, and philosophical dialogs (Upanishads). Like the other Vedas, the Rig Veda was brought to earth consciousness not all at once, but gradually, over a period of perhaps several thousand years. The oldest and core portion is the Samhita, believed to date back, in its oral form, as far as 8,000 years, and to have been written down in archaic Sanskrit some 3,000 years ago. It consists of more than 10,000 verses, averaging three or four lines (riks), forming 1,028 hymns (suktas), organized in ten books called mandalas. It embodies prayerful hymns of praise and invocation to the Divinities of nature and to the One Divine. They are the spiritual reflections of a pastoral people with a profound awe for the powers of nature, each of which they revered as sacred and alive. The rishis who unfolded these outpourings of adoration perceived a well-ordered cosmos in which dharma is the way of attunement with celestial worlds, from which all righteousness and prosperity descends. The main concern is man's relationship with God and the world, and the invocation of the subtle worlds into mundane existence. Prayers beseech the Gods for happy family life, wealth, pleasure, cattle, health, protection from enemies, strength in battle, matrimony, progeny, long life and happiness, wisdom and realization and final liberation from rebirth. The Rig Veda Samhita, which in length equals Homer's Iliad and Odyssey combined, is the most important hymn collection, for it lends a large number of its hymns to the other three Veda Samhitas (the Sama, Yajur and Atharva). Chronologically, after the Samhitas came the Brahmanas, followed by the Aranyakas, and finally the Upanishads, also called the Vedanta, meaning \"Veda's end.\"  ","word":"Rig Veda","see_also":["shruti","Vedas","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":null,"word":"Righama","see_also":["Kailasa Parampara","Vedas","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"A standing up for dharma, a show of angry displeasure on personal moral or religious principles, accompanied in its lower forms by a vain sense of superiority.  ","word":"righteous indignation","see_also":["Kailasa Parampara","Vedas","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Very strict or severe.  ","word":"rigorous","see_also":["Kailasa Parampara","Vedas","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"\"The remover of bondage\" is unique in that He holds a rose apple, goad, noose and His broken tusk. ","word":"Rinamochana Ganapati","see_also":["Kailasa Parampara","Vedas","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"An old and venerated sage or seer, often a visionary who sees beyond the present time. Often refers to the sages, many of whom were householders, who codified dharma thousands of years ago in India.   ","word":"rishi","see_also":["Kailasa Parampara","Vedas","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"An old and venerated sage or seer, often a visionary who sees beyond the present time. Often refers to the sages, many of whom were householders, who codified dharma thousands of years ago in India.   ","word":"rishi","see_also":["Kailasa Parampara","Vedas","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"The first known satguru of the Kailasa Parampara in recent history (ca 1770-1840) famous for having entered a teashop in a village near Bangalore where he sat down, entered into deep samadhi and did not move or speak for seven years. Streams of devotees came for his darshana. Their unspoken prayers and questions were mysteriously answered in dreams or in messages on paper that manifested in the air and floated down to the floor. One day he suddenly arose and left the village, later to pass his power to Siddhar Kadaitswami (1804-1891).  ","word":"Rishi from the Himalayas","see_also":["Kailasa Parampara","Vedas","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"\"Sacred order, cosmic law; truth.\"  ","word":"rita","see_also":["dharma","Vedas","penance","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"A religious ceremony.  ","word":"rite (or ritual)","see_also":["sacrament","sacrifice","samskara","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Sacraments marking crucial stages of life. As the Nandinatha Sutras indicate, rites of passage, sacraments or samskaras are special moments in life that are preciously guarded by all members of the community. Thus, tradition indicates certain restrictions as to who may attend, though those who do not attend may participate in preparations and receptions afterwards. Those who refrain from attending rites of passage include widows and widowers, brahmacharis and brahmacharinis and anyone who has been divorced. The reason is to protect the impressionable subconscious mind of those receiving the sacrament from the impressions of the possibilities of renunciation, widowhood and divorce. Funeral rites, however, are open to everyone, though a couple just married within the past year will stay away. Other important funeral customs are: 1) a son who would normally light the pyre for his parents will not if his wife is pregnant. Instead, a cousin or brother will take his place; 2) when a widow is at her husband's funeral rites, the other widows of the village gather around her, not the married couples. Note that if a widowed person remarries, he or she is no longer considered a widow or widower and may attend rites of passage with his or her new spouse. ","word":"rites of passage","see_also":["samskaras","sacrifice","samskara","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"\"Fit or proper season.\" Time of menses. Traditional ceremony marking a young woman's coming of age. Ritu kala thus means \"onset of puberty.\"  ","word":"ritu kala","see_also":["samskaras of adulthood","sacrifice","samskara","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"A religious ceremony conducted according to some prescribed order.  ","word":"ritual","see_also":["samskaras of adulthood","sacrifice","samskara","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"A competitor, someone coveting same or better accomplishment or position.  ","word":"rival","see_also":["samskaras of adulthood","sacrifice","samskara","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"To move about constantly far and wide with no permanent destination or plan.  ","word":"roam","see_also":["samskaras of adulthood","sacrifice","samskara","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"\"Learning by rote\" is a method of teaching where students memorize statements on a subject, but are not encouraged to do further analysis.  ","word":"rote","see_also":["samskaras of adulthood","sacrifice","samskara","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Roundness, plumpness. ","word":"rotundity","see_also":["samskaras of adulthood","sacrifice","samskara","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"\"Controller of terrific powers;\" or \"red, shining one.\" A name of Siva as the God of dissolution, the universal force of reabsorption. Rudra-Siva is revered both as the \"terrifying one\" and the \"lord of tears,\" for He wields and controls the terrific powers which may cause lamentation among humans.  ","word":"Rudra","see_also":["Nataraja","sacrifice","samskara","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"\"Eye of Rudra;\" or \"red-eyed.\" From rud, \"to cry,\" and aksha, meaning \"eye.\" Marble-sized, multi-faced,reddish-brown seeds from the Eleocarpus ganitrus, or blue marble tree, which are sacred to Siva and a symbol of His compassion for humanity. Garlands, rudraksha mala, of larger seeds are worn around the neck by monks; and nonmonastics, both men and women, often wear a single bead on a cord at the throat. Smaller beads (usually numbering 108) are strung together for japa (recitation). Indian legend records that God shed a tear when looking down upon the sorrowful plight of humanity. That tear fell to Earth and from it grew the first rudraksha tree. Thus its seeds are worn by Hindus as a symbol of Siva's love and compassion.  ","word":"rudraksha","see_also":["japa","mantra","samskara","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"\"Garland of Siva'stears.\" A strand of prayer beads, usually 108, to count the repetitions of a mantra. Ganesha's holding a japa mala reminds us all to perform our daily japa yoga.  ","word":"rudraksha mala","see_also":["rudraksha","mantra","samskara","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"Principal guru in the Amardaka order of Saiva monastics, about 775 in Ujjain, one of Saivism's holiest cities. The sect served as advisors to the king prior to the Muslim conquest around 1300.  ","word":"Rudrasambhu (Rudrashambhu)","see_also":["rudraksha","mantra","samskara","nonhuman birth","samsara","soul"],"production_notes":null},{"definition":"A little-known text dealing with worship.  ","word":"Rudrayamala Tantra","see_also":["rudraksha","mantra","samskara","nonhuman birth","samsara","soul"],"production_notes":null}],"results":120}