{"entries":[{"definition":"The last day of the week designated by the fourth Commandment as a day of worship and rest, observed by Jews and Christians.  ","word":"Sabbath","see_also":null,"production_notes":null},{"definition":"\"Sheath of sounds, or words.\" Vocabulary; a dictionary or glossary of terms.  ","word":"sabda kosha","see_also":null,"production_notes":null},{"definition":"Near the sacrum, a triangular bone at the base of the spine made up of five fused vertebrae which forms the lower part of the pelvis.  ","word":"sacral","see_also":null,"production_notes":null},{"definition":"1) Holy rite, especially one solemnized in a formal, consecrated manner which is a bonding between the recipient and God, Gods or guru. This includes rites of passage (samskara), ceremonies sanctifying crucial events or stages of life. 2) Prasada. Sacred substances, grace-filled gifts, blessed in sacred ceremony by a holy person- such as holy ash, kumkum and holy water.","word":"sacrament","see_also":["prasada","samskara"],"production_notes":null},{"definition":"Yajnopavita.  ","word":"sacred thread","see_also":["upanayana","samskara"],"production_notes":null},{"definition":"Yajna. 1) Presenting offerings to a Deity as an expression of homage and devotion. 2) Giving up something, often one's own possession, advantage or preference, to serve a higher purpose. The literal meaning of sacrifice is \"to make sacred,\" implying an act of worship. It is the most common translation of the term yajna, from the verb yuj, \"to worship.\" In Hinduism, all of life is a sacrifice -- called jivayajna, a giving of oneself -- through which comes true spiritual fulfillment. Tyaga, the power of detachment, is an essential quality of true sacrifice.  ","word":"sacrifice","see_also":["tyaga","yajna"],"production_notes":null},{"definition":"Sacred and secure from intrusion.  ","word":"sacrosanct","see_also":["tyaga","yajna"],"production_notes":null},{"definition":"\"Proper conduct; virtue, morality.\" It is embodied in the principles of dharma.  ","word":"sadachara","see_also":["dharma","pada","yama-niyama"],"production_notes":null},{"definition":"\"Ever-auspicious.\" A name of the Primal Soul, Siva, a synonym for Parameshvara, which is expressed in the physical being of the satguru. Sadashiva especially denotes the power of revealing grace, anugraha shakti, the third tattva, after which emerge Siva's other four divine powers. This fivefold manifestation or expression of God's activity in the cosmos is depicted in Hindu mantras, literature and art as the five-faced Sadashivamurti. Looking upward is Ishana, \"ruler\" (the power of revealment). Facing east is Tatpurusha, \"supreme soul\" (the power of obscuration). Westward-looking is Sadyojata, \"quickly birthing\" (the power of creation). Northward is Vamadeva, \"lovely, pleasing\" (the power of preservation). Southward is Aghora, \"nonterrifying\" (the power of reabsorption). The first four faces revealed the Vedas. The fifth face, Ishana, revealed the Agamas. These five are also called Sadashiva, the revealer; Maheshvara, the obscurer; Brahma, the creator; Vishnu, the preserver; and Rudra, the destroyer.  ","word":"Sadashiva","see_also":["grace","Parameshvara","Sadashiva","Siva","tattva"],"production_notes":null},{"definition":"\"Ever-auspicious.\" A name of the Primal Soul, Siva, a synonym for Parameshvara, which is expressed in the physical being of the satguru. Sadashiva especially denotes the power of revealing grace, anugraha shakti, the third tattva, after which emerge Siva's other four divine powers. This fivefold manifestation or expression of God's activity in the cosmos is represented in Hindu mantras, literature and art as the five-faced Sadashivamurti.  ","word":"Sadasiva","see_also":["Parameshvara","tattva","Sadashiva","Siva","tattva"],"production_notes":null},{"definition":"From sadh, \"going straight to the goal.\" A spiritual aspirant; a devotee who performs sadhana. A serious seeker who has undertaken spiritual disciplines, is usually celibate and under the guidance of a guru. He wears white and may be under simple vows, but is not a yogi or sannyasin. In Gurudeva's monastic communities, sadhakas, or postulants, abide by four vows -- obedience, humility, purity and confidence, which they renew every two years. ","word":"sadhaka","see_also":["sadhana","tattva","Sadashiva","Siva","tattva"],"production_notes":null},{"definition":"\"Effective means of attainment.\" Self-effort, spiritual discipline; the way. Religious or spiritual disciplines, such as puja, yoga, meditation, japa, fasting and austerity. The effect of sadhana is the building of willpower, faith and confidence in oneself and in God, Gods and guru. Sadhana harnesses and transmutes the instinctive-intellectual nature, allowing progressive spiritual unfoldment into the superconscious realizations and innate abilities of the soul. ","word":"sadhana","see_also":["pada","raja yoga","sadhana marga","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"Sadhana means \"leading straight to the goal,\" and marga means \"path\" or \"way.\" Coined by Siva Yogaswami to describe the way he urged serious aspirants to follow--a path of intense effort, spiritual discipline and consistent inner transformation, as opposed to theoretical and intellectual learning.  ","word":"sadhana marga","see_also":["pada","sadhana","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"Sadhana means \"leading straight to the goal,\" and marga means \"path\" or \"way.\" Coined by Siva Yogaswami to describe the way he urged serious aspirants to follow--a path of intense effort, spiritual discipline and consistent inner transformation, as opposed to theoretical and intellectual learning.  ","word":"sadhana marga","see_also":["pada","sadhana","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"\"Virtuous one; straight, unerring.\" A holy man dedicated to the search for God. A sadhu may or may not be a yogi or a sannyasin, or be connected in any way with a guru or legitimate lineage. Sadhus usually have no fixed abode and travel unattached from place to place, often living on alms. There are countless sadhus on the roads, byways, mountains, riverbanks, and in the ashramas and caves of India. They have, by their very existence, a profound, stabilizing effect on the consciousness of India and the world.  ","word":"sadhu","see_also":["vairagi","sadhana","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"Feminine counterpart of sadhu.  ","word":"sadhvi","see_also":["sadhu","sadhana","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"Sadyojyoti, along with Brihaspati of Central India (ca 850), is credited with the systematization of Saiva Siddhanta in Sanskrit. ","word":"Sadyojyoti","see_also":["sadhu","sadhana","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"An orange yellow, traditional color of the Hindu monk's vestments, said to derive from the mud of the Ganges which discolored their white robes.  ","word":"saffron","see_also":["sadhu","sadhana","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"Keen-minded, discerning, prudent, wise.  ","word":"sagacious","see_also":["sadhu","sadhana","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"A very wise, usually elder, man, highly respected for his wisdom, experience and judgment.  ","word":"sage","see_also":["sadhu","sadhana","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"Brahman \"God with qualities.\" Describes Siva's perfections of Satchidananda and Maheshvara, the Primal Soul and His Divine Mind -- that part of God which is divine, all-knowing, all-loving, all-powerful and omnipotent.  ","word":"Saguna Brahman","see_also":["Brahman","sadhana","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"\"Thousand-times writing discipline.\" The spiritual practice of writing a sacred mantra 1,008 times.  ","word":"sahasra lekhana sadhana","see_also":["Brahman","sadhana","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"\"Thousand-petaled lotus.\" Another name for the sahasrara, or crown, chakra. ","word":"sahasradala padma","see_also":["sahasrara chakra","chakra","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"\"Thousand-petal disc.\" Seventh chakra, located in the cranial chamber of the soul body. It is composed of 1,008 petals indicative of the God-powers of the Satchidananda state in which this chakra is awakened and fully functions.   ","word":"sahasrara chakra","see_also":["sahasrara chakra","chakra","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"A holy person. ","word":"saint","see_also":["Nayanar","chakra","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"\"Auspicious.\" Of or relating to Saivism or its adherents, of whom there are about 400 million in the world today. Same as Saivite.  ","word":"Saiva","see_also":["Saivism","chakra","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"The sectarian revealed scriptures of the Saivas. Strongly theistic, they identify Siva as the Supreme Lord, immanent and transcendent. They are in two main divisions: the 64 Kashmir Saiva Agamas and the 28 Saiva Siddhanta Agamas. The latter group are the fundamental sectarian scriptures of Saiva Siddhanta. Of these, ten are of the Sivabheda division and are considered dualistic: 1) Kamika, 2) Yogaja, 3) Chintya, 4) Karana, 5) Ajita, 6) Dipta, 7) Sukshma, 8) Sahasraka, 9) Amshumat and 10) Suprabheda. There are 18 in the Rudrabheda group, classed as dual-nondual: 11) Vijaya, 12) Nihshvasa, 13) Svayambhuva, 14) Anala, 15) Vira (Bhadra), 16) Raurava, 17) Makuta, 18) Vimala, 19) Chandrajnana (or Chandrahasa), 20) Mukhabimba (or Bimba), 21) Prodgita (or Udgita), 22) Lalita, 23) Siddha, 24) Santana, 25) Sarvokta (Narasimha), 26) Parameshvara, 27) Kirana and 28) Vatula (or Parahita). Rishi Tirumular, in his Tirumantiram, refers to 28 Agamas and mentions nine by name. Eight of these -- Karana, Kamika, Vira, Chintya, Vatula, Vimala, Suprabheda and Makuta -- are in the above list of 28 furnished by the French Institute of Indology, Pondicherry. The ninth, Kalottara, is presently regarded as an Upagama, or secondary text, of Vatula. The Kamika is the Agama most widely followed in Tamil Saiva temples, because of the availability of Aghorasiva's manual-commentary (paddhati) on it. Vira Saivites especially refer to the Vatula and Vira Agamas. The Saiva Agama scriptures, above all else, are the connecting strand through all the schools of Saivism. The Agamas themselves express that they are entirely consistent with the teachings of the Veda, that they contain the essence of the Veda, and must be studied with the same high degree of devotion.  ","word":"Saiva Agamas","see_also":["Agamas","Vedas","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":null,"word":"Saiva Atmartha Puja","see_also":["Seepuja","Vedas","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"Another name for Saivism.  ","word":"Saiva Dharma","see_also":["Saivism","Vedas","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"Saiva Siddhanta Church's Book of Discipline, detailing policies, membership rules and mission guidelines.  ","word":"Saiva Dharma Shastras","see_also":["Saivism","Vedas","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"\"Saiva path.\" Tamil term for Saivism.  ","word":"Saiva Neri","see_also":["Saivism","Vedas","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"\"Saivite religion.\"  ","word":"Saiva Samayam","see_also":["Saivism","Vedas","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"\"Final conclusions of Saivism.\" The most widespread and influential Saivite school today, predominant especially among the Tamil people of Sri Lanka and South India. It is the formalized theology of the divine revelations contained in the twenty-eight Saiva Agamas. The first known guru of the Shuddha (\"pure\") Saiva Siddhanta tradition was Maharishi Nandinatha of Kashmir (ca BCE 250), recorded in Panini's book of grammar as the teacher of rishis Patanjali, Vyaghrapada and Vasishtha. Other sacred scriptures include the Tirumantiram and the voluminous collection of devotional hymns, the Tirumurai, and the masterpiece on ethics and statecraft, the Tirukural. For Saiva Siddhantins, Siva is the totality of all, understood in three perfections: Parameshvara (the Personal Creator Lord), Parashakti (the substratum of form) and Parashiva (Absolute Reality which transcends all). Souls and world are identical in essence with Siva, yet also differ in that they are evolving. A pluralistic stream arose in the middle ages from the teachings of Aghorasiva and Meykandar. For Aghorasiva's school (ca 1150) Siva is not the material cause of the universe, and the soul attains perfect \"sameness\" with Siva upon liberation. Meykandar's (ca 1250) pluralistic school denies that souls ever attain perfect sameness or unity with Siva.  ","word":"Saiva Siddhanta","see_also":["Saivism","Vedas","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"\"Church of God Siva's Revealed Truth,\" founded in 1949 by Satguru Sivaya Subramuniyaswami.  ","word":"Saiva Siddhanta Church","see_also":["Saivism","Vedas","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"\"Church of God Siva's Revealed Truth,\" founded in 1949 by Satguru Sivaya Subramuniyaswami.  ","word":"Saiva Siddhanta Church (Saiva Siddhanta Dharmasabha)","see_also":["Saivism","Vedas","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"Ecclesiastical body of lifetime renunciate swamis of Saiva Siddhanta Church. This sangam was founded by Satguru Sivaya Subramuniyaswami in 1949.  ","word":"Saiva Siddhanta Yoga Order","see_also":["Saivism","Vedas","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"The philosophy of Siva Advaita.  ","word":"Saiva Vishishtadvaita","see_also":["Siva Advaita","Vedas","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"The religion followed by those who worship Siva as supreme God. Oldest of the four sects of Hinduism. The earliest historical evidence of Saivism is from the 8,000-year-old Indus Valley civilization in the form of the famous seal of Siva as Lord Pashupati, seated in a yogic pose. In the Ramayana, dated astronomically at 2000 BCE, Lord Rama worshiped Siva, as did his rival Ravana. Buddha in 624 BCE was born into a Saivite family, and records of his time speak of the Saiva ascetics who wandered the hills looking much as they do today. There are many schools of Saivism, six of which are Saiva Siddhanta, Pashupata Saivism, Kashmir Saivism, Vira Saivism, Siddha Siddhanta and Siva Advaita. They are based firmly on the Vedas and Saiva Agamas, and thus have much in common, including the following principal doctrines: 1) the five powers of Siva -- creation, preservation, destruction, revealing and concealing grace; 2) The three categories: Pati, pashu and pasha (\"God, souls and bonds\"); 3) the three bonds: anava, karma and maya; 4) the threefold power of Siva: icchha shakti, kriya shakti and jnana shakti; 5) the thirty-six tattvas, or categories of existence; 6) the need for initiation from a satguru; 7) the power of mantra; 8) the four padas (stages): charya (selfless service), kriya (devotion), yoga (meditation), and jnana (illumination); 9) the belief in the Panchakshara as the foremost mantra, and in rudraksha and vibhuti as sacred aids to faith; 10) the beliefs in satguru (preceptor), Sivalinga (object of worship) and sangama (company of holy persons).  ","word":"Saivism (Saiva)","see_also":["individual school entries","Saivism (six schools)","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"Through history Saivism has developed a vast array of lineages. Philosophically, six schools are most notable: Saiva Siddhanta, Pashupata Saivism, Kashmir Saivism, Vira Saivism, Siddha Siddhanta and Siva Advaita. Saiva Siddhanta first distinguished itself in the second century BCE through the masterful treatise of a Himalayan pilgrim to South India, Rishi Tirumular. It is Saivism's most widespread and influential school. Pashupata Saivism emerged in the Himalayan hills over 25 centuries ago. Ancient writings chronicle it as a Saiva ascetic yoga path whose most renowned guru was Lakulisa. Kashmir Saivism, a strongly monistic lineage, arose from the revelatory aphorisms of Sri Vasugupta in the tenth century. Vira Saivism took shape in India's Karnataka state in the 12th-century under the inspiration of Sri Basavanna. It is a dynamic, reformist sect, rejecting religious complexity and stressing each devotee's personal relationship with God. Siddha Siddhanta, also known as Gorakshanatha Saivism, takes its name from the writings of the powerful 10th-century yogi, Sri Gorakshanatha, whose techniques for Siva identity attracted a large monastic and householder following in North India and Nepal. Siva Advaita is a Saivite interpretation of the Vedanta Sutras, based on the writings of Srikantha, a 12th-century scholar who sought to reconcile the Upanishads with the Agamas.  ","word":"Saivism (six schools)","see_also":["individual school entries","Saivism (six schools)","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"A follower of Saivism; also an adjective for Saivism.  ","word":"Saivite","see_also":["individual school entries","Saivism (six schools)","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"Of or relating to Saivism or its adherents, of whom there are about 400 million in the world today.  ","word":"Saivite (Saiva)","see_also":["Saivism","Saivism (six schools)","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"  ","word":"Saivite saints","see_also":["Nayanar","Saivism (six schools)","spiritual unfoldment","spiritual unfoldment","tattva"],"production_notes":null},{"definition":"\"Stage of embodied being.\" (Tamil: avasthai.) In Saiva Siddhanta, the second of three stages of the soul's evolution, when it is engaged in the world through the senses as it first develops a mental, then emotional and astral body, and finally a physical body, entering the cycles of birth, death and rebirth under the veiling powers of karma and maya. Progress through sakala avastha is measured in three stages: 1) irul, \"darkness;\" when the impetus is toward pasha, knowledge and experience of the world (pasha-jnanam); 2) marul, \"confusion;\" caught between the world and God, the soul begins to turn within for knowledge of its own nature (pashu-jnanam); and 3) arul, \"grace,\" when the soul seeks to know God (Pati-jnanam); and receive His grace. ","word":"sakala avastha","see_also":["avastha","evolution of the soul","kevala avastha","shuddha avastha","tattva"],"production_notes":null},{"definition":"\"Friend's path.\"  ","word":"sakha marga","see_also":["attainment","pada","kevala avastha","shuddha avastha","tattva"],"production_notes":null},{"definition":"\"Ocular witness.\" Awareness, the witness consciousness of the soul. Known as nif in the mystical Natha language of Shum.  ","word":"sakshin","see_also":["awareness","consciousness(individual)","chit","Shum","soul"],"production_notes":null},{"definition":"\"Power, energy.\" Refers to the active power of Siva, popularly envisioned in the feminine form as a Goddess or devi--such as Parvati or Lakshmi. In Saiva Siddhanta, Siva's Divine Energy or Sakti is inseparable from Him. God Siva is perceived as a one Being, beyond yet encompassing the duality of male and female. When spelled Shakti, this term denotes impersonal forces such as Iccha (love), Kriya (action) and Jnana (wisdom), three Shaktis wielded by Siva.   ","word":"Sakti","see_also":["awareness","consciousness(individual)","chit","Shum","soul"],"production_notes":null},{"definition":"\"Descent of grace,\" occurring during the advanced stage of the soul's evolution called arul, at the end of the sakala avastha. Shaktinipata is twofold: the internal descent is recognized as a tremendous yearning for Siva; the outer descent of grace is the appearance of a satguru. At this stage, the devotee increasingly wants to devote himself to all that is spiritual and holy. Same as shaktipata.  ","word":"saktinipata","see_also":["arul","grace","sakala avastha","shaktipata","soul"],"production_notes":null},{"definition":"\"Descent of grace.\" Equivalent to shaktinipata. Guru diksha, initiation from the preceptor; particularly the first initiation, which awakens the kundalini and launches the process of spiritual unfoldment. ","word":"saktipata","see_also":["diksha","grace","kundalini","shaktinipata","soul"],"production_notes":null},{"definition":"\"Sharing the world\" of God. The first of four progressive attainments of the soul in Saiva Siddhanta. It comes as the fulfillment of religious duty, charya, well performed.  ","word":"salokya","see_also":["attainment","grace","kundalini","shaktinipata","soul"],"production_notes":null},{"definition":"Surya namaskara. A group of eight or more yoga asanas, postures, performed in methodic sequence in the morning while facing and saluting the sun. The sequence incorporates stretching and limbering exercises with controlled breathing and reverent concentration as a daily regimen for good health and as a preparation for meditation.  ","word":"salutations to the sun","see_also":["attainment","grace","kundalini","shaktinipata","soul"],"production_notes":null},{"definition":"\"Song of wisdom.\" Third of the four Vedas. Ninety percent of its 1,875 stanzas are derived from the Rig Veda. It is a collection of hymns specially arranged and notated for chanting with a distinctive melody and cadence by the Udgata priests during yajna, fire ceremony, together with stanzas from the Yajur Veda. This Veda represents the oldest known form of Indian music.  ","word":"Sama Veda","see_also":["Shruti","Vedas","kundalini","shaktinipata","soul"],"production_notes":null},{"definition":"\"Enstasy,\" which means \"standing within one's Self.\" \"Sameness; contemplation; union, wholeness; completion, accomplishment.\"Samadhi is the state of true yoga, in which the meditator and the object of meditation are one. Samadhi is of two levels. The first is savikalpa samadhi (\"enstasy with form\" or \"seed\"), identification or oneness with the essence of an object. Its highest form is the realization of the primal substratum or pure consciousness, Satchidananda. The second is nirvikalpa samadhi (\"enstasy without form\" or \"seed\"), identification with the Self, in which all modes of consciousness are transcended and Absolute Reality, Parashiva, beyond time, form and space, is experienced. This brings in its aftermath a complete transformation of consciousness. In Classical Yoga, nirvikalpa samadhi is known as asamprajnata samadhi, \"supraconscious enstasy\" -- samadhi, or beingness, without thought or cognition, prajna. Savikalpa samadhi is also called samprajnata samadhi, \"conscious enstasy.\" (Note that samadhi differs from samyama -- the continuous meditation on a subject or mystic key [such as a chakra] to gain revelation on that subject or area of consciousness. As explained by Patanjali, samyama consists of dharana, dhyana and samadhi.)  ","word":"samadhi","see_also":["enstasy","kundalini","Parashiva","raja yoga","samarasa","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Uniform; synchronous.\" The sixth of the seven chakras, or nadi conglomerates, above and within the sahasrara chakra.  ","word":"samana","see_also":["chakra","kundalini","Parashiva","raja yoga","samarasa","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"The second in the stages of the Path of Attainment in Buddhism, a continuation of dhyana (meditation), the first stage, leading through a progressive nullification of psychic, mental and emotional activity to a state which is perfect solitude, neither perception nor nonperception.  ","word":"samapatti","see_also":["chakra","kundalini","Parashiva","raja yoga","samarasa","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Even essence\" or \"same taste.\" In Siddha Siddhanta, a term describing the state attained by a yogi in which he consciously experiences the world and daily life while never losing his perspective of the essential unity of God, soul and world. Similar in concept to sayujya samadhi.  ","word":"samarasa","see_also":["jnana","kaivalya","samadhi","Siddha Siddhanta","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Returning home.\" The ceremony marking a youth's completion of Vedic studies.  ","word":"samavartana","see_also":["samskaras","kaivalya","samadhi","Siddha Siddhanta","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Religious teacher.\"  ","word":"Samayacharya","see_also":["Alvar","Nalvar","samadhi","Siddha Siddhanta","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Religion.\"  ","word":"samayam","see_also":["Alvar","Nalvar","samadhi","Siddha Siddhanta","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Child saint of the 7th-century Saivite renaissance. Composed many Devaram hymns in praise of Siva, reconverted at least one Tamil king who had embraced Jainism, and vehemently sought to counter the incursion of Buddhism, bringing the Tamil people back to Saivism.  ","word":"Sambandar","see_also":["Nalvar","Nayanar","Tirumurai","Siddha Siddhanta","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Dissolution; destruction.\"  ","word":"samhara","see_also":["mahapralaya","Nataraja","Tirumurai","Siddha Siddhanta","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Collection.\" 1) Any methodically arranged collection of texts or verses. 2) The hymn collection of each of the four Vedas. 3) A common alternate term for Vaishnava Agamas.  ","word":"samhita","see_also":["Vedas","Nataraja","Tirumurai","Siddha Siddhanta","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Nearness\" to God. The second of four progressive attainments of the soul in Saiva Siddhanta. It is the fruition of religious worship and surrender, the kriya pada. ","word":"samipya","see_also":["attainment","Nataraja","Tirumurai","Siddha Siddhanta","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Tradition.\" Sampradaya can be understood in two ways. First, it refers to an oral tradition of teaching, such as a Guru of an established lineage verbally passing on eternal truths to his sishiya. Second, it refers to an established historical lineage, a living stream of tradition or theology within Hinduism.   ","word":"sampradaya","see_also":["attainment","Nataraja","Tirumurai","Siddha Siddhanta","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Tradition.\" Sampradaya can be understood in two ways. First, it refers to an oral tradition of teaching, such as a Guru of an established lineage verbally passing on eternal truths to his sishiya. Second, it refers to an established historical lineage, a living stream of tradition or theology within Hinduism.   ","word":"sampradaya","see_also":["attainment","Nataraja","Tirumurai","Siddha Siddhanta","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Flow.\" The phenomenal world. Transmigratory existence, fraught with impermanence and change. The cycle of birth, death and rebirth; the total pattern of successive earthly lives experienced by a soul. A term similar to punarjanma (reincarnation), but with broader connotations.  ","word":"samsara","see_also":["evolution of the soul","karma","punarjanma","reincarnation","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"One in samsara;\" \"wanderer.\"A soul during transmigration, immersed in or attached to mundane existence, hence not striving for liberation (moksha). A samsari is someone who is not \"on the path.\"  ","word":"samsari","see_also":["materialism","samsara","San Marga","worldly","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Impression, activator; sanctification, preparation.\" 1) The imprints left on the subconscious mind by experience (from this or previous lives), which then color all of life, one's nature, responses, states of mind, etc. 2) A sacrament or rite done to mark a significant transition of life. These make deep and positive impressions on the mind of the recipient, inform the family and community of changes in the lives of its members and secure inner-world blessings. The numerous samskaras are outlined in the Grihya Shastras. Most are accompanied by specific mantras from the Vedas.  ","word":"samskara","see_also":["mind (five states)","sacrament","San Marga","worldly","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"The subconscious mind, holder of past impressions, reactions and desires. Also the seat of the involuntary physiological processes.  ","word":"samskara chitta","see_also":["mind (fivestates)","sacrament","San Marga","worldly","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"From coming-of-age to marriage. --ritukala: \"Fit or proper season.\" Time of menses. A home blessing marking the coming of age for girls. --keshanta: Marking a boy's first beard-shaving, at about 16 years. Both of the above are home ceremonies in which the young ones are reminded of their brahmacharya, given new clothes and jewelry and joyously admitted into the adult community as young adults. --nishchitartha \"Settlement of aim.\" Also called vagdana, \"word-giving.\" A formal engagement or betrothal ceremony in which a couple pledge themselves to one another, exchanging rings and other gifts. --vivaha: Marriage.\" An elaborate and joyous ceremony performed in presence of God and Gods, in which the homa fire is central. ","word":"samskaras of adulthood","see_also":["samskara","sacrament","San Marga","worldly","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"From the rite of conception to the blessings of the new-born child. --garbhadhana: \"Womb-placing.\" Rite of conception, where physical union is consecrated with the intent of bringing into physical birth an advanced soul. --punsavana: \"Male rite; bringing forth a male.\" A rite performed during the third month of pregnancy consisting of prayers for a son and for the well-being of mother and child. --simantonnayana: \"Hair-parting.\" A ceremony held between the fourth and seventh months in which the husband combs his wife's hair and expresses his love and support. --jatakarma: \"Rite of birth.\" The father welcomes and blesses the new-born child and feeds it a taste of ghee and honey.  ","word":"samskaras of birth","see_also":["samskara","sacrament","San Marga","worldly","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"From naming to education. --namakarana: \"Name-giving\" and formal entry into one or another sect of Hinduism, performed 11 to 41 days after birth. The name is chosen according to astrology, preferably the name of a God or Goddess. At this time, guardian devas are assigned to see the child through life. One who converts to or adopts Hinduism later in life would receive this same sacrament. --annaprashana: \"Feeding.\"The ceremony marking the first taking of solid food, held at about six months. (Breast-feeding generally continues). --karnavedha: \"Ear-piercing.\" The piercing of both ears, for boys and girls, and the inserting of gold earrings, held during the first, third or fifth year. --chudakarana: \"Head-shaving.\" The shaving of the head, for boys and girls, between the 31st day and the fourth year. --vidyarambha: Marks the beginning of formal education. The boy or girl ceremoniously writes his\/her first letter of the alphabet in a tray of uncooked rice. --upanayana: Given to boys at about 12 years of age, marks the beginning of the period of brahmacharya and formal study of scripture and sacred lore, usually with an acharya or guru. --samavartana: Marks the end of formal religious study. ","word":"samskaras of childhood","see_also":["samskara","earrings","San Marga","worldly","Sivasayujya","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"--vanaprastha ashrama: Age 48 marks the entrance into the elder advisor stage, celebrated in some communities by special ceremony. --sannyasa ashrama vrata: The advent of withdrawal from social duties and responsibilities at age 72 is sometimes ritually acknowledged (different from sannyasa diksha). --antyeshti: The various funeral rites performed to guide the soul in its transition to inner worlds, including preparation of the body, cremation, bone-gathering, dispersal of ashes, home purification. ","word":"samskaras of later life","see_also":["sannyasa dharma","cremation","death","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Constraint.\" Continuous meditation on a single concept to gain revelation on a particular subject or area of consciousness. Cognizantability defines it as focusing the mind on three facts or points about the subject of meditation. As explained by Sage Patanjali in his Yoga Sutras, samyama consists of dharana, dhyana and samadhi.  ","word":"samyama","see_also":["dharana","dhyana","raja yogasamadhi","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"True path.\" A term especially important in Saiva Siddhanta. 1) In general, the straight spiritual path leading to the ultimate goal, Self Realization, which does not detour into unnecessary psychic exploration or pointless development of siddhis. San Margi names a person who is \"on the path,\" as opposed to samsari, one engrossed in worldliness. 2) San Marga is also an alternate term for the jnana pada.  ","word":"San Marga","see_also":["iberation","pada","raja yogasamadhi","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"A meditation tirtha founded by Satguru Sivaya Subramuniyaswami at the foot of the extinct volcano, Mount Waialeale, on Hawaii's Garden Island, Kauai, site of the Iraivan Temple. ","word":"San Marga Sanctuary","see_also":["iberation","pada","raja yogasamadhi","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"A meditation tirtha founded by Satguru Sivaya Subramuniyaswami at the foot of the extinct volcano, Mount Waialeale, on Hawaii's Garden Island, Kauai, site of the Iraivan Temple. ","word":"San Marga Sanctuary","see_also":["iberation","pada","raja yogasamadhi","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Eternal religion\" or \"Everlasting path.\" It is a traditional designation for the Hindu religion.  ","word":"Sanatana Dharma","see_also":["Hinduism","pada","raja yogasamadhi","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Of the eternal.\" A Hindu, a follower of the eternal path. ","word":"Sanatani","see_also":["Hinduism","pada","raja yogasamadhi","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Ever-youthful;\" perpetual virgin boy. A name of God Murugan. Also one of the eight disciples of Maharishi Nandinatha.  ","word":"Sanatkumara","see_also":["Kailasa Parampara","Karttikeya","raja yogasamadhi","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Accumulated action.\" The accumulated consequence of an individual's actions in this and past lives.  ","word":"sanchita karma","see_also":["karma","Karttikeya","raja yogasamadhi","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"  ","word":"sanctified waters","see_also":["pada puja","prasada","ucchhishta","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"To make sacred or holy.  ","word":"sanctify","see_also":["pada puja","prasada","ucchhishta","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Authoritative permission or approval.  ","word":"sanction","see_also":["pada puja","prasada","ucchhishta","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Holy of holies.\" Garbhagriha. The most sacred part of a temple, usually a cave-like stone chamber, in which the main icon is installed.  ","word":"sanctum sanctorum","see_also":["darshana","garbhagriha","temple","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Chandana. The Asian evergreen tree Santalum album. Its sweetly fragrant heartwood is ground into the fine, tan-colored paste distributed as prasada in Saivite temples and used for sacred marks on the forehead, tilaka. Sandalwood is also prized for incense, carving and fine cabinetry.   ","word":"sandalwood","see_also":["darshana","garbhagriha","temple","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Worship at time's junctures.\" Drawing near to God at the changes of time -- worship and sadhana performed in the home at dawn, noon and dusk.  ","word":"sandhya upasana","see_also":["sadhana","garbhagriha","temple","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Association; fellowship.\" (Tamil: Sangam) Coming together in a group, especially for religious purposes.  ","word":"sanga","see_also":["sadhana","garbhagriha","temple","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Association; fellowship.\" (Tamil: sangam) Coming together in a group, especially for religious purposes. Also a town in Karnataka, South India, where the Krishna and Malaprabha rivers meet; an ancient center of Kalamukha Saivism where the Vira Saivite preceptor Basavanna lived and studied as a youth.  ","word":"sangama","see_also":["congregational worship","garbhagriha","temple","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"An institution for the rest and care of invalids and convalescents.  ","word":"sanitarium","see_also":["congregational worship","garbhagriha","temple","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":" \"Will; purpose; determination.\" A solemn vow or declaration of purpose to perform any ritual observance. Most commonly, sankalpa names the mental and verbal preparation made by a temple priest as he begins rites of worship. During the sankalpa, he proclaims to the three worlds what he is about to do. He intones the name of the Deity, the type of ritual he is about to perform and the present time and place according to precise astrological notations. Once the sankalpa is made, he is bound to complete the ceremony.  ","word":"sankalpa","see_also":["puja","garbhagriha","temple","bone-gathering","samskara","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Conferring happiness;\" \"propitious.\" A name of Siva. Also one of Hinduism's most extraordinary monks, Adi Sankara (788 -- 820), preeminent guru of the Smarta Sampradaya, noted for his monistic philosophy (Advaita Vedanta), his many scriptural commentaries, and his formalizing of ten orders of sannyasins with pontifical headquarters at strategic points across India. He lived only 32 years, but traveled throughout India and transformed the Hindu world of that time.  ","word":"Sankara (Shankara)","see_also":["Dashanami","Shankaracharya pitha","shanmata sthapanacharya","Smarta Sampradaya","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"One of Hinduism's most extraordinary monks (788-820) and pre-eminent guru of the Smarta Sampradaya. He is noted for his monistic philosophy of Advaita Vedanta and his many scriptural commentaries. ","word":"Sankara (Shankara), Adi","see_also":["Advaita Siddhanta","Vedanta","shanmata sthapanacharya","Smarta Sampradaya","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Dispeller of sorrow,\" seated on a red lotus flower, holds a bowl of pudding and displays varada mudra. ","word":"Sankatahara Ganapati","see_also":["Advaita Siddhanta","Vedanta","shanmata sthapanacharya","Smarta Sampradaya","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Enumeration, reckoning.\"  ","word":"Sankhya","see_also":["prakriti","purusha","shad darshana","tattva","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Nearness; proximity; provost; taking charge of.\" A title of heads of monasteries: Guru Mahasannidhana.  ","word":"sannidhana","see_also":["sannidhya","purusha","shad darshana","tattva","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"(Divine) presence; nearness, proximity.\" The radiance and blessed presence of shakti within and around a temple or a holy person.  ","word":"sannidhya","see_also":["sannidhya","purusha","shad darshana","tattva","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"(Divine) presence; nearness, proximity.\" The radiance and blessed presence of shakti within and around a temple or a holy person.  ","word":"sannidhya","see_also":["sannidhya","purusha","shad darshana","tattva","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Renunciation.\" \"Throwing down\" or \"abandoning.\" Sannyasa is the repudiation of the dharma, including the obligations and duties, of the householder and the assumption of the even more demanding dharma of the renunciate. The ancient shastras recognize four justifiable motivations for entering into sannyasa: vidvat, vividisha, markata and atura. Vidvat (\"knowing; wise\") sannyasa is the spontaneous withdrawal from the world in search for Self Realization which results from karma and tendencies developed in a previous life. Vividisha (\"discriminating\") sannyasa is renunciation to satisfy a yearning for the Self developed through scriptural study and practice. Markata sannyasa is taking refuge in sannyasa as a result of great sorrow, disappointment or misfortune in worldly pursuits. (Markata means \"monkey-like,\" perhaps implying the analogy of a monkey clinging to its mother.) Atura (\"suffering or sick\") sannyasa is entering into sannyasa upon one's deathbed, realizing that there is no longer hope in life. ","word":"sannyasa","see_also":["sannyasa dharma","sannyasa diksha","shad darshana","tattva","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Renunciate stage.\" The period of life after age 72.  ","word":"sannyasa ashrama","see_also":["ashrama","sannyasa diksha","shad darshana","tattva","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Renunciate virtue.\" The life, way and traditions of those who have irrevocably renounced prerogatives and obligations of the householder, including personal property, wealth, ambitions, social position and family ties, in favor of the full-time monastic quest for divine awakening, Self Realization and spiritual upliftment of humanity. Traditionally, this dharma is available to those under age 25 who meet strict qualifications. Alternately, the householder may embrace sannyasa dharma after age 72 through the customary initiatory rites given by a sannyasin and then diligently pursuing his spiritual sadhana in a state of genuine renunciation and not in the midst of his family. These two forms of sannyasa are not to be confused with simply entering the sannyasa ashrama, the last stage of life.  ","word":"sannyasa dharma","see_also":["sannyasa","sannyasa diksha","sannyasin","videhamukti","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Renunciate virtue.\" The life, way and traditions of those who have irrevocably renounced prerogatives and obligations of the householder, including personal property, wealth, ambitions, social position and family ties, in favor of the full-time monastic quest for divine awakening, Self Realization and spiritual upliftment of humanity. Traditionally, this dharma is available to those under age 25 who meet strict qualifications. Alternately, the householder may embrace sannyasa dharma after age 72 through the customary initiatory rites given by a sannyasin and then diligently pursuing his spiritual sadhana in a state of genuine renunciation and not in the midst of his family. These two forms of sannyasa are not to be confused with simply entering the sannyasa ashrama, the last stage of life.  ","word":"sannyasa dharma","see_also":["sannyasa","sannyasa diksha","sannyasin","videhamukti","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Renunciate initiation.\" This diksha is a formal rite, or less often an informal blessing, entering the devotee into renunciate monasticism, binding him for life to certain vows which include chastity, poverty and obedience, and directing him on the path to Self Realization. Strictest tradition requires that lifetime renunciates be single men and that they enter training in their order before age 25. However, there are certain orders which accept men into sannyasa after age 25, provided they have been in college and not in the world after that time. Others will accept widowers; and a few initiate women. Such rules and qualifications apply primarily to cenobites, that is, to those who will live and serve together in an ashrama or monastery. The rules pertaining to homeless anchorites are, for obvious reasons, more lenient.  ","word":"sannyasa diksha","see_also":["sannyasa dharma","videhamukti","sannyasin","videhamukti","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Renunciate initiation.\" This diksha is a formal rite, or less often an informal blessing, entering the devotee into renunciate monasticism, binding him for life to certain vows which include chastity, poverty and obedience, and directing him on the path to Self Realization. Strictest tradition requires that lifetime renunciates be single men and that they enter training in their order before age 25. However, there are certain orders which accept men into sannyasa after age 25, provided they have been in college and not in the world after that time. Others will accept widowers; and a few initiate women. Such rules and qualifications apply primarily to cenobites, that is, to those who will live and serve together in an ashrama or monastery. The rules pertaining to homeless anchorites are, for obvious reasons, more lenient.  ","word":"sannyasa diksha","see_also":["sannyasa dharma","videhamukti","sannyasin","videhamukti","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"An Upanishad of the Atharva Veda. It deals with the transition to the vanaprastha and sannyasa ashramas.  ","word":"Sannyasa Upanishad","see_also":["sannyasa dharma","videhamukti","sannyasin","videhamukti","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Renouncer.\" One who has taken sannyasa diksha. A Hindu monk, swami, and one of a world brotherhood (or holy order) of sannyasins. Some are wanderers and others live in monasteries. The seasoned sannyasin is truly the liberated man, the spiritual exemplar, the disciplined yogi and ultimately the knower of Truth, freed to commune with the Divine and bound to uplift humanity through the sharing of his wisdom, his peace, his devotion and his illumination, however great or small. The sannyasin is the guardian of his religion, immersed in it constantly, freed from worldliness, freed from distraction, able to offer his work and his worship in unbroken continuity and one-pointed effectiveness. He undertakes certain disciplines including the purification of body, mind and emotion. He restrains and controls the mind through his sadhana, tapas and meditative regimen. He unfolds from within himself a profound love of God and the Gods. His practice of upasana, worship, is predominantly internal, seeking God Siva within.  ","word":"sannyasin","see_also":["sannyasa","sannyasa dharma","sannyasa diksha","swami","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Well-made, perfected.\" The classical sacerdotal or religious language of ancient India, considered an excellent vehicle of divine communication. Employed today as a religious, literary and scholarly language, but not generally used as a spoken language.  ","word":"Sanskrit","see_also":["sannyasa","sannyasa dharma","sannyasa diksha","swami","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Well-made;\" \"refined,\" \"perfected.\" The classical sacerdotal language of ancient India, considered a pure vehicle for communication with the celestial worlds. It is the primary language in which Hindu scriptures are written, including the Vedas and Agamas. Employed today as a liturgical, literary and scholarly language, but no longer used as a spoken vernacular.  ","word":"Sanskrit (Samskrita)","see_also":["sannyasa","sannyasa dharma","sannyasa diksha","swami","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Saint.\" A Hindi or vernacular word derived from the Sanskrit sat, meaning \"true; real; virtuous.\"  ","word":"sant","see_also":["sannyasa","sannyasa dharma","sannyasa diksha","swami","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Contentment.\"  ","word":"santosha","see_also":["yama-niyama","sannyasa dharma","sannyasa diksha","swami","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"A clear, hard gemstone, usually blue.  ","word":"sapphire","see_also":["yama-niyama","sannyasa dharma","sannyasa diksha","swami","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Seven inner-plane masters who help guide the karmas of mankind.  ","word":"sapta rishis","see_also":["yama-niyama","sannyasa dharma","sannyasa diksha","swami","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Seven inner-plane masters who help guide the karmas of mankind.  ","word":"sapta rishis","see_also":["yama-niyama","sannyasa dharma","sannyasa diksha","swami","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"The flowing one.\" Shakti, the Universal Mother; Goddess of the arts and learning, mythological consort of the God Brahma. Sarasvati, the river Goddess, is usually depicted wearing a white sari and holding a vina, sitting upon a swan or lotus flower. Prayers are offered to her for refinements of art, culture and learning. Sarasvati also names one of seven sacred rivers (Sapta Sindhu) mentioned in the Rig Veda. Parts of the Indus Valley civilization thrived along the river until it dried up in 1900BCE. Its course was lost and thought a myth by some until recently discovered in images taken by a French satellite. In addition, one of the ten Dashanami swami orders is the Sarasvati. ","word":"Sarasvati","see_also":["Goddess","Shakti","sannyasa diksha","swami","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Thicket of reeds.\" The mantra which calls upon Lord Karttikeya, son of God Siva and guardian of the spiritual quest, who arose from Sharavana, the sacred lake of primal consciousness. Its mirror-like surface symbolizes a quieted, peaceful mind. This mantra is prescribed for Saivites not yet initiated by a satguru into the divine Panchakshara Mantra, Namah Sivaya. ","word":"Saravanabhava","see_also":["Karttikeya","PanchaksharaMantra","sannyasa diksha","swami","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"(Hindi) The traditional outer garment of a Hindu woman, consisting of a long, unstitched piece of cloth, usually colorful cotton or silk, wrapped around the body, forming an ankle-length skirt, and around the bosom and over the shoulder.  ","word":"sari","see_also":["Karttikeya","PanchaksharaMantra","sannyasa diksha","swami","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Body; husk.\" Three bodies of the soul: 1) sthula sharira, \"gross or physical body\" (also called annamaya kosha), the odic body; 2) sukshma sharira, \"subtle body\" (also called linga sharira, it includes the pranamaya, manomaya and vijnanamaya koshas); 3) karana sharira, \"causal body\" (also called anandamaya kosha), the actinic causal body. Another term for body is deha.  ","word":"sarira","see_also":["kosha","subtlebody","sannyasa diksha","swami","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Likeness\"to God. The third of the four progressive attainments of the soul in Saiva Siddhanta. It is the culmination of the yoga pada. ","word":"sarupya","see_also":["attainment","subtlebody","sannyasa diksha","swami","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"All is auspicious; the goodness of all.\" Bhadra indicates that which is \"blessed, auspicious, dear, excellent.\" Sarva (\"all\") bhadra thus denotes the cognition that everything in the universe is a manifestation of Divinity, that it is holy, good and purposeful.  ","word":"sarvabhadra","see_also":["auspiciousness","grace","Sivamaya","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"All living beings.\"  ","word":"sarvabhuta","see_also":["auspiciousness","grace","Sivamaya","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"For all times.\"  ","word":"sarvada","see_also":["auspiciousness","grace","Sivamaya","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"This text is not among the traditional list of Agamas and subsidiary scriptures. But it is thought to be a second version of Kalajnanam, a subsidiary text of Vatula Agama. The extant sections deal with right knowledge.  ","word":"Sarvajnanottara Agama","see_also":["auspiciousness","grace","Sivamaya","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"All is Siva.\" One of the four great sayings capsulizing the teachings of Siva Yogaswami.  ","word":"Sarvam Sivamayam","see_also":["auspiciousness","grace","Sivamaya","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Pure being or existence.   ","word":"Sat","see_also":["auspiciousness","grace","Sivamaya","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Pure being or existence.   ","word":"sat","see_also":["auspiciousness","grace","Sivamaya","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"True remover of darkness.\" A spiritual preceptor of the highest attainment, one who has realized the ultimate Truth and is able to lead others securely along the spiritual path.   ","word":"Sat Guru","see_also":["auspiciousness","grace","Sivamaya","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Age of Truth,\" also called Krita, \"accomplished, good, cultivated, kind action; the winning die cast of four dots.\" The first in the repetitive cycle of yugas, lasting 1,728,000 years, representing the brightest time, when the full light of the Central Sun permeates Earth. ","word":"Sat Yuga (Satya Yuga)","see_also":["yuga","grace","Sivamaya","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"The devil; evil personified. A being who in Christian and other Semitic religions opposes God's will and tempts souls into wickedness. In Hinduism, all is seen as the manifestation of God, and there is no Satan.  ","word":"Satan","see_also":["asura","hell","Naraka","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Existence-consciousness-bliss.\" A synonym for Parashakti. Lord Siva's Divine Mind and simultaneously the pure superconscious mind of each individual soul. Satchidananda is perfect love and omniscient, omnipotent consciousness, the fountainhead of all existence, yet containing and permeating all existence. Also called pure consciousness, pure form, substratum of existence, and more. One of the goals of the meditator or yogi is to experience the natural state of the mind, Satchidananda, holding back the vrittis through yogic practices. In Advaita Vedanta, Satchidananda is considered a description of the Absolute (Brahman). Whereas in monistic, or shuddha, Saiva Siddhanta it is understood as divine form -- pure, amorphous matter or energy -- not as an equivalent of the Absolute, formless, \"atattva,\" Parashiva. In this latter school, Parashiva is radically transcendent, and Satchidananda is known as the primal and most perfectly divine form to emerge from the formless Parashiva.  ","word":"Satchidananda (satchitananda)","see_also":["atattva","Parashakti","tattva","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"True weighty one.\" A spiritual preceptor of the highest attainment and authority -- one who has realized the ultimate Truth, Parashiva, through nirvikalpa samadhi -- a jivanmukta able to lead others securely along the spiritual path. He is always a sannyasin, an unmarried renunciate. All Hindu denominations teach that the grace and guidance of a living satguru is a necessity for Self Realization. He is recognized and revered as the embodiment of God, Sadashiva, the source of grace and of liberation. ","word":"satguru (sadguru)","see_also":["guru bhakti","guru","guru-shishya system","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":null,"word":"Satguru Purnima","see_also":["Guru Purnima","guru","guru-shishya system","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Lord and true guru.\" A highly respectful and honorific term for one's preceptor.  ","word":"satgurunatha","see_also":["satguru","guru","guru-shishya system","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Holy gathering.\" Association of devotees for temple or home worship, celebration, selfless service and religious studies.  ","word":"satsanga","see_also":["satguru","guru","guru-shishya system","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Perfection of Being.\" The quality of goodness or purity.  ","word":"sattva guna","see_also":["guna","guru","guru-shishya system","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Perfection of Being.\" The quality of goodness or purity.  ","word":"sattvaguna","see_also":["guna","guru","guru-shishya system","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Of illumination, purity, truth.\" Sattva is the most subtle of the three gunas or fundamental cosmic qualities of nature as described in the Samkhya system--tamas (inertia), rajas (activity) and sattva (illumination, purity). The sattva guna is rarified, translucent, pervasive, reflecting the light of pure consciousness.  ","word":"sattvic","see_also":["guna","guru","guru-shishya system","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Truthfulness.\" Among the traditional yamas, ethical restraints, satya means to refrain from lying, deception or betraying promises and confidences.  ","word":"satya","see_also":["yama-niyama","guru","guru-shishya system","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Sacred syllable of truth.\" Aum.  ","word":"Satya Mantra","see_also":["Aum","guru","guru-shishya system","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Plane of reality, truth.\" Also called Brahmaloka; the realm of sahasrara chakra, it is the highest of the seven upper worlds.  ","word":"Satyaloka","see_also":["loka","guru","guru-shishya system","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Purity.\" Saucha means to avoid impurity in body, mind and speech, and is one of the traditional yamas, ethical restraints, of ashtanga yoga. (In Sage Patanjali's list of five yamas and five niyamas, saucha is among the niyamas.)   ","word":"saucha","see_also":["loka","guru","guru-shishya system","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Benevolence, causing gladness or cheerfulness of mind, right understanding (related to the term soma).\"  ","word":"saumanasya","see_also":["chakra","guru","guru-shishya system","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"A learned person; a scholar.  ","word":"savant","see_also":["chakra","guru","guru-shishya system","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Enstasy with form (or seed).\"  ","word":"savikalpa samadhi","see_also":["enstasy","raja yoga","samadhi","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"A person or God who saves another from harm or loss, especially by divine intervention or grace without any efforton the beneficiary's part.  ","word":"savior","see_also":["enstasy","raja yoga","samadhi","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"Union\" with God. The highest of the four attainments of the soul in Saiva Siddhanta. The state of jnana.  ","word":"sayujya","see_also":["attainment","Sivasayujya","vishvagrasa","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"A strong to vivid red or reddish orange.  ","word":"scarlet","see_also":["attainment","Sivasayujya","vishvagrasa","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Rajadanda. The staff and insignia of royal or imperial authority and power held by spiritual monarchs or kings. Traditionally, the scepters of Indian kings are prepared and empowered by respected heads of traditional Hindu religious orders through esoteric means.  ","word":"scepter","see_also":["danda","Sivasayujya","vishvagrasa","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"A separation, a break into factions.  ","word":"schism","see_also":["danda","Sivasayujya","vishvagrasa","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Sparkling or shining.  ","word":"scintillating","see_also":["danda","Sivasayujya","vishvagrasa","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"A person who writes things down, especially as dictated by another or copied.  ","word":"scribe","see_also":["danda","Sivasayujya","vishvagrasa","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"\"A writing.\" Sacred text or holy book(s) authoritative for a given sect or religion.  ","word":"scripture (scriptural)","see_also":["shastra","smriti","shruti","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Carefully examine or inspect in detail.  ","word":"scrutinize","see_also":["shastra","smriti","shruti","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Close, careful examination or study.  ","word":"scrutiny","see_also":["shastra","smriti","shruti","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Isolated; hidden. Kept apart from others.  ","word":"secluded (seclusion)","see_also":["muni","smriti","shruti","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"The astral or subtle plane. Here the soul continues its activities in the astral body during sleep and after the physical body dies. It is the in-between world which includes the Devaloka and the Narakaloka. The Second world exists \"within\" the First World or physical plane. ","word":"Second World","see_also":["three worlds","smriti","shruti","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"The process in which a gland, tissue, etc., produces a moist substance, such as bile, pancreatic juice or perspiration. Also refers to the substances thus produced.  ","word":"secretion","see_also":["three worlds","smriti","shruti","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"A group of adherents who form a smaller association withing a larger (often religious) body. A religious denomination.  ","word":"sect","see_also":["three worlds","smriti","shruti","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Avidly devoted to the beliefs and practices of a specific religious tradition, sometimes dogmatically and with condescension toward other traditions.  ","word":"sectarian","see_also":["three worlds","smriti","shruti","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Not sacred or religious; temporal or worldly.  ","word":"secular","see_also":["three worlds","smriti","shruti","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"A system that rejects religious faith and worship and holds that one need not look beyond man for life's ethical meaning. ","word":"secular humanism","see_also":["three worlds","smriti","shruti","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Dormant or anarabdha karma. All past actions which have not yet sprouted.  ","word":"seed  karma","see_also":["karma","smriti","shruti","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"The root or original experience of a particular type or range of experience impressed deeply in the subconscious mind to which other vibrations in a similar frequency range have been added to construct a subsubconscious complex. The seed experience is the experience which must be cognized for subsequent related experiences (subconscious dross) of similar vibration to release their hold and the complex to be resolved.  ","word":"seed experience","see_also":["karma","smriti","shruti","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Dormant or anarabdha karma. All past actions which have not yet \"sprouted.\"  ","word":"seed karma","see_also":["karma","smriti","shruti","world","Vedanta","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Visionary; rishi. A wise being or mystic who sees beyond the limits of ordinary perception.  ","word":"seer","see_also":["akasha","clairvoyance","muni","rishi","shamanism","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Same as Self-God or Parasivam. God Siva's perfection of Absolute Reality, Parashiva -- That which abides at the core of every soul.  The term self in lower case denotes the personal ego, one's individual identity or personality in contrast with the Divine Self.   ","word":"Self","see_also":["atattva","Paramatman","Parashiva","rishi","shamanism","Satchidananda","Self Realization","trance"],"production_notes":null},{"definition":"Direct knowing of the Self God, Parashiva. Self Realization is known in Sanskrit as nirvikalpa samadhi; \"enstasy without form or seed;\" the ultimate spiritual attainment (also called asamprajnata samadhi). Esoterically, this state is attained when the mystic kundalini force pierces through the sahasrara chakra at the crown of the head. This transcendence of all modes of human consciousness brings the realization or \"nonexperience\" of That which exists beyond the mind, beyond time, form and space. But even to assign a name to Parashiva, or to its realization is to name that which cannot be named. In fact, it is \"experienced\" only in its aftermath as a change in perspective, a permanent transformation, and as an intuitive familiarity with the Truth that surpasses understanding.  ","word":"Self Realization","see_also":["enstasy","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"Enhancement or exaggeration one's own importance.  ","word":"self-aggrandizement","see_also":["enstasy","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"Dominant. Demanding recognition.  ","word":"self-assertive","see_also":["enstasy","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"Too high an opinion of oneself; vanity, vain pride.  ","word":"self-conceit","see_also":["enstasy","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"Paramadeshi sannyasin.  ","word":"self-declared sannyasin","see_also":["sannyasin","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"Modest, retiring behavior; giving all credit to God, preceptor and other persons and not accepting praise for one's accomplishments.  ","word":"self-effacement","see_also":["sannyasin","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"Shining brilliantly by itself.  ","word":"self-effulgent","see_also":["sannyasin","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"The process of wiping out or eradicating the personal ego and the dross of the past, lodged in the memory patterns of the subconscious. ","word":"self-erasement","see_also":["sannyasin","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"Satisfying one's own desires.  ","word":"self-gratification","see_also":["sannyasin","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"The processof putting oneself in a sleeplike state in which the subconsciousmind becomes accessible.  ","word":"self-hypnosis","see_also":["sannyasin","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"Satisfying one's own appetites and desires, often to excess, with little regard for others.  ","word":"self-indulgent","see_also":["sannyasin","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"Producing its own light; radiating light.  ","word":"self-luminous","see_also":["sannyasin","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"Full command of one's mind and emotions.  ","word":"self-mastery","see_also":["sannyasin","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"Observation of, or meditation upon, oneself, one's mind, emotions, thinking. Introspection. Playing back memories and impressions locked within the subconscious, endeavoring to deal with them. It is anticipating one's future and how the past will react upon it, enhance or detract from it.  ","word":"self-reflection","see_also":["spiritual unfoldment","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"An outward and superficial appearance or resemblance.  ","word":"semblance","see_also":["spiritual unfoldment","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"Of or relating to the Semites or their languages (Arabic, Hebrew, Amharic, and Aramaic) or their cultures.  ","word":"Semitic","see_also":["spiritual unfoldment","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"The three faiths -- Judaism, Islam and Christianity -- that trace their origins to Abraham. ","word":"Semitic religions","see_also":["Abrahamic","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"Of or related to the senses, especially the pleasures of the senses.  ","word":"sensuous","see_also":["Abrahamic","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"\"Red lotus flower.\" ","word":"sentamarai","see_also":["Abrahamic","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"Guards.  ","word":"sentries","see_also":["Abrahamic","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"Condition of bondage (slavery) in subjection to a master.   ","word":"servitude","see_also":["Abrahamic","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"\"Service,\" karma yoga, an integral part of the spiritual path, doing selfless, useful work for others, such as volunteer work at a temple, without preference or thought of reward or personal gain. Seva, or Sivathondu in Tamil, is the central practice of the charya pada.  ","word":"seva","see_also":["yoga","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"The large, red, fighting rooster (kukkuta in Sanskrit) that adorns Lord Murugan's flag, heralding the dawn of wisdom and the conquest of the forces of ignorance.  ","word":"seval","see_also":["Karttikeya","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"A breaking off or separation.  ","word":"severance","see_also":["Karttikeya","God Realization","kundalini","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"Hinduism has a healthy, unrepressed outlook on human sexuality, and sexual pleasure is part of kama, one of the four legitimate goals of life. On matters such as birth control, sterilization, masturbation, homosexuality, bisexuality, petting and polygamy, Hindu scripture is tolerantly silent, neither calling them sins nor encouraging their practice, neither condemning nor condoning. The two important exceptions to this understanding view of sexual experience are adultery and abortion, both of which are considered to carry heavy karmic implications for this and future births.  ","word":"sexuality","see_also":["abortion","bisexuality","homosexuality","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"\"Sheath of sounds, or words.\" Vocabulary; a dictionary or glossary of terms.  ","word":"shabda kosha","see_also":["abortion","bisexuality","homosexuality","liberation","Parashiva","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"\"Six views,\" \"six insights.\" Six classical philosophies distinguished among the hundreds of Hindu darshanas known through history: Nyaya, Vaisheshika, Sankhya, Yoga, Mimamsa and Vedanta. Each was tersely formulated in sutra form by its \"founder,\" and elaborated in extensive commentaries by other writers. They are understood as varied attempts at describing Truth and the path to it. Elements of each form part of the Hindu fabric today. -- Nyaya: \"System, rule; logic.\" A system of logical realism, founded sometime around 300 BCE by Gautama, known for its systems of logic and epistemology and concerned with the means of acquiring right knowledge. Its tools of enquiry and rules for argumentation were adopted by all schools of Hinduism. -- Vaisheshika: \"Differentiation,\" from vishesha, \"differences.\" Philosophy founded by Kanada (ca 300 BCE) teaching that liberation is to be attained through understanding the nature of existence, which is classified in nine basic realities (dravyas): earth, water, light, air, ether, time, space, soul and mind. Nyaya and Vaisheshika are viewed as a complementary pair, with Nyaya emphasizing logic, and Vaisheshika analyzing the nature of the world. -- Sankhya: \"Enumeration, reckoning.\" A philosophy founded by the sage Kapila (ca 500 BCE), author of the Sankhya Sutras. Sankhya is primarily concerned with \"categories of existence,\" tattvas, which it understands as 25 in number. The first two are the unmanifest Purusha and the manifest primal nature, Prakriti -- the male-female polarity, viewed as the foundation of all existence. Prakriti, out of which all things evolve, is the unity of the three gunas: sattva, rajas and tamas. Sankhya and Yoga are considered an inseparable pair whose principles permeate all of Hinduism. See: prakriti, purusha. -- Yoga: \"Yoking; joining.\" Ancient tradition of philosophy and practice codified by Patanjali (ca 200 BCE) in the Yoga Sutras. It is also known as raja yoga, \"king of yogas,\" or ashtanga yoga, \"eight-limbed yoga.\" Its object is to achieve, at will, the cessation of all fluctuations of consciousness, and the attainment of Self Realization. Yoga is wholly dedicated to putting the high philosophy of Hinduism into practice, to achieve personal transformation through transcendental experience, samadhi. See: yoga. -- Mimamsa: \"Inquiry\" (or Purva, \"early,\" Mimamsa). Founded by Jaimini (ca 200 BCE), author of the Mimamsa Sutras, who taught the correct performance of Vedic rites as the means to salvation. -- Vedanta (or Uttara \"later\" Mimamsa): \"End (or culmination) of the Vedas.\" For Vedanta, the main basis is the Upanishads and Aranyakas (the \"end,\" anta, of the Vedas), rather than the hymns and ritual portions of the Vedas. The teaching of Vedanta is that there is one Absolute Reality, Brahman. Man is one with Brahman, and the object of life is to realize that truth through right knowledge, intuition and personal experience. The Vedanta Sutras (or Brahma Sutras) were composed by Rishi Badarayana (ca 400 BCE). ","word":"shad darshana","see_also":["Brahma Sutra","padartha","tattva","Vedanta","yoga","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"\"Vegetarian diet.\" From shaka, \"vegetable;\" and ahara, \"eating; taking food.\"  ","word":"shakahara","see_also":["meat-eater","vegetarian","yama-niyama","Vedanta","yoga","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"\"Powerful,\" Of or relating to Shaktism. A follower of the Shakta Hindu religion.  ","word":"Shakta","see_also":["Shaktism","vegetarian","yama-niyama","Vedanta","yoga","raja yoga","samadhi","trance"],"production_notes":null},{"definition":null,"word":"Shakta Tantrism","see_also":["Shaktism","tantrism","yama-niyama","Vedanta","yoga","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"\"Power, energy.\" The active power or manifest energy of Siva that pervades all of existence. Its most refined aspect is Parashakti, or Satchidananda, the pure consciousness and primal substratum of all form. This pristine, divine energy unfolds as icchha shakti (the power of desire, will, love), kriya shakti (the power of action) and jnana shakti (the power of wisdom, knowing), represented as the three prongs of Siva's trishula, or trident. From these arise the five powers of revealment, concealment, dissolution, preservation and creation. In Saiva Siddhanta, Siva is All, and His divine energy, Shakti, is inseparable from Him. This unity is symbolized in the image of Ardhanarishvara, \"half-female God.\" In popular, village Hinduism, the unity of Siva and Shakti is replaced with the concept of Siva and Shakti as separate entities. Shakti is represented as female, and Siva as male. In Hindu temples, art and mythology, they are everywhere seen as the divine couple. This depiction has its source in the folk-narrative sections of the Puranas, where it is given elaborate expression. Shakti is personified in many forms as the consorts of the Gods. For example, the Goddesses Parvati, Lakshmi and Sarasvati are the respective mythological consorts of Siva, Vishnu and Brahma. Philosophically, however, the caution is always made that God and God's energy are One, and the metaphor of the inseparable divine couple serves only to illustrate this Oneness. Within the Shakta religion, the worship of the Goddess is paramount, in Her many fierce and benign forms. Shakti is the Divine Mother of manifest creation, visualized as a female form, and Siva is specifically the Unmanifest Absolute. The fierce or black (asita) forms of the Goddess include Kali, Durga, Chandi, Chamundi, Bhadrakali and Bhairavi. The benign or white (sita) forms include Uma, Gauri, Ambika, Parvati, Maheshvari, Lalita and Annapurna. As Rajarajeshvari (divine \"Queen of kings\") She is the presiding Deity of the Shri Chakra yantra. She is also worshiped as the ten Mahavidyas, manifestations of the highest knowledge -- Kali, Tara, Shodashi, Bhuvaneshvari, Chinnamasta, Bhairavi, Dhumavati, Bagata, Matangi and Kamala. While some Shaktas view these as individual beings, most revere them as manifestations of the singular Devi. There are also numerous minor Goddess forms, in the category of Gramadevata (\"village Deity\"). These include Pitari, \"Snake-catcher\" (usually represented by a simple stone), and Mariyamman, \"Smallpox Goddess.\" In the yoga mysticism of all traditions, divine energy, shakti, is experienced within the human body in three aspects: 1) the feminine force, ida shakti, 2) the masculine force, pingala shakti, and 3) the pure androgynous force, kundalini shakti, that flows through the sushumna nadi. Shakti is most easily experienced by devotees as the sublime, bliss-inspiring energy that emanates from a holy person or sanctified Hindu temple.  ","word":"Shakti","see_also":["Amman","Ardhanarishvara","Goddess","Parashakti","Shaktism","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"\"The powerful\" is four-armed and seated with Shakti on His knee. He holds a garland and gestures abhaya mudra. ","word":"Shakti Ganapati","see_also":["Amman","Ardhanarishvara","Goddess","Parashakti","Shaktism","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"The philosophy of Vira Saivism.  ","word":"Shakti Vishishtadvaita","see_also":["Vira Saivism","Ardhanarishvara","Goddess","Parashakti","Shaktism","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"\"Descent of grace,\" occurring during the advanced stage of the soul's evolution called arul, at the end of the sakala avastha. Shaktinipata is twofold: the internal descent is recognized as a tremendous yearning for Siva; the outer descent of grace is the appearance of a satguru. At this stage, the devotee increasingly wants to devote himself to all that is spiritual and holy. Same as shaktipata.  ","word":"shaktinipata","see_also":["arul","grace","sakala avastha","shaktipata","Shaktism","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"\"Descent of grace.\" Guru diksha, initiation from the preceptor; particularly the first initiation, which awakens the kundalini and launches the process of spiritual unfoldment.  ","word":"shaktipata","see_also":["anugraha shakti","diksha","grace","kundalini","Shaktism","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"\"Consorts.\" Loving Ganesha is often seen with two female consorts, or shaktis. They represent ida and pingala, the two life currents, emotion and intellect, that hold us close to Earth. ","word":"Shaktis","see_also":["anugraha shakti","diksha","grace","kundalini","Shaktism","raja yoga","samadhi","trance"],"production_notes":null},{"definition":"\"Doctrine of power.\" The religion followed by those who worship the Supreme as the Divine Mother -- Shakti or Devi -- in Her many forms, both gentle and fierce. Shaktism is one of the four primary sects of Hinduism. Shaktism's first historical signs are thousands of female statuettes dated ca 5500 BCE recovered at the Mehrgarh village in India. In philosophy and practice, Shaktism greatly resembles Saivism, both faiths promulgating, for example, the same ultimate goals of advaitic union with Siva and moksha. But Shaktas worship Shakti as the Supreme Being exclusively, as the dynamic aspect of Divinity, while Siva is considered solely transcendent and is not worshiped. There are many forms of Shaktism, with endless varieties of practices which seek to capture divine energy or power for spiritual transformation. Geographically, Shaktism has two main forms, the Shrikula \"family of the Goddess Shri (or Lakshmi),\" which respects the brahminical tradition (a mainstream Hindu tradition which respects caste and purity rules) and is strongest in South India; and the Kalikula, \"family of Kali,\" which rejects brahminical tradition and prevails in Northern and Eastern India. Four major expressions of Shaktism are evident today: folk-shamanism, yoga, devotionalism and universalism. Among the eminent mantras of Shaktism is: Aum Hrim Chandikayai Namah, \"I bow to Her who tears apart all dualities.\" There are many varieties of folk Shaktism gravitating around various forms of the Goddess, such as Kali, Durga and a number of forms of Amman. Such worship often involves animal sacrifice and fire-walking, though the former is tending to disappear.  ","word":"Shaktism (Shakta)","see_also":["Amman","Goddess","Ishta Devata","Kali","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Way of power.\"  ","word":"shaktopaya","see_also":["upaya","Goddess","Ishta Devata","Kali","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"Name of the Saivite noble clan into which Buddha, also called Shakyamuni, was born (in what is now Nepal).  ","word":"Shakya","see_also":["Buddha","Goddess","Ishta Devata","Kali","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Rice sprig.\" ","word":"shalipallava","see_also":["Buddha","Goddess","Ishta Devata","Kali","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"A priest of certain tribal societies who acts as a medium between the visible world and an invisible spirit worlds. ","word":"shaman","see_also":["Shamanism","Goddess","Ishta Devata","Kali","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"From the Sanskrit shramana, \"ascetic,\" akin to shram, meaning \"to exert.\" Generally refers to any religion based on the belief that good or evil spirits can be influenced by priests, or shamans, who serve as intermediaries between man and divine forces. Descriptive of many of the world's tribal, indigenous faiths. ","word":"Shamanism","see_also":["Shaktism","trance","Ishta Devata","Kali","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"From a Siberian tribal word, akin to the Sanskrit shramana, \"ascetic,\" akin to shram, meaning \"to exert.\" The religion of certain indigenous peoples of Northeast Asia, based on the belief in good and evil spirits who can be contacted and influenced by priests, or shamans, generally during a state of altered consciousness or trance. Also descriptive of many of the world's native, tribal faiths, and of various groups that today carry forward the practices and traditions of shamanism to maximize human abilities of mind and spirit for healing and problem-solving.  ","word":"shamanism (shamanic)","see_also":["folk-shamanic","mysticism","pagan","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Way of Shambhu\" (Siva).  ","word":"Shambhavopaya","see_also":["upaya","mysticism","pagan","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"Belongs to the Atharva Veda. Discusses eight forms of yoga, restraints, observances, breath control, meditation and the nature of Truth.  ","word":"Shandilya Upanishad","see_also":["upaya","mysticism","pagan","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Conferring happiness; propitious.\" A name of Siva. Also names Adi Shankara, one of Hinduism's most extraordinary monks (788 -- 820) and preeminent guru of the Smarta Sampradaya. Noted for his monistic philosophy of Advaita Vedanta, his many scriptural commentaries, and the establishment of ten orders of sannyasins with pontifical headquarters at strategic points across India. He lived only 32 years, but traveled throughout India and transformed the Hindu world of that time.  ","word":"Shankara","see_also":["Vedanta","mysticism","pagan","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"Advaita monasteries established by Sankara (ca 788 -- 820) as centers of Smarta authority in India, each with a distinct guru parampara and a reigning pontiff entitled Shankaracharya, and one of the four Upanishadic mahavakyas as a mantra. East coast: Govardhana Matha, in Puri (center of the Aranya and Vana orders). Himalayas: Jyotih Matha, near Badrinath (Giri, Parvata and Sagara orders). West coast: Sharada Matha, in Dvaraka (Tirtha and Ashrama orders). South: Shringeri Matha (Bharati, Puri and Sarasvati orders). A fifth prominent pitha, associated with Sringeri Matha, is in Kanchipuram, also in the South.  ","word":"Shankaracharya pitha","see_also":["Dashanami","Smarta","Sankara","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Conch.\" The water-born conch symbolizes the origin of existence, which evolves in spiraling spheres. In ancient days its sound signaled battle's victory; today it heralds the high point of puja in Hindu temples. In the Deity's hands it stands for protection from evil, sounding the sacred. ","word":"shankha","see_also":["Dashanami","Smarta","Sankara","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Founding teacher of the sixfold system.\" A title conferred upon Adi Sankara while he was living. It refers to his attempt to consolidate the six main sects of Hinduism in nonsectarian unity, as represented by its altar of five (or six) Deities.  ","word":"shanmata sthapanacharya","see_also":["panchayatana puja","Sankara","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Six-faced.\" (Tamil: Shanmuga.) A name for Lord Murugan or Karttikeya, denoting the multiplicity of His divine functions.  ","word":"Shanmukha","see_also":["Karttikeya","Sankara","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"A Vedic Gayatri chant, the Savitri Gayatri modified to address Lord Karttikeya as Shanmukha \"He of six faces.\"  ","word":"Shanmukha Gayatri","see_also":["Karttikeya","Sankara","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Peace.\"  ","word":"shanti","see_also":["Karttikeya","Sankara","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Peace chant.\" So that each gathering of devotees is harmonious and productive, especially sessions of teacher and student, this mantra from the Taittiriya Upanishad (2.1.1) is recited at the outset to invoke peace, clarity and divine blessings, thus dispelling all potential enmity or confusion. It is recited again at the end as a closing benediction.  ","word":"Shanti Mantra","see_also":["Karttikeya","Sankara","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Arrow.\" Loving Ganesha has power over thought, and each one hits its mark. Bow drawn, arrow aimed, He teaches us to precisely begin all beginnings with good intentions. ","word":"shara","see_also":["Karttikeya","Sankara","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Refuge.\" Saranam in Tamil. ","word":"sharana","see_also":["Karttikeya","Sankara","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Thicket of reeds.\" Mythologically, a sacred Himalayan pond where Lord Karttikeya was nurtured; esoterically understood as the lake of divine essence, or primal consciousness.  ","word":"Sharavana","see_also":["Karttikeya","Sankara","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Body; husk.\" Three bodies of the soul: 1) sthula sharira, \"gross or physical body\" (also called annamaya kosha), the odic body; 2) sukshma sharira, \"subtle body\" (also called linga sharira, it includes the pranamaya, manomaya and vijnanamaya koshas); 3) karana sharira, \"causal body\" (also called anandamaya kosha), the actinic causal body. Another term for body is deha.  ","word":"sharira","see_also":["kosha","subtle body","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"A North Indian Brahmin caste.  ","word":"Sharma","see_also":["kosha","subtle body","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Period of the moon.\" Specifically, the crescent moon that adorns Lord Siva's hair, the moon of the dark fortnight's second day. ","word":"shashikala","see_also":["kosha","subtle body","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Sixtieth birthday celebration.\" Done for the couple on the husband's birthday, usually with many family and friends attending. It consists in a homa, renewal of marriage vows and retying the wedding pendant.   ","word":"shashtyabda purti","see_also":["kosha","subtle body","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Sacred text; teaching.\" 1) Any religious or philosophical treatise, or body of writings. 2) A department of knowledge, a science; e.g., the Dharma Shastras on religious law, Artha Shastras on politics.  ","word":"shastra","see_also":["kosha","subtle body","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"One who is knowledgeable in shastra, or scriptures.  ","word":"shastri","see_also":["kosha","subtle body","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Sacerdotal treatise of 100 paths.\" A priestly manual of the Shukla Yajur Veda, dealing with theology, philosophy and modes of worship.   ","word":"Shatapatha Brahmana","see_also":["kosha","subtle body","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Six-pointed star,\" formed by two interlocking triangles, the upper one representing Siva's transcendent Being, and the lower one Siva's manifest energy, Shakti. The shatkona is part of Lord Karttikeya's yantra. A similar emblem in Judaism is of independent origin and signification.  ","word":"shatkona","see_also":["Ardhanarishvara","Karttikeya","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Six stages.\" Vira Saivism's six stages to union with Siva.  ","word":"shatsthala","see_also":["Vira Saivism","Karttikeya","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"To break into many pieces suddenly, as if struck.  ","word":"shatter","see_also":["Vira Saivism","Karttikeya","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Purity.\"  ","word":"shaucha","see_also":["purity-impurity","yama-niyama","Smartism","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"A covering or receptacle, such as the husk surrounding a grain of rice. In Sanskrit, it is kosha, philosophically the bodily envelopes of the soul.  ","word":"sheath","see_also":["kosha","soul","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"Dishonesty, evasiveness, deceitfulness.  ","word":"shiftiness","see_also":["kosha","soul","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Summit; pinnacle; crest.\" The towering superstructure above the garbhagriha in North Indian style temples. In Southern temples, shikhara refers to the top stone of the superstructure, or vimana.  ","word":"shikhara","see_also":["kosha","soul","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"Auxiliary Vedic tracts on Sanskrit phonetics, among four linguistic skills taught for mastery of the Vedas and rites of yajna. Shiksha literally means \"rules of instruction; learning; method of study.\"  ","word":"Shiksha Vedanga","see_also":["Vedanga","soul","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Art or craft manual.\" 1) A particular class of works which formed the primary teachings on any of the fine arts or sacred sciences, such as architecture, dance, painting, jewelry-making, pottery, weaving, and basketry, garlandry, metal-working, acting, cooking and horsemanship. The earliest Shilpa Shastras are thought to date to 200 BCE. Many were written between the 5th and 14th centuries.  ","word":"Shilpa Shastra","see_also":["kala -- 64","Sthapatyaveda","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Craftsman.\" A stone worker or other traditional Hindu artrisan.  ","word":"shilpi","see_also":["kala -- 64","Sthapatyaveda","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"The indigenous religion of Japan.  ","word":"Shinto","see_also":["kala -- 64","Sthapatyaveda","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"The indigenous religion of Japan, based on the sacred power or God, kami, within a variety of forms, mainly of nature.  ","word":"Shintoism","see_also":["kala -- 64","Sthapatyaveda","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"A pupil\" or \"disciple,\" especially one who has proven himself and has formally been accepted by a guru.  ","word":"shishya","see_also":["kala -- 64","Sthapatyaveda","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Dancing with Siva.\"   ","word":"Shivena saha Nartanam","see_also":["kala -- 64","Sthapatyaveda","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"Anglicized adjective from the great saying, Shivoham, meaning \"I am That; I am Siva,\" carrying the spirit of the underlying unity of God and the soul.  ","word":"Shivohamic","see_also":["kala -- 64","Sthapatyaveda","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Verse,\" from the verbal root, shlok,\"to compose.\" A verse, phrase, proverb or hymn of praise, usually composed in a specified meter. Especially a verse of two lines, each of sixteen syllables. Shloka is the primary verse form of the Sanskrit epics, Mahabharata and Ramayana. ","word":"shloka","see_also":["sutra","Sthapatyaveda","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Memorial.\" Relating to commemorative ceremonies for the deceased, held one week, one month after death, and annually thereafter, according to tradition.  ","word":"shraddha","see_also":["death","samskara","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Distillation of faith or belief.\" A term used in Dancing with Siva for creed, a concise synopsis of religious doctrine.  ","word":"shraddha dharana","see_also":["creed","faith","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":null,"word":"shraddha shuddhi","see_also":["shuddhi","faith","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Related to hearing; audible.\" That which is prescribed by or conforms with the Vedas.   ","word":"shrauta","see_also":["shuddhi","faith","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Texts on the revelation.\" 1) Refers to scriptures or teachings that are in agreement with the Vedas. 2) A certain group of texts of the Kalpa Vedanga, and part of the essential study for Vedic priests. The Shrauta Shastras offer explanation of the yajna rituals.  ","word":"Shrauta Shastra","see_also":["Vedanga","faith","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Radiant,\" \"excellent;\" \"honorable,\" \"eminent.\" An honorific title prefixed to the names of Deities (e.g., Shri Ganesha); to the names of scriptural works (meaning holy, sacred), or eminent persons (Sir, Mr.). The feminine equivalent is shrimati.   ","word":"shri","see_also":["Vedanga","faith","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Venerated wheel.\"  ","word":"Shri Chakra","see_also":["yantra","faith","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"The guru's venerable sandals.  ","word":"shri paduka","see_also":["holy feet","paduka","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"(Hymn) to the wielder of awesome powers.\" Preeminent Vedic hymn to Lord Siva as the God of dissolution, chanted daily in Siva temples throughout India. It is in this long prayer, located in the Yajur Veda, Taittiriya Samhita, in the middle of the first three Vedas, that the Saivite mantra Namah Sivaya first appears.   ","word":"Shri Rudram","see_also":["holy feet","paduka","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Excellency,\" Eminence,\" \"Most Venerable.\" Honorific title for distinguished religious prelates.   ","word":"Shrila","see_also":["holy feet","paduka","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"Covered, protected, screened,veiled, sheltered. ","word":"shrouded","see_also":["holy feet","paduka","subtle body","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"That which is \"heard.\" Aurally, or clairaudiently, received scripture. Hinduism's revealed scriptures, of supreme theological authority and spiritual value. They are timeless teachings transmitted to rishis, or seers, directly by God thousands of years ago. Shruti is thus said to be apaurusheya, \"supra-human.\" Shruti consists of the Vedas and the Agamas, preserved through oral tradition and eventually written down in Sanskrit. Among the many sacred books of the Hindus, these two bodies of knowledge are held in the highest esteem. For countless centuries shruti has been the basis of philosophical discussion, study and commentary, and this attention has given rise to countless schools of thought. It is also the subject of deep study and meditation, to realize the wisdom of the ancients within oneself. Most mantras are drawn from shruti, used for rites of worship, both public and domestic, as well as personal prayer and japa. It is a remarkable tribute to Hindu culture that so much of shruti was preserved without alteration by means of oral instruction from guru to shishya, generation after generation for thousands of years. In the Veda tradition this was accomplished by requiring the student to learn each verse in eleven different ways, including backwards. Traditionally shruti is not read, but chanted according to extremely precise rules of grammar, pitch, intonation and rhythm. This brings forth its greatest power. In the sacred language of shruti, word and meaning are so closely aligned that hearing these holy scriptures properly chanted is magical in its effect upon the soul of the listener.  ","word":"shruti","see_also":["Agamas","smriti","Vedas","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Auspicious,\" \"splendid,\" \"bright.\"  ","word":"shubha","see_also":["Agamas","smriti","Vedas","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Auspicious time.\" A range of time when specified activities are most likely to thrive and succeed.  ","word":"shubha muhurta","see_also":["muhurta","smriti","Vedas","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Pure.\"  ","word":"shuddha","see_also":["muhurta","smriti","Vedas","Shaktism","Shakti","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Stage of purity.\" (Tamil: avasthai.) In Saiva Siddhanta, the last of three stages of evolution, in which the soul is immersed in Siva. Self Realization having been attained, the mental body is purified and thus reflects the divine soul nature, Siva's nature, more than in the kevala or sakala state. Now the soul continues to unfold through the stages of realization, and ultimately merges back into its source, the Primal Soul.  ","word":"shuddha avastha","see_also":["avastha","evolution of the soul","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Pure Saiva Siddhanta,\" a term first used by Tirumular in the Tirumantiram to describe his monistic Saiva Siddhanta and distinguish it from pluralistic Siddhanta and other forms of Siddhanta that do not encompass the ultimate monism of Vedanta.   ","word":"Shuddha Saiva Siddhanta","see_also":["avastha","evolution of the soul","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":" \"Pure Knowledge.\" The fifth tattva in the Saiva Siddhanta system.  ","word":"shuddhavidya","see_also":["tattva","evolution of the soul","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Purification.\" Also, shraddha shuddhi, \"purification of faith.\" The rite of accepting back into the Hindu fold individuals who have been converted to other faiths or otherwise require purification to rejoin the Hindu congregation. An alternate term to vratyastoma, \"oath affirmation.\"  ","word":"shuddhi","see_also":["tattva","evolution of the soul","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Worker, servant.\" The social class of skilled artisans, workers and laborers.  ","word":"shudra","see_also":["varna dharma","evolution of the soul","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Parrot.\" ","word":"shuka","see_also":["varna dharma","evolution of the soul","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":null,"word":"Shukla Yajur Veda","see_also":["Yajur Veda","evolution of the soul","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"White, bright or pure gifts.\" Funds that are given freely and were earned through dharmic means, and thus unsullied by the negative karmic taint of adharmic activities. ","word":"shukladana","see_also":["yama-niyama","evolution of the soul","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"Practical manuals giving the measurements and procedures for constructing the sites of Vedic yajna rites. A division of the Kalpa Vedanga (Veda limb on rituals), these sutras employ sophisticated geometry and are India's earliest extant mathematical texts. Shulba means \"string or cord,\" denoting the use of string for measuring.  ","word":"Shulba Shastra(s)","see_also":["Vedanga","evolution of the soul","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"A Natha mystical language of meditation revealed in Switzerland in 1968 by Sivaya Subramuniyaswami.   ","word":"Shum","see_also":["Vedanga","evolution of the soul","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"The four perspectives of the mind.","word":"Shum perspectives","see_also":["Vedanga","evolution of the soul","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"A Natha mystical language of meditation (also simply known as Shum) revealed in Switzerland in 1968 by Sivaya Subramuniyaswami. ","word":"Shum-Tyeif","see_also":["Vedanga","evolution of the soul","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"(Shum) The perspective of the mind as a solid and individual awareness traveling from one area of the mind to another. Pronounced shoom-eef.  ","word":"shumif","see_also":["Shum","Shum perspectives","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"To avoid or keep away from consistently. Shunning detractors or adversaries is courteously avoiding interaction and karmic entanglement with those who have shown by their actions that such interaction would not be beneficial or welcome. Shunning is a form of protection through nonengagement, building a \"friendly, firm wall\" while still remaining cordial.  ","word":"shun","see_also":["Shum","Shum perspectives","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Elephant trunk.\" ","word":"shunda","see_also":["Shum","Shum perspectives","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"The void, the distinctionless Absolute.\"  ","word":"shunya","see_also":["Shum","Shum perspectives","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Gaining of Nothingness.\" A primary text of Vira Saivism (ca 1550) consisting of debates and writings of the Siva Sharanas. Shunya: \"the void, the distinctionless absolute;\" sampadana: \"attainment, realization, enlightenment.\"   ","word":"Shunya Sampadane","see_also":["Shum","Shum perspectives","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"An instrument that carries a spool of thread in the weaving of cloth.  ","word":"shuttle","see_also":["Shum","Shum perspectives","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"An Upanishad of the Yajur Veda that emphasizes theism -- personal God and devotion -- and at the same time monism -- the unity of God, soul and world. It is valued as a major Upanishad, among the greatest panentheist writings, especially precious to Saivite schools.  ","word":"Shvetashvatara Upanishad","see_also":["Upanishad","Veda","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"A \"perfected one'' or accomplished yogi, a person of great spiritual attainment or powers. ","word":"siddha","see_also":["siddhi","siddha yoga","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"Another term for Siddha Siddhanta.  ","word":"Siddha Marga","see_also":["Siddha Siddhanta","siddha yoga","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"Siddha Siddhanta, also called Gorakshanatha Saivism, is generally considered to have evolved in the lineage of the earlier ascetic orders of India. Its most well-known preceptor was Gorakshanatha (ca 1000) a disciple of Matsyendranatha, patron saint of Nepal, revered by certain esoteric Buddhist schools as well as by Hindus. The school systematized and developed the practice of hatha yoga to a remarkable degree. Indeed, nearly all of what is today taught about hatha yoga comes from this school. Among its central texts are Hatha Yoga Pradipika by Svatmarama, Gheranda Samhita, Shiva Samhita and Jnanamrita. Siddha Siddhanta theology embraces both transcendent Siva (being) and immanent Siva (becoming). Siva is both the efficient and material cause of the universe. Devotion is expressed through temple worship and pilgrimage, with the central focus on internal worship and kundalini yoga, with the goal of realizing Parasamvid, the supreme transcendent state of Siva. Today there are perhaps 750,000 adherents of Siddha Siddhanta Saivism, who are often understood as Shaktas or advaita tantrics. The school fans out through India, but is most prominent in North India and Nepal. Devotees are called yogis, and stress is placed on world renunciation -- even for householders. This sect is most commonly known as Natha, the Gorakshapantha and Siddha Yogi Sampradaya. Other names include Adinatha Sampradaya, Nathamatha and Siddhamarga.  ","word":"Siddha Siddhanta","see_also":["Gorakshanatha Saivism","siddha yoga","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Tracks on the doctrines of the adepts.\" A text of 353 mystical verses, ascribed to Gorakshanatha, dealing with the esoteric nature of the inner bodies and the soul's union with Supreme Reality.  ","word":"Siddha Siddhanta Paddhati","see_also":["Gorakshanatha","Siddha Siddhanta","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Yoga of perfected attainment, or of supernatural powers.\" 1) A term used in the Tirumantiram and other Saiva scriptures to describe the yoga which is the way of life of adepts after attaining of Parashiva. Siddha yoga involves the development of magical or mystical powers, or siddhis, such as the eight classical powers. It is a highly advanced yoga which seeks profound transformation of body, mind and emotions and the ability to live in a flawless state of God Consciousness. 2) The highly accomplished practices of certain alchemists. ","word":"siddha yoga","see_also":["siddha yogi","siddhi","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Yogi of perfection.\" A perfected one, adept, a realized being who is the embodiment of the most profound yogic states and has attained magical or mystical powers.  ","word":"siddha yogi","see_also":["siddha yoga","siddhi","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"Another term for Siddha Siddhanta.  ","word":"Siddha Yogi Sampradaya","see_also":["Siddha Siddhanta","siddhi","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Final attainments\" or \"conclusions.\" 1) Siddhanta refers to ultimate understanding arrived at in any given field of knowledge. 2) Especially when juxtaposed with the term Vedanta, it refers to the daily theistic practices of religion, as opposed to the monistic, meditative aspects; though Saiva Siddhanta encompasses both theism and monism, Vedanta and Siddhanta, Vedas and Agamas.  ","word":"siddhanta","see_also":["Siddha Siddhanta","siddhi","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Hearing the final conclusions; scriptural study.\" Among the niyamas of ashtanga yoga, Siddhantasravana is the practice of studying the scriptures and listening to the wise of one's lineage.   ","word":"Siddhantasravana","see_also":["Siddha Siddhanta","siddhi","kevala avastha","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Power, accomplishment; perfection.\" Extraordinary powers of the soul, developed through consistent meditation and deliberate, often uncomfortable and grueling tapas, or awakened naturally through spiritual maturity and yogic sadhana. Through the repeated experience of Self Realization, siddhis naturally unfold according to the needs of the individual. Before Self Realization, the use or development of siddhis is among the greatest obstacles on the path because it cultivates ahamkara, \"I-ness\" (egoity), and militates against the attainment of prapatti, complete submission to the will of God, Gods and guru. Six siddhis in particular are considered primary obstacles to samadhi: clairvoyance (adarsha siddhi or divya siddhi), clairaudience (shravana siddhi or divyashravana), divination (pratibha siddhi), super-feeling (vedana siddhi) and super-taste (asvadana siddhi), super-smell (varta siddhi). The eight classical siddhis are: 1) anima: diminution; being as small as an atom; 2) mahima: enlargement; becoming infinitely large; 3) laghima: super-lightness, levitation; 4) prapti: pervasiveness, extension, ability to be anywhere at will; 5) prakamya: fulfillment of desires; 6) vashitva: control of natural forces; 7) ishititva: supremacy over nature; 8) kama-avasayitva: complete satisfaction. The supreme siddhi (parasiddhi) is realization of the Self, Parashiva.  ","word":"siddhi","see_also":["ahamkara","prapatti","siddha yoga","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Attainment and Wisdom;\" names of the two symbolic consorts of Lord Ganesha. ","word":"Siddhi and Buddhi","see_also":["ahamkara","prapatti","siddha yoga","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"A name and traditional murti, or form, of Ganesha, \"the accomplished one,\" who holds a bouquet of flowers, an axe, mango, sugarcane and, in His trunk, a sesame sweet. ","word":"Siddhi Ganapati","see_also":["ahamkara","prapatti","siddha yoga","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Giver of success, fulfillment,\" an epithet of Lord Ganesha. ","word":"Siddhidata","see_also":["ahamkara","prapatti","siddha yoga","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Disciple.\" Religion of nine million members founded in India about 500 years ago by the saint Guru Nanak. A reformist faith, Sikhism rejects idolatry and the caste system, its holy book is the Adi Granth, and main center is the Golden Temple of Amritsar. Sikhs honor a line of ten gurus: Guru Nanak (Nanak), Guru Angad, Guru Amardas, Guru Ram Das (Ram Das), Guru Arjun, Guru Har Govind, Guru Har Rai, Guru Har Krishnan (Krishnan), Guru Tegh Bahadur and Guru Govind Singh.  ","word":"Sikh","see_also":["Adi Granth","prapatti","siddha yoga","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Discipleship.\" Religion of nine million members founded in India about 500 years ago by the saint Guru Nanak. A reformist faith which rejects idolatry and the caste system, its holy book is the Adi Granth, and its main holy center is the Golden Temple of Amritsar.  ","word":"Sikhism","see_also":["Adi Granth","prapatti","siddha yoga","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"The astral substance which connects the physical body to the astral body which is disconnected at the time of death of the physical body.  ","word":"silver cord","see_also":["Adi Granth","prapatti","siddha yoga","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Hair-parting rite.\"  ","word":"simantonnayana","see_also":["samskaras of birth","prapatti","siddha yoga","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"A figure of speech in which two unlike things are compared, often introduced by \"like\" or\"as.\"  ","word":"simile","see_also":["samskaras of birth","prapatti","siddha yoga","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"(Shum) The perspective of the mind in its scientific, intellectual state. Pronounced sim-neef.  ","word":"simnif","see_also":["Shum","Shum perspectives","siddha yoga","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"(Shum) To become aware of the power within the spine. Pronounced sim-shoom-bee-see.  ","word":"simshumbisi","see_also":["Shum","Shum perspectives","siddha yoga","sakala avastha","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"Intentional transgression of divine law. Akin to the Latin sons, \"guilty.\" Hinduism does not view sin as a crime against God, but as an act against dharma -- moral order -- and one's own self. It is thought natural, if unfortunate, that young souls act wrongly, for they are living in nescience, avidya, the darkness of ignorance. Sin is an adharmic course of action which automatically brings negative consequences. The term sin carries a double meaning, as do its Sanskrit equivalents: 1) a wrongful act, 2) the negative consequences resulting from a wrongful act. In Sanskrit the wrongful act is known by several terms, including pataka (from pat, \"to fall\"), papa, enas, kilbisha, adharma, anrita and rina (transgression, in the sense of omission). The residue of sin is called papa, sometimes conceived of as a sticky, astral substance which can be dissolved through penance (prayashchitta), austerity (tapas) and good deeds (sukritya). This astral substance can be psychically seen within the inner, subconscious aura of the individual. Note that papa is also accrued through unknowing or unintentional transgressions of dharma, as in the term aparadha (offense, fault, mistake). -- inherent (or original) sin: A doctrine of Semitic faiths whereby each soul is born in sin as a result of Adam's disobedience in the Garden of Eden. Sometimes mistakenly compared to the Saiva Siddhanta concept of the three malas, especially anava. See: pasha. -- mortal sin: According to some theologies, sins so grave that they can hardly be expiated and which cause the soul to be condemned to suffer eternally in hell. In Hinduism, there are no such concepts as inherent or mortal sin. ","word":"sin","see_also":["aura","evil","karma","papa","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"Red lead, vermillion.\" (Sindur in Hindi.) A red powder used to make the forehead mark (pottu, or tilaka) on the Deity image.  ","word":"sindura","see_also":["See tilaka","evil","karma","papa","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"\"The leonine one\" rides a lion and holds another in one hand. He also holds a vina, a lotus and pot of jewels. ","word":"Sinha Ganapati","see_also":["See tilaka","evil","karma","papa","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"A pupil or disciple, especially one who has proven himself and has formally accepted a Sat Guru as his guide in spiritual instruction.   ","word":"sishiya","see_also":["See tilaka","evil","karma","papa","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"A lute-like Indian stringed instrument with a long, fretted neck and a resonating gourd or gourds.  ","word":"sitar","see_also":["See tilaka","evil","karma","papa","vishvagrasa","tantrism","samadhi","trance"],"production_notes":null},{"definition":"The \"Auspicious,\" \"Gracious,\" or \"Kindly one.\" Supreme Being of the Saivite religion. God Siva is All and in all, simultaneously the creator and the creation, both immanent and transcendent. As personal Deity, He is Creator, Preserver and Destroyer. He is a one Being, perhaps best understood in three perfections: Parameshvara (Primal Soul), Parashakti (Pure Consciousness) and Parashiva (Absolute Reality).  ","word":"Siva","see_also":["Parameshvara","Parashakti","Parashiva","Nataraja","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"Also called Siva Vishishtadvaita, or Saivite \"qualified nondualism,\" Siva Advaita is the philosophy of Srikantha (ca 1050) as expounded in his commentary on the Brahma Sutras (ca 500-200 bce). Patterned after the Vaishnavite Vishishtadvaita of Ramanuja, this philosophy was later amplified by Appaya Dikshita. Brahman, or Siva, is transcendent and the efficient and material cause of the world and souls. Souls are not identical with Him and never merge in Him, even after liberation. As a school, Siva Advaita remained exclusively intellectual, never enjoying a following of practitioners. Purification, devotion and meditation upon Siva as the Self -- the akasha within the heart -- define the path. Meditation is directed to the Self, Siva, the One Existence that evolved into all form. Liberation depends on grace, not deeds.  ","word":"Siva Advaita","see_also":["Appaya Dikshita","Saivism","Srikantha","Nataraja","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"Sivachaitanya. A broad term naming the experience or state of being conscious of Siva in a multitude of ways, such as the five expressed in the following meditation. Vital Breath (prana): Experience the inbreath and outbreath as Siva's will within the body. Become attuned to the ever-present pulse of the universe, knowing that nothing moves but by His divine will. All-PervasiveEnergy (shakti): Become conscious of the flow of life within the body. Realize that it is the same universal energy within every living thing. Practice seeing the life energy within another's eyes. Manifest Sacred Form (darshana): Hold in your mind a sacred form, such as Nataraja, Sivalinga or the satguru -- who is Sadashiva -- and think of nothing else. See every form as a form of our God Siva. Inner Light (jyoti): Observe the light that illumines the thoughts. Concentrate only on that light, as you might practice being more aware of the light on a TV screen than of its changing pictures. Sacred Sound (nada): Listen to the constant high-pitched ee sounding in the head. It is like the tone of an electrical transformer, a hundred tamburas distantly playing or a humming swarm of bees.  ","word":"Siva consciousness","see_also":["jnana","mind(five states)","Srikantha","Nataraja","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"A scripture of Kashmir Saivism, now lost, written by Somananda, a disciple of Vasugupta.  ","word":"Siva Drishti","see_also":["Kashmir Saivism","mind(five states)","Srikantha","Nataraja","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Ancient [lore] of Siva.\" 1) A collection of six major scriptures sacred to Saivites. 2) The name of the oldest of these six texts, though some consider it a version of the Vayu Purana.   ","word":"Siva Purana","see_also":["Kashmir Saivism","mind(five states)","Srikantha","Nataraja","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"A purely nondual commentary and interpretation by Appaya Dikshita (1554 -- 1626) on the writings of Srikantha.  ","word":"Siva Rakshamani Dipika","see_also":["Saivism","mind(five states)","Srikantha","Nataraja","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"Text from the Gorakshanatha school of Saivism, ca 1700. In 212 sutras it discusses anatomy, asanas, energy, breathing and philosophy. It is available in various languages and widely studied as a valuable overview of yoga practice.   ","word":"Siva Samhita","see_also":["Saivism","mind(five states)","Srikantha","Nataraja","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"The seminal or seed scripture of Kashmir Saivism, 77 aphorisms revealed to Sage Vasugupta (ca 800).  ","word":"Siva Sutra(s)","see_also":["Vasugupta","mind(five states)","Srikantha","Nataraja","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":null,"word":"Siva's five faces","see_also":["Sadashiva","mind(five states)","Srikantha","Nataraja","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"Father-Mother God, both immanent and transcendent. A name for God Siva encompassing His unmanifest Being and manifest energy.  ","word":"Siva-Shakti","see_also":["Ardhanarishvara","Parameshvara","Parashiva","Siva","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"God consciousness.\"  ","word":"Sivachaitanya","see_also":["Siva consciousness","Parameshvara","Parashiva","Siva","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Treating all as God.\"  ","word":"Sivachara","see_also":["Vira Saivism","Parameshvara","Parashiva","Siva","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Moving toward Siva,\" the hereditary priests of the Saiva Siddhanta tradition. The title of Adishaiva Brahmins. An Adishaiva priest who has received the necessary training and dikshas to perform public Siva temple rites known as Agamic Nitya Parartha Puja. A fully qualified Sivacharya is also known a sarchaka. Sivacharya, too, names the family clan of this priest tradition.  ","word":"Sivacharya","see_also":["Brahma","Parameshvara","Parashiva","Siva","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Memorandum on Siva Realization.\" A digest authored (or, some believe, a portion of the Raurava Agama translated into Tamil) by Meykandar, ca 1300, consisting of 12 sutras describing the relationship between God, soul and world. The Meykandar Sampradaya revere it as their primary philosophical text and consider it a pluralistic exposition. Others view it as monistic in character, with a pluralistic interpretation introduced by later commentators. Connected with this important text is an acute commentary on each of the 12 sutras.  ","word":"Sivajnanabodham","see_also":["Meykandar Shastras","Parameshvara","Parashiva","Siva","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"A text by Appaya Dikshita (1554 -- 1626) written to reestablish the superiority of God Siva in the face of widespread conversion to Vaishnavism.  ","word":"Sivakarnamrita","see_also":["Appaya Dikshita","Parameshvara","Parashiva","Siva","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"The holy Siva temple. \"Siva's residence or dwelling\" (alaya).  ","word":"Sivalaya","see_also":["temple","Parameshvara","Parashiva","Siva","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Mark,\" \"Token\" or \"Sign of Siva.\" The most prevalent emblem of Siva, found in virtually all Siva temples. A rounded, elliptical, aniconic image, usually set on a circular base, or pitha, the Sivalinga is the simplest and most ancient symbol of Siva, especially of Parashiva, God beyond all forms and qualities. The pitha represents Parashakti, the manifesting power of God. Lingas are usually of stone (carved or naturally existing, svayambhu, such as shaped by a swift-flowing river), but may also be of metal, precious gems, crystal, wood, earth or transitory materials such as ice. According to the Karana Agama (verse 6), a transitory Sivalinga may be made of 12 different materials: sand, rice, cooked food, river clay, cow dung, butter, rudraksha seeds, ashes, sandalwood, dharba grass, a flower garland or molasses.  ","word":"Sivalinga","see_also":["murti","Saivism","svayambhu Linga","Siva","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Realm of Siva.\" Siva's \"loka\"--habitat, region or level of existence. Known as the causal plane or Third World, the Sivaloka is the abode of Siva, the Mahadevas and highly advanced souls. It exists deep within the Second World.   ","word":"Sivaloka","see_also":["loka","Saivism","svayambhu Linga","Siva","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"Same as Siva.  ","word":"Sivam","see_also":["loka","Saivism","svayambhu Linga","Siva","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Formed, made, consisting of\" or \"full of Siva.\" A part of the Saivite affirmation of faith, denoting that all of existence -- all worlds, all beings, all of manifestation, that which undergoes creation, preservation and destruction, all dualities and paradoxes -- consists of and is pervaded by Siva. An important concept of monistic Saivism.  ","word":"Sivamaya","see_also":["maya","sarvabhadra","tattva","world","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Sheath composed of Siva.\" The Primal Soul form, Parameshvara -- the body of God Siva -- into which the individual soul merges as the fulfillment of its evolution.  ","word":"Sivamayakosha","see_also":["Parameshvara","vishvagrasa","tattva","world","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Servitor of Siva.\" Conveys a mystic relationship between the devotee and Siva in which all spiritual, mental and physical actions are perceived as fulfilling the will and design of Siva.  ","word":"Sivanadiyar","see_also":["karma yoga","vishvagrasa","tattva","world","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Bliss of Siva.\"  ","word":"Sivananda","see_also":["karma yoga","vishvagrasa","tattva","world","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"One of Hinduism's most influential modern-day saints (1887 -- 1963). He was born in South India, practiced medicine in Malaysia, published a medical journal, became administrator of a hospital and later renounced the world. Initiated by Swami Visvananda Sarasvati at Rishikesh in 1924, he founded the Divine Life Society in 1939, which has branches in many countries today. He has been a powerful force in spreading Hindu teachings in India and abroad through his many books and the travels of his numerous swamis. Emphasized hatha and raja yoga and a broad, universal form of Hinduism.   ","word":"Sivananda, Swami","see_also":["karma yoga","vishvagrasa","tattva","world","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"Quality of being Siva or like Siva, especially sharing in His divine state of consciousness.  ","word":"Sivaness","see_also":["samarasa","Siva consciousness","Sivasayujya","world","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"The \"Hall of Siva experience,\" where the Vira Saivites gathered to develop the basic doctrines of the movement in the 12th century.  ","word":"Sivanubhava Mandapa","see_also":["samarasa","Siva consciousness","Sivasayujya","world","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Siva, the Great One.\"  ","word":"Sivaperuman","see_also":["Siva","Siva consciousness","Sivasayujya","world","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Night of Siva.\"  ","word":"Sivaratri","see_also":["Mahashivaratri","Siva consciousness","Sivasayujya","world","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Bound together in love of Siva.\" The underlying unity and harmony among devotees of Siva, irrespective of caste or creed.  ","word":"Sivasambandha","see_also":["Mahashivaratri","Siva consciousness","Sivasayujya","world","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Intimate union with Siva.\" Becoming one with God. The state of perpetual Siva consciousness; simultaneous perception of the inner and the outer. A permanent state of oneness with Siva, even in the midst of ordinary activities, the aftermath or plateau which comes after repeated Self Realization experiences. Rishi Tirumular says: \"Sayujya is the state of jagratita -- the 'Beyond Consciousness.' Sayujya is to abide forever in upashanta, the peace that knows no understanding. Sayujya is to become Siva Himself. Sayujya is to experience the infinite power of inward bliss forever and ever (Tirumantiram 1513).\" In many Hindu schools of thought it is the highest attainment. It dawns when the kundalini resides coiled in the sahasrara chakra.  ","word":"Sivasayujya","see_also":["jivanmukti","kaivalya","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"One surrendered in God.\"  ","word":"Sivasharana","see_also":["Vira Saivism","kaivalya","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Servant of Siva.\" Conveys the same mystic meaning as Sivanadiyar, denoting a devotee who regularly performs actions dedicated to God Siva; selfless work in service to others.  ","word":"Sivathondan","see_also":["karma yoga","kaivalya","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Servant of Siva.\" Conveys the same mystic meaning as Sivanadiyar, denoting a devotee who regularly performs actions dedicated to God Siva; selfless work in service to others. ","word":"Sivathondar","see_also":["karma yoga","Sivathondu","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Service to Siva.\" Akin to the concept of karma yoga.  ","word":"Sivathondu","see_also":["karma yoga","Sivathondu","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"To Siva.\" Siva's name in dative case. ","word":"Sivaya","see_also":["karma yoga","Sivathondu","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Adoration to Siva.\" Alternate form of the mantra Namah Sivaya.  ","word":"Sivaya Namah","see_also":["Namah Sivaya","Sivathondu","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Siva is also that.\" A phrase in Tamil that implies an obvious truth.  ","word":"Sivayave","see_also":["Namah Sivaya","Sivathondu","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"One of the eight disciples of Maharishi Nandinatha.  ","word":"Sivayogamuni","see_also":["Kailasa Parampara","Sivathondu","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Quicksilver;\" \"leaping one.\" One of Lord Karttikeya's oldest names, and His form as scarlet-hued warrior God.  ","word":"Skanda","see_also":["Karttikeya","Sivathondu","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"A six-day festival in October-November celebrating Lord Karttikeya's, or Skanda's, victory over the forces of darkness.  ","word":"Skanda Shashthi","see_also":["Karttikeya","Sivathondu","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"A doubting or questioning state of mind, doubt about fundamental religious principles; the doctrine that all knowledge must be subject to doubt and inquiry.  ","word":"skepticism","see_also":["Karttikeya","Sivathondu","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"Lazy, disinterested in working or exerting oneself.  ","word":"slothful","see_also":["Karttikeya","Sivathondu","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"To shed, caste off; discard an outer layer.  ","word":"slough","see_also":["Karttikeya","Sivathondu","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"Lacking alertness, vigor or energy.  ","word":"sluggish","see_also":["Karttikeya","Sivathondu","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Of or related to smriti,\" the secondary Hindu scriptures. Of or related to Smartism; a follower of Smartism.  ","word":"Smarta","see_also":["Smartism","Sivathondu","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"The teaching tradition of Hinduism's Smarta sect, formalized by Adi Sankara in the 9th century.  ","word":"Smarta Sampradaya","see_also":["Smartism","Sivathondu","kundalini","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"Sect based on the secondary scriptures (smriti). The most liberal of the four major Hindu denominations, an ancient Vedic brahminical tradition (ca 700 BCE) which from the 9th century onward was guided and deeply influenced by the Advaita Vedanta teachings of the reformist Adi Sankara. Its adherents rely mainly on the classical smriti literature, especially the Itihasas (Ramayana and Mahabharata, the latter of which includes the Bhagavad Gita), Puranas and Dharma Shastras. These are regarded as complementary to and a means to understanding the Vedas. Smartas adhere to Sankara's view that all Gods are but various representations of Saguna Brahman. Thus, Smartas are avowedly eclectic, worshiping all the Gods and discouraging sectarianism. The Smarta system of worship, called panchayatana puja, reinforces this outlook by including the major Deity of each primary Hindu sect of ancient days: Ganesha, Surya, Vishnu, Siva and Shakti. To encompass a sixth important lineage, Sankara recommended the addition of a sixth Deity, Kumara. Thus he was proclaimed shanmata sthapanacharya, founder of the sixfold system. One among the six is generally chosen as the devotee's preferred Deity, Ishta Devata. For spiritual authority, Smartas look to the regional monasteries established across India by Sankara, and to their pontiffs. These are the headquarters of ten orders of renunciate monks who spread the Advaita Vedanta teachings far and wide. Within Smartism three primary religious approaches are distinguished: ritualistic, devotional and philosophical.  ","word":"Smartism","see_also":["Dashanami","panchayatana puja","Sankara","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"A tiny bit, small piece or quantity.  ","word":"smidgen","see_also":["Dashanami","panchayatana puja","Sankara","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"A low-lying layer of polluted air. smog: From smoke plus fog.  ","word":"smog","see_also":["Dashanami","panchayatana puja","Sankara","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"To burn and smoke without flame. Slow combustion. To exist in a suppressed, stifled state.  ","word":"smolder","see_also":["Dashanami","panchayatana puja","Sankara","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"That which is \"remembered;\" the tradition. Hinduism's nonrevealed, secondary but deeply revered scriptures, derived from man's insight and experience. Smriti speaks of secular matters -- science, law, history, agriculture, etc. -- as well as spiritual lore, ranging from day-to-day rules and regulations to superconscious outpourings. 1) The term smriti refers to certain collections of ancient Sanskritic texts: the six or more Vedangas, the four Upavedas, the two Itihasas, and the 18 major Puranas. Among the Vedangas, the Kalpa Vedanga defines codes of ritual in the Shrauta and Shulba Shastras, and domestic-civil laws in the Grihya and Dharma Shastras. Also included as classical smriti are the founding sutras of six ancient philosophies called shad darshana (Sankhya, Yoga, Nyaya, Vaisheshika, Mimamsa and Vedanta). 2) In a general sense, smriti may refer to any text other than shruti (revealed scripture) that is revered as scripture within a particular sect. From the vast body of sacred literature, shastra, each sect and school claims its own preferred texts as secondary scripture, e.g., the Ramayana of Vaishnavism and Smartism, or the Tirumurai of Saiva Siddhanta. Thus, the selection of smriti varies widely from one sect and lineage to another.  ","word":"smriti","see_also":["Mahabharata","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"\"Bathing.\" Ceremonial ablution, especially in sacred waters, traditionally prescribed as an obligatory Hindu duty.  ","word":"snana","see_also":["Mahabharata","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"A trap for catching unawares, especially animals.  ","word":"snare","see_also":["Mahabharata","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"(varna dharma).  ","word":"social dharma","see_also":["dharma","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"A system of government in which private ownership and production is superceded by community or state control.  ","word":"socialism","see_also":["dharma","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"Greek philosopher and teacher (470-399 BCE). His method of question and answer is expressed in the dialogues of Plato, his foremost student.  ","word":"Socrates","see_also":["dharma","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"To reside temporarily in a place.  ","word":"sojourn","see_also":["dharma","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"A comforting of distress, pain or sorrow.  ","word":"solace","see_also":["dharma","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"A major physical and psychic nerve center of the body, located physically at the base of the sternum.  ","word":"solar plexus","see_also":["dharma","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"Ceremoniously observed or performed according to ritual or tradition. Formal, serious, inspiring feelings of awe. -- solemnize:  To consecrate with formal ceremony","word":"solemn","see_also":["dharma","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"An act of speaking to oneself.   ","word":"soliloquy","see_also":["dharma","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"A hermit. One who lives alone and away from all human company.  ","word":"solitary (solitaire)","see_also":["dharma","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"Disciple of Vasugupta and author of Siva Drishti (ca 850 -- 900), which was said to be a highly influential explanation and defense of the Kashmir Saiva philosophy.  ","word":"Somananda","see_also":["Kashmir Saivism","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"Ancient center of Pashupata Saivism located in modern Gujarat state and mentioned in the Mahabharata. The first recorded temple was built there before 100. In 1026 the then fabulously wealthy temple was sacked by Muslim invaders, the Sivalinga smashed and 50,000 brahmins slaughtered. The temple was rebuilt several times and finally demolished by the Moghul emperor Aurangzeb (ca 1700). Sardar Patel, deputy prime minister of India, spearheaded its reconstruction in 1947.  ","word":"Somanath Temple","see_also":["Kashmir Saivism","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"Relating to the body; corporeal, physical, as distinguished from the soul or mind. The somatic currents are the five forms of breath, beginning with prana, the outgoing breath.  ","word":"somatic","see_also":["prana","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"The art of foretelling events.  ","word":"soothsaying","see_also":["prana","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"Technically advanced, refined, elaborated, complex, artful.","word":"sophisticated","see_also":["prana","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"The soul is an immortal and spiritual body of light, the essence of which is Satchidananda and Parasivam, eternal, uncreated and identical with God Siva. The soul animates life and reincarnates again and again until all necessary karmas are created and resolved and its essential unity with God Siva is realized. The soul is the atman of the Vedas.   ","word":"soul","see_also":["prana","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"The soul is an immortal and spiritual body of light, the essence of which is Satchidananda and Parasivam, eternal, uncreated and identical with God Siva. The soul animates life and reincarnates again and again until all necessary karmas are created and resolved and its essential unity with God Siva is realized. The soul is the atman of the Vedas.   ","word":"soul","see_also":["prana","Ramayana","Tirumurai","moksha","prapatti","Sadashiva","Saivism","Satchidananda"],"production_notes":null},{"definition":"Anandamaya kosha (\"sheath of bliss\"), also referred to as the \"causal body\" (karana sharira), \"innermost sheath\" and \"body of light.\" Body of the soul, or soul body, names the soul's manifest nature as an individual being -- an effulgent, human-like form composed of light (quantums). It is the emanational creation of God Siva, destined to one day merge back into Him. During its evolution, the soul functions through four types of outer sheaths that envelope the soul form -- mental, instinctive-intellectual, vital and physical -- and employs the mental faculties of manas, buddhi and ahamkara, as well as the five agents of perception (jnanendriyas) and five agents of action (karmendriyas). The \"soul body\" is not a body in sense of a case, a vessel, vehicle or enclosure for something else. The soul body is the soul itself -- a radiant, self-effulgent, human-like, super-intelligent being. Its very composition is Satchidananda in various subtle levels of manifestation. It is the finest of subatomic forms, on the quantum level. The soul form evolves as its consciousness evolves, becoming more and more refined until finally it is the same intensity or refinement as the Primal Soul, Parameshvara. ","word":"soul body","see_also":["atman","evolution of the soul","kosha","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Shabda. As the darshana, or \"seeing,\" of the Divine is a central article of faith for Hindus, similarly, hearing the Divine is spiritually indispensable. The ears are a center of many nadis connected to inner organs of perception. Gurus may when imparting initiation whisper in the ear of disciples to stimulate these centers and give a greater effect to their instructions. During temple puja, bells ring loudly, drums resound, conches and woodwinds blare to awaken worshipers from routine states of consciousness. Meditation on inner sound, called nada anusandhana, is an essential yoga practice. Listening to the Vedas or other scripture is a mystical process. Traditional music is revered as the nectar of the Divine.  ","word":"sound","see_also":["Aum","nada","Siva consciousness","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Paranada, the first vibration from which creation emanates.  ","word":"Soundless Sound","see_also":["nada","nada","Siva consciousness","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Above or superior to all others. Supreme in rank or authority.   ","word":"sovereign","see_also":["nada","nada","Siva consciousness","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"To scatter or plant, as seeds for cultivation; disseminate; propagate.  ","word":"sow","see_also":["nada","nada","Siva consciousness","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"To stretch across or over, as a bridge spans a river. To cover or take in the whole of something.   ","word":"span","see_also":["nada","nada","Siva consciousness","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A commentary of 52 verses by Vasugupta on the Siva Sutras. Also called the Spanda Sutras.  ","word":"Spanda Karika","see_also":["Vasugupta","Kashmir Saivism","Siva consciousness","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A small burning piece of matter, usually thrown off by a fire. A tiny beginning. To stir or activate.  ","word":"spark","see_also":["Vasugupta","Kashmir Saivism","Siva consciousness","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"fitful, intermittent.  ","word":"spasmodic","see_also":["Vasugupta","Kashmir Saivism","Siva consciousness","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Apparent, seeming to be good, sound, true, correct, without really being so. ","word":"specious","see_also":["Vasugupta","Kashmir Saivism","Siva consciousness","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A series of colored bands which blend one into the other so as to include the entire range of colors, as a rainbow. The entire range of variations of anything, as in the spectrum of all possible emotions.  ","word":"spectrum","see_also":["Vasugupta","Kashmir Saivism","Siva consciousness","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"To conjecture, reflect, think or meditate on a subject without, or with incomplete, evidence.  ","word":"speculate (speculation)","see_also":["meditation","self-reflection","Siva consciousness","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Quartz crystal.\" From sphat, \"to expand; blossom; to burst open or into view.\"  ","word":"sphatika","see_also":["sphatika Sivalinga","self-reflection","Siva consciousness","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Crystal mark of God.\" A quartz-crystal Sivalinga.  ","word":"sphatika Sivalinga","see_also":["San Marga Sanctuary","Sivalinga","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A world. The area, place; the extent or range or action, experience or influence.  ","word":"sphere","see_also":["loka","world","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Relating to, or situated near the spine or spinal cord.  ","word":"spinal","see_also":["loka","world","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Dutch philosopher (1632-1677) who taught a monistic pantheism of one infinite substance, God or nature.  ","word":"Spinoza, Baruch","see_also":["loka","world","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A middle aged or older woman who has never married.  ","word":"spinster","see_also":["loka","world","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Adhyatma prasara. ","word":"spiritual evolution","see_also":["adhyatma prasara","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Adhyatmavikasa. The unfoldment of the spirit, the inherent, divine soul of man. The very gradual expansion of consciousness as kundalini shakti slowly rises through the sushumna. The term spiritual unfoldment indicates this slow, imperceptible process, likened to a lotus flower's emerging from bud to effulgent beauty. Contrasted with development, which implies intellectual study; or growth, which implies character building and sadhana. Sound intellect and good character are the foundation for spiritual unfoldment, but they do not constitute unfoldment in themselves. When philosophical training and sadhana is complete, the kundalini rises safely and imperceptibly, without jerks, twitches, tears or hot flashes. This brings greater willpower, compassion and perceptive qualities.  ","word":"spiritual unfoldment","see_also":["adhyatma prasara","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A large organ near the stomach that stores and filters blood. Psychically, the physical and astral spleen connect the subconscious with the superconscious, carrying negative vibrations out of the body and bringing in positive solar rays. The spleen is unique in that it is so large yet the body can live without it, unlike, for example, the liver. In its absence, other glands of the body will take over the spleen's physical functions, while its astral double continues its psychic functions.  ","word":"spleen","see_also":["adhyatma prasara","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Great brightness, magnificent in richness, beauty or character. Grandeur.  ","word":"splendor (splendid)","see_also":["adhyatma prasara","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Scattered or isolated in occurrence. Happening irregularly, unpredictably and infrequently.  ","word":"sporadic","see_also":["adhyatma prasara","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A partner in a marriage; a husband or wife.  ","word":"spouse","see_also":["adhyatma prasara","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Illegitimate, not true or genuine. ","word":"spurious","see_also":["adhyatma prasara","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"The most well-known yantra and a central image in Shakta worship. Consisting of nine interlocking triangles, it is the design of Siva-Shakti's multidimensional manifestations.  ","word":"Sri Chakra","see_also":["adhyatma prasara","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":" \"Venerable lion.\" Island state off the southeast tip of India, formerly called Ceylon, 80% Buddhist, home to several million Tamil Saivites who live mostly in the arid north. It was a British colony until independence in 1948 as a member of the Commonwealth. Sri Lanka became a republic in 1972. Area: 25,000 square miles; 19 million population.  ","word":"Sri Lanka (Shri Lanka)","see_also":["adhyatma prasara","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"(Canticle) to the Wielder of Awesome Powers.\" Pre-eminent Vedic hymn to Lord Siva as the God of dissolution, chanted daily in Siva temples throughout India. It is in this long prayer, located in the Yajur Veda, Taittiriya Samhita, in the middle of the first three Vedas, that the Saivite mantra Namah Sivaya first appears.  ","word":"Sri Rudram","see_also":["adhyatma prasara","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A saint and philosopher (ca 1050) who promoted a Saivite theology which embraced monism and dualism. Founder of the Saiva school called Siva Advaita, or Siva Vishishtadvaita, teaching a \"Saivite qualified nondualism,\" resembling Ramanuja's Vaishnavite Vishishtadvaita. He was also known as Nilakantha Sivacharya.  ","word":"Srikantha (Shrikantha)","see_also":["Advaita","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Monistic Saiva Siddhanta philosopher (ca 1050) who refuted the Sankaran Vedanta doctrine of maya as illusion and expounded that Siva is both material cause (upadana karana) and efficient cause (nimitta karana).  ","word":"Srikumara (Shrikumara)","see_also":["Advaita","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Monistic Saiva Siddhanta philosopher (ca 1050) who refuted the Sankaran Vedanta doctrine of maya as illusion and expounded that Siva is both material cause (upadana karana) and efficient cause (nimitta karana).  ","word":"Srikumara (Shrikumara)","see_also":["Advaita","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"The summer capital of Jammu & Kashmir.  ","word":"Srinagar (Shrinagara)","see_also":["Advaita","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A Kashmir Saivite teacher of monistic theism.  ","word":"Srinatha (Shrinatha)","see_also":["Durvasas","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Creation, or emanation, represented by Siva Nataraja's upper right hand and the damaru (drum), upon which he beats Paranada, the Primal Sound from which issue forth the rhythms and cycles of creation.  ","word":"srishti","see_also":["Durvasas","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"The creator God\" rides a mouse and holds a noose, a goad, His tusk (representing selfless sacrifice) and a mango. ","word":"Srishti Ganapati","see_also":["Durvasas","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Not flowing or moving; not active or alert; sluggish; foul from lack of movement.  ","word":"stagnant","see_also":["Durvasas","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Physical or mental endurance; resistence to fatigue or illness.  ","word":"stamina","see_also":["Durvasas","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A sudden mad rush of a crowd of people or animals.  ","word":"stampede","see_also":["Durvasas","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Push back, impede, prevent from happening.  ","word":"stave off","see_also":["Durvasas","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Constant. Firm, established, secure. Not wavering or changeable.  ","word":"steadfast","see_also":["Durvasas","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"An unvarying form or pattern; a fixed conventional and oversimplified notion or opinion widely held about a subject, such as an ethnic group, that ignores unique distinctions and subtleties.  ","word":"stereotype","see_also":["Durvasas","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"From stha, \"building\" or \"place,\"and pati, \"lord or father.\" A master of Agamic temple architecture, sculpture, city planning and other traditional building arts. A sthapati must be well versed in the Shilpa Shastras, experienced in all aspects of temple construction, pious, mystically trained and a good administrator, able to direct and guide a team of shilpis, stonecutters, carvers, sculptors, woodworkers, etc. ","word":"sthapati","see_also":["Durvasas","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Science of architecture.\" A class of writings on architecture, sometimes classed as one of the Upavedas. It embodies such works as the Manasara, the Vastu Shastras and the architectural Shilpa Shastra.  ","word":"Sthapatyaveda","see_also":["Upaveda","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Preservation.\"  ","word":"sthiti","see_also":["Nataraja","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Conduct, observances, vocational and spiritual patterns that will most advance a woman in a given lifetime. The parallel pattern for a man is known as purusha dharma.   ","word":"sthree dharma","see_also":["Nataraja","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Gross; physical.\"  ","word":"sthula","see_also":["vak","evolution of the soul","Svayambhu Linga","Parashakti","Parasiva","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Gross or physical body.\" The odic body.  ","word":"sthula sharira","see_also":["actinic","actinodic","kosha","odic","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Drugs that temporarily arouse or accelerate physiological or organic activity. Certain drugs are capable of stimulating psychic experiences, often with unpleasant consequences.  ","word":"stimulants","see_also":["actinic","actinodic","kosha","odic","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Incentive, something that rouses toaction.  ","word":"stimulus","see_also":["actinic","actinodic","kosha","odic","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Miserly. Unwilling or reluctant to give or spend.  ","word":"stingy (stinginess)","see_also":["actinic","actinodic","kosha","odic","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Ancient Greek philosophers who held that all things are governed by natural laws and that the wise follow virtue and remain aloof from the external world and its passions.   ","word":"Stoics","see_also":["actinic","actinodic","kosha","odic","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A narrow waterway; a difficult, dangerous experience or passage in life.  ","word":"straits","see_also":["actinic","actinodic","kosha","odic","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Any measure that suppresses freedom or thwarts or cuts off life.  ","word":"stranglehold","see_also":["actinic","actinodic","kosha","odic","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Making layers.\" The process of organizing or arranging in layers or levels.   ","word":"stratification","see_also":["actinic","actinodic","kosha","odic","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A section or layer of something.  ","word":"stratum","see_also":["actinic","actinodic","kosha","odic","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Woman's duty.\" Traditional conduct, observances, vocational and spiritual patterns which bring spiritual fulfillment and societal stability. Characterized by modesty, quiet strength, religiousness, dignity and nurturing of family. Notably, she is most needed and irreplaceable as the maker of the home and the educator of their children as noble citizens of tomorrow. ","word":"stri dharma","see_also":["actinic","actinodic","kosha","odic","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Vasana chitta (\"mind of subliminal traits\"). The area of the subconscious mind formed when two thoughts or experiences of the same rate of intensity are sent into the subconscious at different times and, intermingling, give rise to a new and totally different rate of vibration. This subconscious formation later causes the external mind to react to situations according to these accumulated vibrations, be they positive, negative or mixed. ","word":"sub-subconscious","see_also":["mind (five states)","actinodic","kosha","odic","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Belongs to the Shukla Yajur Veda. A dialog between sage Subala and Brahma about the Supreme Being as Narayana.  ","word":"Subala Upanishad","see_also":["mind (five states)","actinodic","kosha","odic","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Of the inner parts of atoms; anything smaller than an atom.  ","word":"subatomic","see_also":["mind (five states)","actinodic","kosha","odic","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Samskara chitta. The phase of mind beneath ordinary consciousness. Known as chitta in Sanskrit. The storehouse, the reflection of all previous experiences. All the past experiences of the soul (whether remembered consciously or not), unresolved karma and involuntary physiological processes lie in the subconscious mind. Negative areas of the subconscious mind can be detrimental to a person's spiritual and emotional well-being. Such can be discovered or resolved through meditation, penance, sadhana, temple worship, grace, etc.   ","word":"subconscious mind","see_also":["aura","conscience","mind (five states)","odic","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Personal. Of or colored by the personality, state of mind etc., of the observer (subject). Opposite of objective. Cf: objective.   ","word":"subjective","see_also":["aura","conscience","mind (five states)","odic","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"To refine, lift into something higher, purify. Channeling instinctive energies into more refined expression. Originally, to purify or refine by subliming, changing a substance directly from a solid to a gaseous state, bypassing the liquid state.  ","word":"sublimate","see_also":["ojas","tejas","transmutation","yoni","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Exalted, noble, majestic. Inspiring awe or reverence.  ","word":"sublime","see_also":["ojas","tejas","transmutation","yoni","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Below the threshold of consciousness or apprehension, such as an attitude of which one is not aware. Subconscious.  ","word":"subliminal","see_also":["mind (five states)","tejas","transmutation","yoni","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Yielding to the power of another. Compliance; meekness.  ","word":"submission","see_also":["mind (five states)","tejas","transmutation","yoni","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Very pious; dear to holy men.\" A Name of Lord Karttikeya.  ","word":"Subramanya","see_also":["Karttikeya","tejas","transmutation","yoni","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"162nd satguru (1927 -- 2001) of the Nandinatha Sampradaya's Kailasa Parampara. He was ordained Sivaya Subramuniyaswami by Sage Yogaswami on the full-moon day of May 12, 1949, in Jaffna, Sri Lanka, at 6:21pm. This was just days after he had attained nirvikalpa samadhi in the caves of Jalani. Satguru Sivaya Subramuniyaswami is recognized worldwide as one of foremost Hindu ministers of our times, contributing to the revival of Hinduism in immeasurable abundance. He was simultaneously a staunch defender of traditions, as the tried and proven ways of the past, and a fearless innovator, setting new patterns of life for contemporary humanity. For a brief biography of this remarkable seer and renaissance guru, see \"About the Author\" on page 923 of Dancing with Siva. Gurudeva taught the traditional Saivite Hindu path to enlightenment, a path that leads the soul from simple service to worshipful devotion to God, from the disciplines of meditation and yoga to the direct knowing of Divinity within. His insights into the nature of consciousness provide a key for quieting the external mind and revealing to aspirants their deeper states of being, which are eternally perfect, full of light, love, serenity and wisdom. He urges all seekers to live a life of ahimsa, harmlessness towards nature, people and creatures, an ethic which includes vegetarianism. The name Subramuniya is a Tamil spelling of the Sanskrit Shubhramunya (not to be confused with Subramanya). It is formed from shubhra meaning \"light; intuition,\" and muni, \"silent sage.\" Ya means \"restraint; religious meditation.\" Thus, Subramuniya means a self-restrained soul who remains silent or, when he speaks, speaks out from intuition.   ","word":"Subramuniyaswami","see_also":["Karttikeya","tejas","transmutation","yoni","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"To become less active or less intense. To abate.","word":"subside","see_also":["Essence; real nature; matter;materialpossessions","tejas","transmutation","yoni","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Essence; real nature.   ","word":"substance","see_also":["Essence; real nature; matter;materialpossessions","tejas","transmutation","yoni","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Layer underneath.\" In geology, the layer of rock or other matter forming the foundation of a landscape and acting as its support. In philosophy, that which is \"underneath,\" not visible but the support for all of existence, the substance or underlying force which is the foundation of any and all manifestation: Satchidananda.  ","word":"substratum","see_also":["Parashakti","Satchidananda","tattva","yoni","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Anukarana chitta.  ","word":"subsuperconscious mind","see_also":["kala","mind","tattvas","yoni","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"So slight as to be difficult to detect; elusive; delicate. Not obvious.  ","word":"subtle","see_also":["kala","mind","tattvas","yoni","subtle body","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Sukshma sharira, the nonphysical, astral body or vehicle in which the soul encases itself to function in the Antarloka, or subtle world. The subtle body includes the pranamaya, manomaya and vijnanamaya koshas if the soul is physically embodied. It consists of only manomaya and vijnanamaya after death, when pranamaya kosha disintegrates. And it consists of only vijnanamaya kosha when manomaya kosha is dropped off just before rebirth or when higher evolutionary planes are entered. Also part of the subtle body are the antahkarana (mental faculty: intellect, instinct and ego -- buddhi, manas and ahamkara), the five jnanendriyas (agents of perception: hearing, touch, sight, taste and smell); and the five karmendriyas (agents of action: speech, grasping, movement, excretion and generation).  ","word":"subtle body","see_also":["astral body","indriya","jiva","kosha","reincarnation","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":null,"word":"subtle plane","see_also":["loka","three worlds","jiva","kosha","reincarnation","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A person who follows another, in office or title, as the successor to a satguru or king.  -- succession:  A number of persons or things coming one after another in order; e.g., a spiritual succession.","word":"successor","see_also":["loka","three worlds","jiva","kosha","reincarnation","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"To give in to an overpowering force; give up, yield, surrender.  ","word":"succumb","see_also":["loka","three worlds","jiva","kosha","reincarnation","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Needle; sharp point.\" An index: that which reveals a book.   ","word":"suchi","see_also":["loka","three worlds","jiva","kosha","reincarnation","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Pour beneath, diffuse beneath, spread, as light through clouds or divine energy flowing out from puja or from a holy personage. ","word":"suffuse","see_also":["loka","three worlds","jiva","kosha","reincarnation","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A mystical Islamic tradition in which Muslims seek to find the truth of divine love and knowledge through direct personal experience.  ","word":"Sufism","see_also":["loka","three worlds","jiva","kosha","reincarnation","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"In Living with Siva, a number of forms of sucrose processed from sugar cane. These include \"white sugar\" (the most refined form of sucrose), confectioner's sugar (powdered white sugar) and brown sugar (white sugar with molasses added). Highly refined cane sugar is unhealthy because it is stripped of all of the natural vitamins and minerals which are helpful in the digestion of sugars, causing the body to rob the same vitamins and minerals from the body's stores to assimilate them. Less refined cane sugar products, such as raw sugar, turbinado and sucanat (dried cane juice and molasses), make healthier alternatives. More nutritious sweeteners are maple syrup, date sugar (pulverized dried dates), honey, barley malt, rice syrup, jaggery and molasses.  ","word":"sugar, processed","see_also":["loka","three worlds","jiva","kosha","reincarnation","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Self-killing.\" In Sanskrit, pranatyaga, \"abandoning life force.\" Intentionally ending one's own life through poisoning, drowning, burning, jumping, shooting, etc. Suicide has traditionally been condemned in Hindu scripture because, being an abrupt escape from life, it creates unseemly karma to face in the future. However, in cases of terminal disease or great disability, religious self-willed death through fasting -- prayopavesha -- is permitted. The person making such a decision declares it publicly, which allows for community regulation and distinguishes the act from suicide performed privately in traumatic emotional states of anguish and despair. Ancient lawgivers cite various stipulations: 1) inability to perform normal bodily purification; 2) death appears imminent or the condition is so bad that life's pleasures are nil; 3) the action must be done under community regulation. The gradual nature of prayopavesha is a key factor distinguishing it from sudden suicide, svadehaghata (\"murdering one's body\"), for it allows time for the individual to settle all differences with others, to ponder life and draw close to God, as well as for loved ones to oversee the person's gradual exit from the physical world. In the ideal, highly ritualized practice, one begins by obtaining forgiveness and giving forgiveness. Next a formal vow, mahavrata-marana, \"great vow of death,\" is given to one's guru, following a full discussion of all karmas of this life, especially fully and openly confessing one's wrongdoings. Thereafter, attention is to be focused on scripture and the guru's noble teachings. Meditation on the innermost, immortal Self becomes the full focus as one gradually abstains from food. At the very end, as the soul releases itself from the body, the sacred mantra is repeated as instructed by the preceptor.  ","word":"suicide","see_also":["death","penance","prayopavesha","reincarnation","soul","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Good actions.\" ","word":"sukarma","see_also":["karma","punya","prayopavesha","reincarnation","soul","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Pleasant, easy pose.\" Often applies to any comfortable seating pose. More specificially, a synonym for the swastikasana, in which the legs are crossed, the feet tucked under the knees. ","word":"sukhasana","see_also":["karma","punya","prayopavesha","reincarnation","soul","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Subtle.\"  ","word":"sukshma","see_also":["vak","punya","prayopavesha","reincarnation","soul","purusha","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Subtle body,\" or astral body.  ","word":"sukshma sharira","see_also":["actinic","actinodic","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"To withdraw into silent resentment or ill humor.  ","word":"sulk","see_also":["actinic","actinodic","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"To make dirty or impure.  ","word":"sully (sullied)","see_also":["purity-impurity","actinodic","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Adding up to a total, summing up. Reaching a high point.  ","word":"summation","see_also":["purity-impurity","actinodic","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"The original name of Natha Siddha Tirumular before he trekked to South India from the Himalayas.  ","word":"Sundaranatha","see_also":["Tirumular","actinodic","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Beautiful.\" One of the four Tamil Samayacharyas (ca 800), and composer of devotional hymns to God Siva, which form the seventh book of the Tirumurai. In these, he pleads forthrightly to Siva for material as well as spiritual abundance. ","word":"Sundarar","see_also":["Nayanar","actinodic","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Satchidananda, the Divine Mind of God Siva and of all souls, for \"there is only one mind.\" The superconscious mind is \"the mind of light,\" of omniscient knowing, omnipresent awareness, pure consciousness, truth and love. Within the individual, it is one of the five states of mind: conscious, subconscious, sub-subconscious, sub-superconscious and superconscious. The intuitive or knowing state of mind; \"the mind of light.\" From another perspective, the superconscious is one of the three phases of the mind: instinctive, intellectual and superconscious.   ","word":"superconscious mind","see_also":["Nayanar","actinodic","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Shallow; on the surface; not substantial.  ","word":"superficial","see_also":["Nayanar","actinodic","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Beyond or transcending the natural laws of the physical cosmos. Of or relating to an order of existence beyond the visible universe, referring to events, agencies or knowledge superseding or mystically explaining the laws of nature.  ","word":"supernatural","see_also":["mysticism","shamanism","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A rare and extremely brilliant new star (nova) that suddenly increases up to a billion times in brightness and then diminishes over a period of months or years.  ","word":"supernova","see_also":["mysticism","shamanism","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"To cause to be set aside, especially to displace as inferior.  ","word":"supersede","see_also":["mysticism","shamanism","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A belief or practice not supported by experience or reason.  ","word":"superstition","see_also":["mysticism","shamanism","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"To ask for, beg humbly. To earnestly pray for.  ","word":"supplicate (supplication)","see_also":["mysticism","shamanism","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Subdued; ended forcibly. Kept from being revealed; inhibited. Deliberately excluded from the mind, such as with unacceptable desires or thoughts.  ","word":"suppressed","see_also":["mysticism","shamanism","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Desires, thoughts or memories consciously excluded or hidden from awareness. Related to repression, in which similar desires, etc., are hidden away in a completely subconsciousmanner.  ","word":"suppression","see_also":["mysticism","shamanism","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"One of the 28 Saiva Siddhanta Agamas, this scripture discusses temple worship, especially personal devotions, festivals, practices and initiations for each stage of life. A total of 4,666 verses have been preserved from the original scripture.  ","word":"Suprabheda Agama","see_also":["mysticism","shamanism","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Highest in rank, power, authority.   ","word":"supreme","see_also":["mysticism","shamanism","kosha","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Highest God, the source or creator of all other Gods, beings and all manifestation.  ","word":"Supreme God","see_also":["Nataraja","perfections","Siva","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Blind North-Indian Vaishnava poet (ca 1550), famous for his devotional hymns to Lord Krishna. His massive writing Sursagar, \"Sur's Ocean,\" is widely read.  ","word":"Surdas","see_also":["Nataraja","perfections","Siva","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"To excel; to be superior to.  ","word":"surpass","see_also":["Nataraja","perfections","Siva","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Giving up or yielding. Surrender to the Divine is called prapatti, a complete giving over of oneself to God's will in total trust and abandonment.  ","word":"surrender","see_also":["bhakti","prapatti","sacrifice","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Sun.\" One of the principal Divinities of the Vedas, also prominent in the epics and Puranas. Saivites revere Surya, the Sun God each morning as Siva Surya. Smartas and Vaishnavas revere the golden orb as Surya Narayana. As the source of light, the sun is the most readily apparent image of Divinity available to man. As the giver of life, Surya is worshiped during harvest festivals everywhere. Esoterically, the sun represents the point where the manifest and unmanifest worlds meet or unite. In yoga, the sun represents the masculine force, pingala. Surya also signifies the Self within. In the Vedic description of the course of souls after death, the \"path of the sun\" leads liberated souls to the realm of Brahman; while the path of the moon leads back to physical birth.   ","word":"Surya","see_also":["bhakti","prapatti","sacrifice","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Most gracious channel.\" Central psychic nerve current within the spinal column.  ","word":"sushumna nadi","see_also":["kundalini","nadi","samadhi","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Deep sleep.\" A state more refined than the ordinary dream state. The perceptions of sushupti are often too subtle to be remembered upon awakening. This is the state of visionary dreams. One of the four avasthas described in the Mandukya Upanishad.  ","word":"sushupti","see_also":["avastha","consciousness","samadhi","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Maintainable; able to be kept up or continued consistently over a period of time.  ","word":"sustainable","see_also":["avastha","consciousness","samadhi","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Support. That which preserves life, or gives strength. Nourishment.  ","word":"sustenance (to sustain)","see_also":["avastha","consciousness","samadhi","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A chapter of the Skanda Purana dealing in part with philosophy.  ","word":"Suta Samhita","see_also":["avastha","consciousness","samadhi","odic","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Great abyss.\" Region of obsessive jealousy and retaliation. The third chakra below the muladhara, centered in the knees. Corresponds to the third astral netherworld beneath the Earth's surface, called Samhata (\"abandoned\") or Sutala.  ","word":"sutala","see_also":["chakra","hell","loka","Naraka","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Thread.\" An aphoristic verse; the literary style consisting of such maxims. From 500 BCE, this style was widely adopted by Indian philosophical systems and eventually employed in works on law, grammar, medicine, poetry, crafts, etc. Each sutra is often accompanied by a commentary called bhashya and sometimes subcommentary called tika, vyakhyana or tippani. Through the media of short, concise, easily memorized sutras, vast amounts of knowledge were preserved. Reciting relevant sutra texts from memory is a daily sadhana in various Hindu arts and sciences. Sutra also names the wife's wedding pendant (mangala sutra).  ","word":"sutra","see_also":["bhashya","wedding pendant","loka","Naraka","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"One's own way.\"  ","word":"svadharma","see_also":["dharma","wedding pendant","loka","Naraka","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"One's own base.\"  ","word":"svadhishthana","see_also":["chakra","wedding pendant","loka","Naraka","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Self-study.\" The study of truth, especially through religious scripture. The fourth of five niyamas, or ethical practices, listed by sage Patanjali in his 2,200-year-old Yoga Sutras. It is essentially the equivalent of Siddhantasravana, the corresponding practice listed in the Sandilya Upanishad and other texts which include ten niyamas rather than five.  ","word":"svadhyaya","see_also":["yama-niyama","wedding pendant","loka","Naraka","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Dream.\" Astral consciousness. The sleeping-dreaming state of subtle perception and experience. One of the four states of consciousness, avasthas, described in the Mandukya Upanishad.  ","word":"svapna","see_also":["Seeavastha","consciousness","loka","Naraka","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Abode of light.\" An intermediate realm of the Antarloka; a term essentially synonymous with Svarloka. ","word":"svarga","see_also":["loka","consciousness","loka","Naraka","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Celestial (or bright) plane.\" The third of the seven upper worlds, the mid-astral region (equated in some texts with Svarga), realm of manipura chakra.  ","word":"Svarloka","see_also":["loka","consciousness","loka","Naraka","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"The golden actinic body, which is formed after many experiences of Self Realization.  ","word":"svarnasharira","see_also":["vishvagrasa","anandamayakosha","loka","Naraka","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"The final merging with Siva where there exists no individual soul, only Siva.  ","word":"svarnasharira vishvagrasa","see_also":["vishvagrasa","anandamayakosha","loka","Naraka","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":null,"word":"Svatmarama","see_also":["Hatha Yoga Pradipika","anandamayakosha","loka","Naraka","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Self-existent mark or sign of God.\" Names a Sivalinga discovered in nature and not carved or crafted by human hands; often a smooth cylindrical stone, called banalinga, such as found in India's Narmada River.  ","word":"svayambhu Linga ","see_also":["Sivalinga","anandamayakosha","loka","Naraka","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Self-existent image.\" A Deity image discovered in nature, and not carved or crafted by human hands.  ","word":"svayambhu murti","see_also":["murti","anandamayakosha","loka","Naraka","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"One of the 28 Saiva Siddhanta Agamas.  ","word":"Svayambhuva Agama","see_also":["Saiva Agama","anandamayakosha","loka","Naraka","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A subsidiary text of the Saiva Agamas.  ","word":"Svayambhuva Sutra(s)","see_also":["Saiva Agama","anandamayakosha","loka","Naraka","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Lord; owner; self-possessed.\" He who knows or is master of himself. A respectful title for a Hindu monk, usually a sannyasin, an initiated, orange-robed renunciate, dedicated wholly to religious life. As a sign of respect, the term swami is sometimes applied more broadly to include non-monastics dedicated to spiritual work. ","word":"swami (svami)","see_also":["monk","sannyasa dharma","sannyasin","Naraka","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"The feminine form of swami.  ","word":"swamini","see_also":["monastic","nun","sannyasa","swami","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"\"Sign of auspiciousness,\" From su (\"wellness,\" \"auspiciousness\") and astu, \"be it so.\" The ancient Hindu symbol of auspiciousness and good fortune, representing the sun and often associated with Ganesha. The right-angled arms of the swastika denote the indirect way in which Divinity is reached -- through intuition and not by intellect -- and how life is filled with change and indirection. It has been a prominent symbol in many cultures. (Svastu is a salutation meaning \"blessings,\" \"good health,\" or \"may it be well with you.\") ","word":"swastika","see_also":["murti","nun","sannyasa","swami","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"To move in a whirling, circular motion, like a whirlpool.  ","word":"swirl","see_also":["murti","nun","sannyasa","swami","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"The representation of one thing by something else. E.g., the damaru, Siva's drum, is a symbol of creation.   ","word":"symbolism","see_also":["murti","nun","sannyasa","swami","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"The part of the autonomic nervous system originating in the thoracic and lumbar regions of the spinal cord that in general inhibits or opposes the physiological effects of the parasympathetic nervous system, as in tending to reduce digestive secretions, speeding up the heart, and contracting blood vessels.  ","word":"sympathetic nervous system","see_also":["murti","nun","sannyasa","swami","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Indicative,showing the signs of a disease or a condition.  ","word":"symptomatic","see_also":["murti","nun","sannyasa","swami","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A combination of various beliefs and practices, often of opposing views formed into a one creed or system of belief, typically marked by inconsistencies.  ","word":"syncretism","see_also":["universalist","nun","sannyasa","swami","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A pattern or set of characteristics or symptoms typifying a certain disease or condition.  ","word":"syndrome","see_also":["universalist","nun","sannyasa","swami","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Having the same or similar meaning. Quality of two words or phrases whose meanings are identical.  ","word":"synonymous","see_also":["universalist","nun","sannyasa","swami","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"A brief outline or summary. An overview presentation.  ","word":"synopsis","see_also":["universalist","nun","sannyasa","swami","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"Here: the application of reason to reach a particular conclusion from general concepts; also the combination of ideas to form a new idea.  ","word":"synthesis","see_also":["universalist","nun","sannyasa","swami","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null},{"definition":"To draw off of, take away or channel from.  ","word":"syphon","see_also":["universalist","nun","sannyasa","swami","soul","subtle body","quantum","Satchidananda","spiritual unfoldment"],"production_notes":null}],"results":510}