{"entries":[{"definition":"\"Utterance.\" Short, insightful devotional poems written by the early Vira Saiva sharana saints. Full of wit and brilliant philosophy, they are the basis for Lingayat philosophy and practice.   ","word":"Vachana","see_also":null,"production_notes":null},{"definition":"Indecisiveness, constantly changing from one focus of attention to another.  ","word":"vacillation","see_also":null,"production_notes":null},{"definition":"A state of emptiness; a void.  ","word":"vacuum","see_also":null,"production_notes":null},{"definition":"\"Word-giving.\" Marriage engagement ceremony.  ","word":"vagdana","see_also":["samskaras of adulthood"],"production_notes":null},{"definition":"\"Bearing, carrying or conveying.\" Each Hindu God is depicted as riding an animal or bird vahana, which is symbolic of a function of the God. For example, Siva rides the bull, a symbol of strength and potency. Karttikeya rides the peacock, mayura, emblem of beauty and regality.  ","word":"vahana","see_also":["samskaras of adulthood"],"production_notes":null},{"definition":"\"The way of the Vedas.\" An alternate term for Hinduism.  ","word":"Vaidika Dharma","see_also":["Hinduism"],"production_notes":null},{"definition":"\"Versed in science; learned; a doctor.\"  ","word":"vaidya","see_also":["ayurveda vaidya"],"production_notes":null},{"definition":"\"Proceeding from lightning.\" Electric energy. ","word":"vaidyuta","see_also":["ayurveda vaidya"],"production_notes":null},{"definition":"A festival held on Vishakha nakshatra, near the full moon day of the Tamil month of Vaikasi, May-June, to celebrate the creation, or \"birth,\" of Lord Karttikeya. It is a time of gift-giving to panditas and great souls, weddings, feedings for the poor, caring for trees, spiritual initiation and conclaves of holy men.   ","word":"Vaikasi Vishakham","see_also":["ayurveda vaidya"],"production_notes":null},{"definition":"\"The faculty of speech.\"  ","word":"vaikhari vak","see_also":["vak"],"production_notes":null},{"definition":"\"Vishnu's heaven.\"  ","word":"Vaikuntha","see_also":["Vaishnavism"],"production_notes":null},{"definition":"\"Dispassionate one.\" An ascetic who lives by the principle of vairagya. Also names a particular class of mendicants, generally Vaishnavas, of North India who have freed themselves from worldly desires.  ","word":"vairagi","see_also":["monk","sannyasa","tyaga"],"production_notes":null},{"definition":"\"Dispassion; aversion.\" Freedom from passion. Distaste or disgust for worldliness because of spiritual awakening. Also, the constant renunciation of obstacles on the path to liberation. Ascetic or monastic life.  ","word":"vairagya","see_also":["monk","sannyasa","tyaga"],"production_notes":null},{"definition":"\"Distinctionism;\" \"differentiation.\" A philosophical school (ca 600 BCE) that focuses on the categories of existence.  ","word":"Vaisheshika","see_also":["shad darshana","sannyasa","tyaga"],"production_notes":null},{"definition":"\"Way of Vishnu.\" Of or relating to Vishnu. A follower of Lord Vishnu or His incarnations, such as Krishna or Rama.  ","word":"Vaishnava","see_also":["Vaishnavism","sannyasa","tyaga"],"production_notes":null},{"definition":"One of the four major religions, or denominations of Hinduism, representing roughly half of the world's one billion Hindus. It gravitates around the worship of Lord Vishnu as Personal God, His incarnations and their consorts. The doctrine of avatara (He who descends), especially important to Vaishnavism, teaches that whenever adharma gains ascendency in the world, God takes a human birth to reestablish \"the way.\" There are either 10, 22 or 34 avataras of Vishnu, according to various scriptures. The most renowned avataras were Rama and Krishna. The last to come will be Kalki, the harbinger of a golden age on Earth. Vaishnavism stresses the personal aspect of God over the impersonal, and bhakti (devotion) as the true path to salvation. The goal of Vaishnavism is the attainment of mukti, defined as blissful union with God's body, the loving recognition that the soul is a part of Him, and eternal nearness to Him in Vaikuntha, heaven. Foremost among Vaishnava scriptures are the Vaishnava Agamas, Bhagavad Gita and Bhagavata Purana. Among the earliest schools were the Pancharatras and the Bhagavatas. The five major contemporary schools (founded between 1000 and 1500) are those of Ramanuja (Shri Vaishnavism), Madhva, Nimbarka, Vallabha and Chaitanya. Philosophically they range from Madhva's pure dualism to Vallabha's lofty monistic vision.   ","word":"Vaishnavism (Vaishnava)","see_also":["Vaishnavism","sannyasa","tyaga"],"production_notes":null},{"definition":"Of or relating to Vishnu; same as Vaishnava. A follower of Vishnu or His incarnations.  ","word":"Vaishnavite","see_also":["Vaishnavism","Vishnu","tyaga"],"production_notes":null},{"definition":"\"Referring to all human beings.\" A term referring to the waking state of beings in general, the cosmic soul in the conscious mind. Vaishvanara is one of the four states of consciousness, avasthas. It is a name for agni, as the fire that controls body, mind and emotions in the waking state. Also an alternate term for jagrat, wakefulness.  ","word":"vaishvanara","see_also":["avastha","jagrat","tyaga"],"production_notes":null},{"definition":"\"Landowner; merchant.\" The social class of bankers, businessmen, industrialists; employers. Merchant class, originally those whose business was trade as well as agriculture.  ","word":"vaishya","see_also":["varna dharma","jagrat","tyaga"],"production_notes":null},{"definition":"\"Lightningbolt.\" Also vajratrishula. A symbol of spiritual power. Usually two tridents, without staffs, joined together with the two sets of three prongs pointing away from one another at 180. Vajra can also refer to the single trident. ","word":"vajra","see_also":["varna dharma","jagrat","tyaga"],"production_notes":null},{"definition":"\"Speech.\" Theologically, it is through the supreme Vak (or Paravak), the \"Primal Word\" of the Vedas, and its various aspects, that creation issues forth. Vak, the word, is said to descend in four cosmic steps or levels: mahakarana, the great causal; karana, the causal, the mind principle; sukshma, the vital life force; and sthula, physical matter. These correspond to the four states, avasthas, of consciousness: jagrat, wakefulness; svapna, dreaming; sushupti, deep sleep; and turiya, the fourth. Related to the human microcosm in the tantrika tradition, vak is correlated to the chakras. Paravak, the great causal, mahakarana, is said to center in the base of the spinal column in the muladhara chakra, the abode of Ganapati as Brahmanaspati, Master of the Word. Pasyanti vak, \"the word that perceives,\" is located in the navel center, manipura chakra. Madhyama vak, the intermediate word, is centered between the navel and the throat, from whence speech, vaikhari vak, is expressed. Ganapati as Brahmanaspati is the Master of the Word, the Lord of Satya Mantra. And so, the Tantra conceives Him having His abode in the muladhara of beings, from where speech originates in the form of Paravak. ","word":"vak","see_also":["varna dharma","jagrat","tyaga"],"production_notes":null},{"definition":"\"He of crooked trunk.\" An aspect of Lord Ganesha cited in the Mudgala Purana as the conqueror of matsara, jealousy. ","word":"Vakratunda","see_also":["varna dharma","jagrat","tyaga"],"production_notes":null},{"definition":"\"Right-turning.\" A term for the rather rare images of Ganesha in which the trunk is turning to the Deity's right. Cf: edampuri. ","word":"valampuri","see_also":["varna dharma","jagrat","tyaga"],"production_notes":null},{"definition":"\"Ritual worship; revering, following.\" The acts of adoration of the Divine, expressed in many practices and ways.  ","word":"valipadu","see_also":["varna dharma","jagrat","tyaga"],"production_notes":null},{"definition":"\"Beloved teacher.\" Vaishnava saint (ca 1475-1530) whose panentheistic Shuddha Advaita (pure nondualism) philosophy became the essential teaching of the nonascetic Vaishnava sect that bears his name. He composed 17 works, most importantly commentaries on the Vedanta and Mimamsa Sutras and the Bhagavata Purana. The stories of his 84 disciples are often repeated on festive occasions by followers. The sect is strongest in Gujarat.  ","word":"Vallabhacharya","see_also":["Vedanta","jagrat","tyaga"],"production_notes":null},{"definition":"Marked courage or bravery.  ","word":"valor","see_also":["Vedanta","jagrat","tyaga"],"production_notes":null},{"definition":"1) \"Pleasant; beautiful; benignant; striving after\" -- as in Vamadeva, a name of Siva. 2) \"Left; crooked; acting in the opposite way\" -- as in vama marga, the left-handed tantric path.\"  ","word":"vama","see_also":["left-handed","tantrism","tyaga"],"production_notes":null},{"definition":"The Tamil equivalent to namaskara.  ","word":"vanakkam","see_also":["left-handed","tantrism","tyaga"],"production_notes":null},{"definition":"\"Forest-dweller stage.\"  ","word":"vanaprastha ashrama","see_also":["ashrama dharma","shashtyabda purti","tyaga"],"production_notes":null},{"definition":"To defeat or conquer in conflict or competition.  ","word":"vanquish","see_also":["victors and vanquished","shashtyabda purti","tyaga"],"production_notes":null},{"definition":"\"The boon-giver\" is the murti distinguished by the prominent third eye, dish of honey and crowning crescent moon. ","word":"Varada Ganapati","see_also":["victors and vanquished","shashtyabda purti","tyaga"],"production_notes":null},{"definition":"\"Boon-giving gesture.\" A hand pose shown by the Gods or a guru, in which the palm hangs loose at the wrist, facing the benefactor, with the fingers pointing downward, usually outstretched. ","word":"varada mudra","see_also":["victors and vanquished","shashtyabda purti","tyaga"],"production_notes":null},{"definition":"\"Lord of boons.\" The Ganesha murti enshrined at the Mahad Hamlet Temple of Maharashtra. ","word":"Varada Vinayaka","see_also":["victors and vanquished","shashtyabda purti","tyaga"],"production_notes":null},{"definition":"A minor Upanishad of the Krishna Yajur Veda.  ","word":"Varaha Upanishad","see_also":["victors and vanquished","shashtyabda purti","tyaga"],"production_notes":null},{"definition":"Also known as Kasi (Kashi) or Banaras. One of the most holy of Saivite cities, and among the oldest cities in the world. Located in North India on the Ganges River. Hindus consider it highly sanctifying to die in Kasi, revering it as a gateway to moksha. ","word":"Varanasi","see_also":["victors and vanquished","shashtyabda purti","tyaga"],"production_notes":null},{"definition":"\"External appearance,\" covering; type, species, kind, color; caste. The four varnas are as follows. -- brahmin (brahmana): \"Mature, evolved soul.\" Scholarly, pious souls of exceptional learning. Hindu scriptures traditionally invest the brahmin class with the responsibility of religious leadership, including teaching and priestly duties. -- kshatriya: \"Governing; endowed with sovereignty.\" Lawmakers and law enforcers and military, also known as rajanya. -- vaishya: \"Landowner, merchant.\" Businessmen, financiers, industrialists; employers. Those engaged in business, commerce and agriculture. -- shudra: \"Worker, servant.\" Skilled artisans and laborers. It is in keeping with varna dharma that sons are expected to follow the occupation of their father, as that is the occupation that was chosen prior to birth.  ","word":"varna","see_also":["varna dharma","jati","tyaga"],"production_notes":null},{"definition":"\"The way of one's kind.\" The hereditary social class system, generally referred to as caste, established in India in ancient times. Within varna dharma are the many religious and moral codes which define human virtue. Varna dharma is social duty, in keeping with the principles of good conduct, according to one's community, which is generally based on the craft or occupation of the family. Strictly speaking it encompasses two interrelated social hierarchies: 1) varna, which refers to the four classes: brahmin, kshatriya, vaishya and shudra; and 2) jati, the myriad occupational subgroups, or guilds, which in India number over 3,000. Hence this dharma is sometimes called jati dharma. The class-caste system is still very much a part of Indian life today. Many modern Hindus propose that social status is now (and was originally) more properly determined by a person's skills and accomplishments than by birth. Mobility between jatis, or castes, within Hindu communities worldwide is limited but not impossible, and is accomplished through marrying into a new jati, or changing professions through persistence, skill and education. Shastris say that once a person breaks out of his varna or jati of birth and changes \"caste,\" it takes three generations for his family to become fully established in that new strata of society, provided the continuity is unbroken. The varna dharma system -- despite its widespread discrimination against harijans, and the abuse of social status by higher castes -- ensures a high standard of craftsmanship, a sense of community belonging, family integrity and religio-cultural continuity. Caste is not unique to Hinduism and India. By other names it is found in every society. The four varnas, or classes, and myriad jatis, occupational castes, or guilds, form the basic elements of human interaction. ","word":"varna dharma","see_also":["varna dharma","jati","tyaga"],"production_notes":null},{"definition":"\"The way of one's caste and stage of life.\" Names the social structure of four classes (varna), hundreds of castes (jati) and four stages of life (ashramas). It is the combined principles of varna dharma and ashrama dharma.  ","word":"varnashrama dharma","see_also":["ashrama dharma","dharma","varna dharma"],"production_notes":null},{"definition":"\"Abode.\" Subconscious inclinations. From vas, \"dwelling, residue, remainder.\" The subliminal inclinations and habit patterns which, as driving forces, color and motivate one's attitudes and future actions. Vasanas are the conglomerate results of subconscious impressions (samskaras) created through experience. Samskaras, experiential impressions, combine in the subconscious to form vasanas, which thereafter contribute to mental fluctuations, called vritti. The most complex and emotionally charged vasanas are found in the dimension of mind called the sub-subconscious, or vasana chitta.  ","word":"vasana","see_also":["mind (five states) samskara","vasana daha tantra","vritti"],"production_notes":null},{"definition":"\"Purification of the subconscious by fire.\" Daha means burning, tantra is a method, and vasanas are deep-seated subconscious traits or tendencies that shape one's attitudes and motivations. Vasanas can be ether positive or negative. One of the best methods for resolving difficulties in life, of dissolving troublesome vasanas, the vasana daha tantra is the practice of burning confessions, or even long letters to loved ones or acquaintances, describing pains, expressing confusions and registering grievances and long-felt hurts. Also called spiritual journaling, writing down problems and burning them in any ordinary fire brings them from the subconscious into the external mind, releasing the supressed emotion as the fire consumes the paper. This is a magical healing process. -- maha vasana daha tantra: The special sadhana of looking back over and writing about the various aspects of one's life in order to clear all accumulated subconscious burdens, burning the papers as done in the periodic vasana daha tantra. Ten pages are to be written about each year. Other aspects of this tantra include writing about people one has known (people check), all sexual experiences (sex check).  ","word":"vasana daha tantra","see_also":["vasana","vasana daha tantra","vritti"],"production_notes":null},{"definition":"\"Mind of subliminal traits.\" The subsubconscious mind.  ","word":"vasanachitta","see_also":["mind (fivestates)","vasana daha tantra","vritti"],"production_notes":null},{"definition":"Disciple of Maharishi Nandikesvara (Nandinatha) (ca 250 BCE) along with Patanjali and Vyaghrapada (as recorded in Panini's book of grammar). Also the name of several other famous sages, including the rishi attributed with composing the hymns of the Rig Veda's seventh mandala, another who plays a central role in the epics and certain Puranas and Upanishads, and a third who expounds the ancient yogic wisdom to Lord Rama in the 29,000-verse Yoga Vasishtha.   ","word":"Vasishtha","see_also":["mind (fivestates)","vasana daha tantra","vritti"],"production_notes":null},{"definition":"Various ancient texts on vastu, \"the science of time and space,\" in the words of renowned Indian architect, Sri V. Ganapati Sthapati. The Vastu Shastras are categorized as part of the Sthapatyaveda, science of architecture, classed among the Upavedas, which are secondary Vedic texts discussing such areas as statecraft, health and music. Vastu unfolds the scientific principles and models of spiritual art and architecture to yield a harmonious flow of energy in the physical environment, giving rise to good health, wealth, intelligence and happiness.  ","word":"Vastu Shastras","see_also":["mind (fivestates)","vasana daha tantra","vritti"],"production_notes":null},{"definition":"Celebrated preceptor (ca 800) whose finding of the Siva Sutras catalyzed the reemergence of the ancient Kashmir Saiva tradition. It is said that he discovered the 77 sutras carved in a rock on Mahadeva mountain after a visionary dream in which Lord Siva told him of their location. The sacred rock, named Shankarpal, is revered to this day.  ","word":"Vasugupta","see_also":["Kashmir Saivism","Siva Sutras","vritti"],"production_notes":null},{"definition":"The banyan tree, Ficus indicus, sacred to Siva. Thought to derive from vat, \"to surround, encompass\" -- also called nyagrodha, \"growing downwards.\" Ancient symbol of the Sanatana Dharma. Its relative, the ashvattha, or pipal tree, is given in the Upanishads as a metaphor for creation, with the \"roots above and the branches below.\"  ","word":"vata","see_also":["Kashmir Saivism","Siva Sutras","vritti"],"production_notes":null},{"definition":"An arched roof, ceiling or chamber.  ","word":"vault","see_also":["Kashmir Saivism","Siva Sutras","vritti"],"production_notes":null},{"definition":"\"Wisdom.\" Sagely revelations which comprise Hinduism's most authoritative scripture. They, along with the Agamas, are shruti, that which is \"heard.\" The Vedas are a body of dozens of holy texts known collectively as the Veda, or as the four Vedas: Rig, Yajur, Sama and Atharva. In all they include over 100,000 verses, as well as additional prose. The knowledge imparted by the Vedas ranges from earthy devotion to high philosophy. Each Veda has four sections: Samhitas (hymn collections), Brahmanas (priestly manuals), Aranyakas (forest treatises) and Upanishads (enlightened discourses). The Samhitas and Brahmanas (together known as the karmakanda, \"ritual section\") affirm a transcendent-immanent Supreme-Being cosmology and a system of worship through fire ceremony and chanting devotional hymns to establish communication with the Gods. The Aranyakas and Upanishads (the jnanakanda, \"knowledge section\") outline the soul's evolutionary journey, providing yogic-philosophic training and propounding a lofty, nondual realization as the destiny of all souls. The oldest portions of the Vedas are thought by some to date back as far as 6,000 bce, written down in Sanskrit in the last few millennia, making them the world's most ancient scriptures.  ","word":"Veda","see_also":["Aranyaka","Brahmana","shruti","Upanishad","Vedanga"],"production_notes":null},{"definition":"\"Veda-limb.\" Six branches of post-Vedic studies revered as auxiliary to the Vedas. Four Vedangas govern correct chanting of the Vedas: 1) Shiksha (phonetics), 2) Chhandas (meter), 3) Nirukta (etymology), 4) Vyakarana (grammar). The two other Vedangas are 5) Jyotisha Vedanga (astronomy-astrology) and 6) Kalpa Vedanga (procedural canon) which includes the Shrauta and Shulba Shastras (ritual codes), Dharma Shastras (social law) and Grihya Shastras (domestic codes).  ","word":"Vedanga","see_also":["Kalpa Vedanga and respective entries","Brahmana","shruti","Upanishad","Vedanga"],"production_notes":null},{"definition":"\"Ultimate wisdom\" or \"final conclusions of the Vedas.\" Vedanta is the system of thought embodied in the Upanishads (ca 1500-600 BCE), which give forth the ultimate conclusions of the Vedas. Through history there developed numerous Vedanta schools, ranging from pure dualism to absolute monism. The Vedanta perspective elucidated in Dancing with Siva is Advaita Ishvaravada, \"monistic theism\" or panentheism, exemplified in the Vedanta-Siddhanta of Rishi Tirumular (ca 250 BCE) of the Nandinatha Sampradaya in his Tirumantiram, which is a perfect summation of both the Vedas and the Agamas. This is a dipolar reconciliation of monism and dualism which, as philosopher-statesman Dr. S. Radhakrishnan (1888 -- 1975) declared, best describes the philosophy of the Upanishads. After ca 700 CE, many other schools evolved, each establishing itself through written commentaries on the major Upanishads, the Bhagavad Gita and the Brahma Sutras. The latter text, by Badarayana (ca 400 BCE), is the earliest known systematization of Vedanta, but its extremely terse aphorisms are philosophically cryptic without commentary. During the \"scholastic era\" (700 -- 1700), three main variations of the original Vedanta were developed: 1) Advaita Vedanta, or pure nondualism, exemplified by Sankara (788 -- 820); 2) Vishishtadvaita Vedanta, or qualified nondualism, most fully expressed by Ramanuja (1017 -- 1137); and 3) Dvaita Vedanta, expounded by Madhva (1197 -- 1278). Panentheism is embodied in those qualified nondual Vedanta schools that accept the ultimate identity of the soul and God. Examples are the Vishishtadvaita of Bhaskara (ca 950), the Shuddha Advaita, \"pure nondualism,\" of Vallabha (ca 1475 -- 1530) and, to a lesser degree, the Vishishtadvaita of Ramanuja. In summary: Madhva, the dualist, conceives Brahman to be the Personal God. In his philosophy, the universe, souls and God are all separate from one another and real. Ramanuja, the qualified nondualist, also conceives Brahman to be the Personal God. In his philosophy, God must not be considered apart from the world and souls, for the three together form a one whole. The world and souls are real as the body of God, and the individual soul feels himself to be part of God. Sankara, the strict advaitist, conceives Brahman to be the Impersonal God, the Absolute. Sankara does not deny the existence of the Personal God, known as Ishvara, but declares Ishvara to be equally as unreal as the universe and the individuality of the soul. In truth, the only Reality is the Absolute, and man is that Absolute. To Rishi Tirumular, the panentheist, there is an eternal oneness of God and man at the level of their inner Being, but a difference is acknowledged during the evolution of the soul. Ultimately even this difference merges in identity. Thus, there is perfectly beginningless oneness and a temporary difference which resolves itself in perfect identity. Vedanta is one of the six classical philosophies (shad darshanas) along with Nyaya, Vaisheshika, Sankhya, Yoga and Mimamsa. Vedanta is also called Uttara Mimamsa, \"upper or later examination,\" as distinguished from Purva Mimamsa, which concerned itself solely with the earlier portions of the Veda. Other important schools of Vedanta include the Dvaitadvaita, \"dual-nondualism,\"of Nimbarka (ca 1150), and the Achintya Bhedabheda, \"unthinkable difference-nondifference,\" of Chaitanya (1485 -- 1534).  ","word":"Vedanta","see_also":["acosmic pantheism","Advaita Ishvaravada","dvaita-advaita","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"An adherent of Vedanta.  ","word":"Vedantin","see_also":["acosmic pantheism","Advaita Ishvaravada","dvaita-advaita","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Wisdom.\" Composed 1500-500 b.c.e., four companion scriptures--Rig, Yajur, Sama, Atharva--consisting of roughly 20,000 Sanskrit verses that form Hinduism's primary scripture (along with the Agamas). Transmitted to man from God Siva and the Gods through the superconscious faculties of the rishis, the Veda are sruti, \"that which is heard.\" Because the mystic knowledge described in the Vedas cannot be experienced through man's intellect, these scriptures are considered superconscious wisdom. Originally, the Vedas were passed down orally, only taking written form centuries after their inception. Each Veda is comprised of four sections: Samhitas, Brahmanas, Aranyakas and Upanishads. The Samhitas and Brahmanas detail a transcendent\/immanent Supreme Being cosmology and a system of worship through fire ceremony and chanting to establish communication with the Gods. The Aranyakas and Upanishads outline the soul's evolutionary journey, provide yogic\/philosophic training and propound a lofty, non-dual realization as the destiny of all souls.   ","word":"Vedas","see_also":["acosmic pantheism","Advaita Ishvaravada","dvaita-advaita","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":null,"word":"Vedic astrology","see_also":["jyotisha","Advaita Ishvaravada","dvaita-advaita","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Simultaneously drawing from and complying with both of Hinduism's revealed scriptures (shruti), Vedas and Agamas, which represent two complementary, intertwining streams of history and tradition. The difference between Siddhanta and Vedanta is traditionally described in the way that while the Vedas represent man looking for God, the Agamas hold the perspective of God looking to help man. This is reflected in the fact that while the Vedas are voiced by rishis, God or the Goddess is the bestower of truth in the Agama texts. ","word":"Vedic-Agamic","see_also":["grace","shruti","dvaita-advaita","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Shakahara. Of a diet which excludes meat, fish, fowl and eggs. Vegetarianism is a principle of health and environmental ethics that has been a keystone of Indian life for thousands of years. Vegetarian foods include grains, fruits, vegetables, legumes and dairy products. Natural, fresh foods, locally grown, without insecticides or chemical fertilizers, are preferred. The following foods are minimized: frozen and canned foods, highly processed foods, such as white rice, white sugar and white flour; and \"junk\" foods and beverages (those with abundant chemical additives, such as artificial sweeteners, colorings, flavorings and preservatives). One observing a vegetarian diet is called a shakahari.  ","word":"vegetarian","see_also":["guna","mansahari","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"The priciples and practices of vegetarians.  ","word":"vegetarianism","see_also":["vegetarian","mansahari","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"A vegetable. A vegetarian.  ","word":"veggie","see_also":["Seenon-veggie","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"With great intensity; fervently.  ","word":"vehemently","see_also":["Seenon-veggie","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"A piece of cloth used to conceal. A covering. To cover or hide.  ","word":"veil","see_also":["Seenon-veggie","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Tirobhava shakti. The divine power that limits the soul's perception by binding or attaching the soul to the bonds of anava, karma, and maya -- enabling it to grow and evolve as an individual being.  ","word":"veiling grace","see_also":["grace","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Spear, lance.\" The symbol of Lord Karttikeya's divine authority as Lord of yoga and commander of the devas. (Known as shula in Sanskrit.)  ","word":"vel","see_also":["Karttikeya","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":null,"word":"Vellore","see_also":["Chinna Bomman","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Deserving respect by virtue of age, dignity, character or position.  ","word":"venerable","see_also":["Chinna Bomman","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"To love or consider with respect and admiration; to revere. From the Latin veneratus, worshiped, revered.  ","word":"venerate","see_also":["Chinna Bomman","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Sincere respect, reverence.  ","word":"veneration","see_also":["Chinna Bomman","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Desiring or seeking to return injury for injury. Bent on revenge.  ","word":"vengeful","see_also":["Chinna Bomman","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"To risk. To express in words at the risk of criticism.  ","word":"venture","see_also":["Chinna Bomman","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"The second planet from the Sun in Earth's solar system, associated with the second chakra.  ","word":"Venus","see_also":["Chinna Bomman","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Honesty, truthfulness; accuracy.  ","word":"veracity","see_also":["Chinna Bomman","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Bright red.   ","word":"vermillion","see_also":["Chinna Bomman","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Language or dialect commonly spoken in a given country or region.  ","word":"vernacular","see_also":["Chinna Bomman","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"A long, unstitched cloth like a sarong, wound about the waist and reaching below the ankles. Traditional Hindu apparel for men. It can be wrapped in many different styles. A Tamil word derived from the Sanskrit veshtana, \"encircling.\" Also called vetti (Tamil) or dhoti (Hindi).   ","word":"veshti","see_also":["Chinna Bomman","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"The clothing, especially official robes or other garb, worn by religious persons, often as a sign of their spiritual position or ordination.  ","word":"vestments","see_also":["Chinna Bomman","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Able to live. Likely to survive. Practicable, meaningful.  ","word":"viable","see_also":["Chinna Bomman","vegetarian","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Powerful,\" \"pervading,\" \"appearing.\" From bhu, \"existence\" or \"manifestation\" and vi, \"apart.\" Holy ash, a whitish powder prepared by burning cow dung along with other precious substances -- milk, ghee, honey, etc. It symbolizes purity and is one of the main sacraments offered to God and given to worshipers after puja in all Saivite temples and shrines. Saivites wear three stripes on the brow as a distinct sectarian mark, as do many Smartas. Vibhuti is also a synonym for siddhi, supernormal powers developed through yoga practice.  ","word":"vibhuti","see_also":["tilaka","tripundra","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"A distinctive emotional aura or atmosphere that can be instinctively sensed or experienced.  ","word":"vibration","see_also":["tilaka","tripundra","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Empathizing or sharing in the experience of another person through feeling or imagination.  ","word":"vicarious","see_also":["tilaka","tripundra","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Fault or failing, from the Lain vitium. Corrupt habits; depravity. Related to the Sanskrit vishu, meaning, \"adverse; in opposite directions.\"   ","word":"vice","see_also":["tilaka","tripundra","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Those who triumph and those who are defeated in war, debate or any competition. A concept or attitude about winning and losing derived from dualistic beliefs, which can lead to adharma, himsa, etc.   ","word":"victors and vanquished","see_also":["tilaka","tripundra","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"To know.\" Verbal root of Veda and vidya, \"knowledge.\"  ","word":"vid","see_also":["tilaka","tripundra","yama-niyama","Madhva","monistic theism","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Disembodied liberation.\" Release from reincarnation through nirvikalpa samadhi -- the realization of the Self, Parashiva -- at the point of death. Blessed are those who are aware that departure, mahasamadhi, is drawing near. They settle all affairs, make amends and intensify personal sadhana. They seek the silver channel of sushumna which guides kundalini through the door of Brahman into the beyond of the beyond. They seek total renunciation as the day of transition looms strongly in their consciousness. Those who know that Lord Yama is ready to receive them seek to merge with Siva. They seek nirvikalpa samadhi as the body and earthly life fall away. Those who succeed are the videhamuktas, honored as among those who will never be reborn. Hindu tradition allows for vows of renunciation, called atura sannyasa diksha, to be taken and the orange robe donned by the worthy sadhaka or householder in the days prior to death.  ","word":"videhamukti","see_also":["jivanmukti","kaivalya","moksha","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Knowledge, learning, science.\" The power of understanding gained through study and meditation. Contrasted with avidya, ignorance.   ","word":"vidya","see_also":["jivanmukti","kaivalya","moksha","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Commencement of learning.\"  ","word":"vidyarambha","see_also":["samskaras of childhood","kaivalya","moksha","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"The Lord of Obstacles\" is bedecked in jewels. His special implements are the conch, discus and flower arrow. This is Ganesha's aspect as the conqueror of mamata, egoity. ","word":"Vighnaraja Ganapati","see_also":["samskaras of childhood","kaivalya","moksha","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Lord of Obstacles.\" A name for Lord Ganesha describing His power to both remove and create obstacles to guide souls along the right path.  ","word":"Vighneshvara","see_also":["Ganesha","kaivalya","moksha","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"A one-hour time of sadhana, ideally before sunrise, a regimen of puja, chanting of the Guru Mantra, personal japa, scriptural study, hatha yoga and meditation.  ","word":"vigil","see_also":["Ganesha","kaivalya","moksha","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"The victorious one\" rides the mouse and holds four primary symbols: the broken tusk, goad, noose and mango. ","word":"Vijaya Ganapati","see_also":["Ganesha","kaivalya","moksha","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"City of Victory.\" Opulent city and last Indian empire, centered in present-day Karnataka state, which extended as far as Malaysia, Indonesia and the Philippines. It flourished from 1336 to 1565, at which time it began to disintegrate following defeat at the hand of Muslim armies. However, its existence and strength did serve to prevent Muslim expansion into South India. Awed visitors recounted its fabulously rich culture and great wealth. Site of extensive recent archeological restoration.   ","word":"Vijayanagara","see_also":["Ganesha","kaivalya","moksha","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Sheath of cognition.\" The soul's mental or cognitive-intuitive sheath, also called the actinodic sheath.  ","word":"vijnanamaya kosha","see_also":["kosha","mental body","soul","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Deformed; having an unusual size or aspect.\" A name of Ganesha cited in the Mudgala Purana as the conqueror of kama, lust. ","word":"Vikata","see_also":["kosha","mental body","soul","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Spirited force, energy or vigor.  ","word":"vim","see_also":["kosha","mental body","soul","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"A large, popular South Indian musical instrument usually having seven strings and two calabash gourds as resonance boxes.  ","word":"vina","see_also":["kosha","mental body","soul","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Remover.\" A name of Lord Ganesha, meaning the remover of obstacles (sometimes preceded by vighna, \"obstacle\").  ","word":"Vinayaka","see_also":["Ganesha","mental body","soul","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Ode to Vinayaka.\" Famous Tamil poem in praise of Ganesha by the 8th-century woman saint, Auvaiyar.   ","word":"Vinayaka Ahaval","see_also":["Ganesha","mental body","soul","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"A 21-day festival to Lord Ganesha beginning on the full-moon day of November-December. An important festival in Tamil Nadu and in Tamil communities worldwide, when special pujas are conducted in Ganesha temples, and devotees make a vow (vrata), such as to attend the daily puja, or to fast by taking only one meal a day.   ","word":"Vinayaka Vratam","see_also":["Ganesha","mental body","soul","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"The valiant warrior\" is a murti recognized by His sixteen hands, holding a variety of weapons: mace, bow, axes and more. ","word":"Vira Ganapati","see_also":["Ganesha","mental body","soul","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Heroic Saivism.\" Made prominent by Basavanna in the 12th century. Also called Lingayat Saivism. Followers, called Lingayats, Lingavantas or Sivasharanas, always wear a Sivalinga on their person. Vira Saivites are proudly egalitarian and emphasize the personal relationship with Siva, rather than temple worship. Vira Saiva priests, jangamas, conduct marriages and other domestic rites and also act as gurus or teachers. Among the most central texts are Basavanna's Vachanas, Allama Prabhu's Mantragopya, Chennabasavanna's Karana Hasuge, and the collected work called Shunya Sampadane. The monistic-theistic doctrine of Vira Saivism is called Shakti Vishishtadvaita -- a version of qualified nondualism which accepts both difference and nondifference between soul and God, like rays are to the sun. In brief, Siva and the cosmic force or existence are one (\"Siva are you; you shall return to Siva.\"). Yet, Siva is beyond His creation, which is real, not illusory. God is both efficient and material cause. In Vira Saivism, Siva divides from His Absolute state into Linga (Supreme Lord) and anga, individual soul, the two eventually reuniting in undifferentiated oneness. There are three aspects of Sivalinga. 1) Ishtalinga, personal form of Siva, in which He fulfills desires and removes afflictions -- God as bliss or joy; 2) Bhavalinga, Siva beyond space and time, the highest divine principle, knowable through intuition; 3) Pranalinga, the reality of God which can be apprehended by the mind. The soul merges with Siva by a progressive, six-stage path called shatsthala, consisting of bhakti (devotion), mahesha (charity and selfless service), prasada (seeking Siva's grace), Pranalinga (experience of all as Siva), sharana (egoless refuge in Siva) and aikya (oneness with Siva). Today Vira Saivism is a vibrant faith, particularly strong in its religious homeland of Karnataka, South Central India. Roughly 40 million people live here, of which perhaps 25% are members of the Vira Saiva religion. Early on, they rejected brahminical authority, and along with it the entire caste system and the Vedas. By rejecting the Vedas, they continue to stand outside mainstream Hinduism, but in their profound love of Siva and acceptance of certain Saiva Agamas, as well as the main truths of the Vedic wisdom, they have identified themselves as a unique Saiva sect. Though they have established their faith as a distinct and independent religion in Indian courts of law, they are still widely embraced as devout brothers and sisters of the Hindu dharma.  ","word":"Vira Saivism (Saiva)","see_also":["Lingavanta","Saivism","soul","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Characteristic of a virgin. Pure. -- virginal God:  Reference to Lord Karttikeya, the perpetual bachelor, descriptive of His inherent purity.","word":"virginal","see_also":["Lingavanta","Saivism","soul","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Manliness; masculine strength, spirit or power.  ","word":"virility","see_also":["Lingavanta","Saivism","soul","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Departure.\"  ","word":"visarjana","see_also":["Ganesha Chaturthi","Saivism","soul","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Qualified nondualism.\" Best known as the term used by Ramanuja (ca 1017-1137) to name his Vaishnava Vedanta philosophy, which is nondualistic in that the ultimate truth or reality is one, not two, and souls are in fact part of God. And it is \"qualified\" in that souls are fully one with God, but not identical. Thus there is a full union which is somewhat shy of total merger. Siva Vishishtadvaita was the term chosen by Bhaskara (ca 950) to name his philosophy.  ","word":"Vishishtadvaita","see_also":["Siva Advaita","Vedanta","soul","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"All-pervasive.\" Supreme Deity of the Vaishnavite religion. God as personal Lord and Creator, the All-Loving Divine Personality, who periodically incarnates and lives a fully human life to reestablish dharma whenever necessary. In Saivism, Vishnu is Siva's aspect as Preserver.  ","word":"Vishnu","see_also":["Vaishnavism","Vedanta","soul","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Wheel of purity.\" The fifth chakra. Center of divine love.  ","word":"vishuddha chakra","see_also":["chakra","Vedanta","soul","Parashiva","Self Realization","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Total absorption.\" The final merger, or absorption, of the soul in Siva, by His grace, at the fulfillment of its evolution. It is the ultimate union of the individual soul body with the body of Siva --Parameshvara -- within the Sivaloka, from whence the soul was first emanated. This occurs at the end of the soul's evolution, after the four outer sheaths -- annamaya kosha, pranamaya kosha, manomayakosha and vijnamaya kosha -- have been discarded. Finally, anandamaya kosha, the soul form itself, merges in the Primal Soul. Individuality is lost as the soul becomes Siva, the Creator, Preserver, Destroyer, Veiler and Revealer. Individual identity expands into universality. Having previously merged in Parasiva and Parashakti in states of samadhi, the soul now fully merges into Parameshvara and is one with all three of Siva's perfections. Jiva has totally become Siva -- not a new and independent Siva, as might be construed, for there is and can only be one Supreme God Siva. This fulfilled merger can happen at the moment the physical body is abandoned, or after eons of time following further unfoldment of the higher chakras in the inner worlds, all depending on the maturity, ripeness and intentions of the soul, by which is meant the advanced soul's choice to be either an upadeshi or a nirvani.  ","word":"vishvagrasa","see_also":["atman","evolution of the soul","nirvani and upadeshi","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"World as teacher.\" The playful personification of the world as the guru of those with no guru. He is headmaster of the \"school of hard knocks,\" where students are left to their own devices and learn by their own mistakes rather than by following a traditional teacher.  ","word":"Vishvaguru","see_also":["atman","evolution of the soul","nirvani and upadeshi","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Characteristic of one who has visions; a prophet, evolved seer.   ","word":"visionary","see_also":["atman","evolution of the soul","nirvani and upadeshi","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"A broad mental or physical view.  ","word":"vista","see_also":["atman","evolution of the soul","nirvani and upadeshi","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"To imagine, create mental images. Exercising the power of thought to plan for and shape the future.  ","word":"visualize (visualization)","see_also":["atman","evolution of the soul","nirvani and upadeshi","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Relating to life or living. Also used in the sense of essential to continued existence or effectiveness.  ","word":"vital","see_also":["atman","evolution of the soul","nirvani and upadeshi","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"The life-giving energies in the physical body.  ","word":"vital forces","see_also":["atman","evolution of the soul","nirvani and upadeshi","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Region of negation.\" Region of raging anger and viciousness. The second chakra below the muladhara, centered in the thighs. Corresponds to the second astral netherworld beneath the Earth's surface, called Avichi (\"joyless\") or Vitala.  ","word":"vitala","see_also":["chakra","loka","Naraka","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Marriage.\"  ","word":"vivaha","see_also":["samskaras","loka","Naraka","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Crest jewel of discrimination.\" A famous work by Sankara (788-820) on discipline and discrimination between the real and the unreal as the way to God.   ","word":"Viveka Chudamani","see_also":["samskaras","loka","Naraka","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"A philosophic treatise of the Siddha Siddhanta school of Saivism ascribed to Gorakshanatha (ca 900).   ","word":"Viveka Martanda","see_also":["samskaras","loka","Naraka","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Of blissful discrimination.\" [1863-1902] Disciple of Sri Ramakrishna who was overtaken by an ardent love of Hinduism and a missionary zeal that drove him onward. He attained mahasamadhi at age 39. Most notable among his achievements was a trip around the world on which he gave brilliant lectures, especially in Europe and America, that created much respect for Hinduism. In India he founded the Ramakrishna Mission which thrives today internationally with over 100 centers and nearly 1,000 sannyasins. He is credited, along with Tagore, Aurobindo, Radhakrishnan and others, with sparking the modern Hindu revival.  ","word":"Vivekananda, Swami","see_also":["jnana yoga","Ramakrishna","Naraka","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Very clear, distinct or brilliant.  ","word":"vivid","see_also":["jnana yoga","Ramakrishna","Naraka","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"To give life to, or make more active, influential.  ","word":"vivify","see_also":["jnana yoga","Ramakrishna","Naraka","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"That is; namely. Used to introduce examples, lists or items.  ","word":"viz.","see_also":["jnana yoga","Ramakrishna","Naraka","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"An empty space. Philosophically, emptiness itself. The absence of time, form and space. God Siva in His perfection as Parashiva, as a sacred void, but not \"like the emptiness inside of an empty box....[It] is the fullness of everything.\"  ","word":"void","see_also":["Parashiva","Ramakrishna","Naraka","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Look there.\" An (originally French) exclamation of satisfaction or mild boast with a thing shown or accomplished.  ","word":"voila","see_also":["Parashiva","Ramakrishna","Naraka","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Will, faculty of choosing.  ","word":"volition","see_also":["Parashiva","Ramakrishna","Naraka","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"A place or situation regarded as drawing into its center all that surrounds it. Plural: vortices.  ","word":"vortex","see_also":["Parashiva","Ramakrishna","Naraka","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"A person committed by a vow. A devotee; a monk or nun.  ","word":"votary","see_also":["Parashiva","Ramakrishna","Naraka","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"A solemn promise, oath or pledge, especially one made to God, dedicating oneself to an act, service or way of life. Hindus take vows, vratas, for many reasons, both mundane and divine.   ","word":"vow","see_also":["vrata","Ramakrishna","Naraka","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Vow.\" A religious oath. Vratas are personal promises to perform certain disciplines over a period of time, such as fasting, specific japa repetitions, worship or meditation, to enhance one's spirituality, establish self-discipline, invoke divine blessings and often to atone for misdeeds. Certain vratas are long-term, such as the brahmachariya vrata, the traditional promise to remain celibate until marriage or, in the case of the sannyasin, for life. As one of the traditional niyamas (practices) of ashtanga yoga, vrata means to fulfill religious vows, rules and observances faithfully.   ","word":"vrata","see_also":["marriage covenant","sannyasa diksha","Vinayaka Vratam","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Out-caste's hymn.\" The traditional purification rite, outlined in the Tandya Brahmana, to welcome back into a Hindu community those who have become impure. It is performed for Hindus returning to India from abroad and for those who have embraced other faiths.  ","word":"vratyastoma","see_also":["marriage covenant","sannyasa diksha","Vinayaka Vratam","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Tree.\" ","word":"vriksha","see_also":["marriage covenant","sannyasa diksha","Vinayaka Vratam","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Whirlpool, vortex.\" In yoga psychology, names the fluctuations of consciousness, the waves of mental activities (chitta vritti) of thought and perception. A statement from Patanjali's Yoga Sutras (1.2) reads, \"Yoga is the restraint (nirodha) of mental activity (chitta vritti).\" In general use, vritti means: 1) course of action, mode of life; conduct, behavior; way in which something is done; 2) mode of being, nature, kind, character. ","word":"vritti","see_also":["mind (individual)","raja yoga","Vinayaka Vratam","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Tiger feet.\" Famous Nandinatha Sampradaya siddha (ca 200 BCE), trained under Maharishi Nandinatha, was a brother disciple of rishis Tirumular and Patanjali. He pilgrimaged south from Kashmir, settling at Tamil Nadu's Chidambaram Siva Temple to practice yoga.  ","word":"Vyaghrapada","see_also":["Kailasa Parampara","raja yoga","Vinayaka Vratam","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"Auxiliary Vedic texts on Sanskrit grammar. Vyakarana is among four linguistic skills taught for mastery of the Vedas and the rites of yajna. The term literally means \"separation, analysis or explication.\" The most celebrated Vyakarana work is Panini's 4,000-sutra Ashtadhyayi, which set the linguistic standards for classical Sanskrit (ca 400 BCE).  ","word":"Vyakarana Vedanga","see_also":["Vedanga","raja yoga","Vinayaka Vratam","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Retained breath.\" One of the body's five somatic currents of vital energy, or prana.  ","word":"vyana","see_also":["prana","raja yoga","Vinayaka Vratam","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"All-pervasive.\" The first of the seven chakras, or nadi conglomerates, above and within the sahasrara chakra.  ","word":"vyapini","see_also":["chakras above sahasrara","raja yoga","Vinayaka Vratam","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null},{"definition":"\"Space-bodied.\" The second of the seven chakras, or nadi conglomerates, above and within the sahasrara chakra.  ","word":"vyomanga","see_also":["chakras above sahasrara","raja yoga","Vinayaka Vratam","samadhi","soul","panentheism","Ramanuja","Tirumantiram","Vallabha"],"production_notes":null}],"results":132}