{"entries":[{"definition":"To float easily and gently, as on air.  ","word":"waft","see_also":null,"production_notes":null},{"definition":"To roll around clumsily and happily as a pig does in mud.  ","word":"wallow","see_also":null,"production_notes":null},{"definition":"To decrease, diminish. \"On the wane:\" in the process of decreasing or disappearing.  ","word":"wane","see_also":null,"production_notes":null},{"definition":"Turn aside, prevent, avert.  ","word":"ward off","see_also":null,"production_notes":null},{"definition":"In the art of weaving, warp names the lengthwise threads that give structure to the cloth; woof denotes the crossing threads that give design and color. Taken together, the expression \"warp and woof\" means the very fiber or essence of a thing.   ","word":"warp and woof","see_also":null,"production_notes":null},{"definition":"To vacillate, hesitate, showing doubt or indecision. Characteristic of not being firm-minded. To be unsure of oneself.  ","word":"waver","see_also":null,"production_notes":null},{"definition":"Artha. Abundance; financial stability.  ","word":"wealth","see_also":["purushartha"],"production_notes":null},{"definition":"Gurudeva's American English translation of the ancient Tamil ethical scripture, Tirukural. ","word":"Weaver's Widsom","see_also":["Tirukural"],"production_notes":null},{"definition":"Computer viewing of sites on the World Wide Web on a computer containing information posted by individuals or group or organizations.  ","word":"Web browsing","see_also":["Tirukural"],"production_notes":null},{"definition":"A gold ornament worn by the Hindu wife around the neck representing her vows of matrimony. Known as mangala sutra in Sanskrit, and tali in Tamil. She reveres it as an image of her husband and ritually worships it during her morning devotions.  ","word":"wedding pendant","see_also":["Tirukural"],"production_notes":null},{"definition":"A source, fountainhead.  ","word":"wellspring","see_also":["Tirukural"],"production_notes":null},{"definition":"An involuntary emission of semen during sleep, usually as a result of a sexual dream. Swami Sivananda discusses wet dreams in his Yoga Lessons for Children, Chapter 36 on Brahmacharya. He states, \"Many young boys and men suffer from wet dreams. Sri Aurobindo states that an occurrence once a week is normal. To have it more frequently indicates indulgence in sex thoughts.\" Sivananda advises a sattvic diet, rising early (as wet dreams usually occur in the last quarter of the night), cold showers, hatha yoga, fresh fruit and raw foods, not going to bed right after a heavy meal. He says, \"The actual essence does not come out during wet dreams. It is only the watery prostatic juice with a little semen. When nocturnal emission takes place, the mind which was working in the inner astral body suddenly enters the physical body vehemently in an agitated condition. That is the reason why emission takes place suddenly.\" He concludes, \"Do not get depressed or anxious. It is best not to give too much importance to these dreams. Forget them, then they will not trouble you.\" ","word":"wet dream","see_also":["transmutation"],"production_notes":null},{"definition":"From where. Whence does it come? Where does it come from?  ","word":"whence","see_also":["transmutation"],"production_notes":null},{"definition":"Moving rapidly in a circular motion.  ","word":"whirling","see_also":["transmutation"],"production_notes":null},{"definition":"To hold and use with skill and power.  ","word":"wield","see_also":["transmutation"],"production_notes":null},{"definition":"A phosphorescent light that hovers over swampy ground at night, possibly caused by spontaneous combustion of gases emitted by rotting organic matter. Something that misleads or deludes; an illusion.  ","word":"will-o'-the-wisp","see_also":["transmutation"],"production_notes":null},{"definition":"Stubborn, bent on having one's own way; obstinate, unruly.  ","word":"willful","see_also":["transmutation"],"production_notes":null},{"definition":"The strength of will to carry out one's decisions, wishes or plans.  ","word":"willpower","see_also":["transmutation"],"production_notes":null},{"definition":"The five primary pranas or forces of the physical body. When they are in perfect balance, vibrant health is experienced. ","word":"winds of the body","see_also":["pranas"],"production_notes":null},{"definition":"The timely application of knowledge. The power of judging the best course of action, based on understanding, knowledge and experience.  ","word":"wisdom","see_also":["pranas"],"production_notes":null},{"definition":"To refrain from giving. Not granting.  ","word":"withholding","see_also":["pranas"],"production_notes":null},{"definition":"Sad, pitiful, full of sorrow and misery. -- woeful birth:  An unfavorable birth; a life of difficulties resulting from negative karmas accrued in previous lives.","word":"woeful","see_also":["pranas"],"production_notes":null},{"definition":"Inspiring awe, extraordinary, mirific.  ","word":"wondrous","see_also":["pranas"],"production_notes":null},{"definition":"The kapittha fruit. ","word":"wood apple","see_also":["kapittha"],"production_notes":null},{"definition":"A wind instrument such as the flute or the Indian nagasvara.  ","word":"woodwind","see_also":["kapittha"],"production_notes":null},{"definition":null,"word":"woof","see_also":["warp and woof"],"production_notes":null},{"definition":"A collection of sayings and statements of Sage Yogaswami of Sri Lanka -- compiled from notes and recollections of devotees.   ","word":"Words of Our Master","see_also":["warp and woof"],"production_notes":null},{"definition":"In Hindu theology, world refers to 1) loka:  a particular region of consciousness or plane of existence. 2) maya","word":"world","see_also":["a particular region of consciousness or plane of existence 2) maya:"],"production_notes":null},{"definition":"Materialistic, unspiritual. Devoted to or concerned with the affairs or pleasures of the world, especially excessive concern to the exclusion of religious thought and life. Connoting ways born of the lower chakras: jealousy, greed, selfishness, anger, guile, etc. -- worldliness:  The state or quality of being worldly.","word":"worldly","see_also":["a particular region of consciousness or plane of existence 2) maya:"],"production_notes":null},{"definition":"Intense anger. Rage.  ","word":"wrath","see_also":["a particular region of consciousness or plane of existence 2) maya:"],"production_notes":null},{"definition":"To twist, pull, yank or jerk in order to set something free.  ","word":"wrench","see_also":["a particular region of consciousness or plane of existence 2) maya:"],"production_notes":null},{"definition":null,"word":"written prayers","see_also":["lekhaprartha havana"],"production_notes":null},{"definition":"Formed, fashioned, crafted, built.   ","word":"wrought","see_also":["lekhaprartha havana"],"production_notes":null}],"results":33}