{"entries":[{"definition":"\"Worship; sacrifice.\" One of the most central Hindu concepts -- sacrifice and surrender through acts of worship, inner and outer. 1) A form of ritual worship especially prevalent in Vedic times, in which oblations -- ghee, grains, spices and exotic woods -- are offered into a fire according to scriptural injunctions while special mantras are chanted. The element fire, Agni, is revered as the divine messenger who carries offerings and prayers to the Gods. The ancient Veda Brahmanas and the Shrauta Shastras describe various types of yajna rites, some so elaborate as to require hundreds of priests, whose powerful chanting resounds for miles. These major yajnas are performed in large, open-air structures called yagashala. Domestic yajnas, prescribed in the Grihya Shastras, are performed in the family compound or courtyard. Yajna requires four components, none of which may be omitted: dravya, sacrificial substances; tyaga, the spirit of sacrificing all to God; devata, the celestial beings who receive the sacrifice; and mantra, the empowering word or chant. While puja (worship in temples with water, lights and flowers) has largely replaced the yajna, this ancient rite still continues, and its specialized priestly training is carried on in schools in India. Yajnas on a grand scale are performed for special occasions, beseeching the Gods for rain during drought, or for peace during bloody civil war. Even in temples, yajna has its Agamic equivalent in the agnikaraka, the homa or havana ceremony, held in a fire pit (homakunda) in an outer mandapa of a temple as part of elaborate puja rites. 2) Personal acts of worship or sacrifice. Life itself is a jivayajna. The Upanishads suggest that one can make \"inner yajnas\" by offering up bits of the little self into the fires of sadhana and tapas until the greater Self shines forth. The five daily yajnas, pancha mahayajna, of the householder (outlined in the Dharma Shastras) ensure offerings to rishis, ancestors, Gods, creatures and men. ","word":"yajna","see_also":null,"production_notes":null},{"definition":"One of the Vedic rishis. ","word":"Yajnavalkya","see_also":["Brihadaranyaka Upanishad","Paingala Upanishad","Yajnavalkya Smriti","Yajnavalkya Upanishad"],"production_notes":null},{"definition":"A Hindu code of law, one of the Dharma Shastras, regarded second in authority only to the earlier Manu Dharma Shastras.  ","word":"Yajnavalkya Smriti","see_also":["Dharma Shastra","smriti","Yajnavalkya Smriti","Yajnavalkya Upanishad"],"production_notes":null},{"definition":"A metrical rendering of the Jabala Upanishad, which expounds on sannyasa, renunciation of worldly life in the quest for liberation.   ","word":"Yajnavalkya Upanishad","see_also":["Dharma Shastra","smriti","Yajnavalkya Smriti","Yajnavalkya Upanishad"],"production_notes":null},{"definition":"The \"sacred thread\" received by a youth at the upanayana samskara.  ","word":"yajnopavita","see_also":["upanayana","smriti","Yajnavalkya Smriti","Yajnavalkya Upanishad"],"production_notes":null},{"definition":"\"Wisdom of sacrificial formulas.\" One of the four bodies of revelatory texts called Vedas (Rig, Sama, Yajur and Atharva). When used alone, the term Yajur Veda generally refers to this Veda's central and oldest portion -- the Samhita, \"hymn collection.\" Of this there are two recensions: 1) the Krishna (\"black\") Yajur Veda (so-called because the commentary, Brahmana, material is mixed with the hymns); and 2) the Shukla (\"white or clear\") Yajur Veda (with no commentary among the hymns). The contents of these two recensions are also presented in different order. The Yajur Veda Samhita is divided into 40 chapters and contains 1,975 stanzas. About 30 percent of the stanzas are drawn from the Rig Veda Samhita (particularly from chapters eight and nine). This Veda is a special collection of hymns to be chanted during yajna. The Krishna Yajur Veda Samhita exists today in various recensions, most importantly the Taittiriya Samhita and the Maitrayani Samhita. The Shukla Yajur Veda Samhita is preserved most prominently as the Vajasaneyi Samhita.  ","word":"Yajur Veda","see_also":["Vedas","smriti","Yajnavalkya Smriti","Yajnavalkya Upanishad"],"production_notes":null},{"definition":"\"The restrainer.\" Hindu God of death; oversees the processes of death transition, guiding the soul out of its present physical body.  ","word":"Yama","see_also":["death","smriti","Yajnavalkya Smriti","Yajnavalkya Upanishad"],"production_notes":null},{"definition":"\"The restrainer.\" Hindu God of death; oversees the processes of death transition, guiding the soul out of its present physical body.  ","word":"yama","see_also":["death","smriti","Yajnavalkya Smriti","Yajnavalkya Upanishad"],"production_notes":null},{"definition":"\"Restraints-observances.\" The first two of the eight limbs of raja yoga, constituting Hinduism's fundamental ethical codes, the ten yamas and ten niyamas are the essential foundation for all spiritual progress. The yamas are the ethical restraints; the niyamas are the religious practices. The ten traditional yamas and ten niyamas: -- yamas: 1) ahimsa: \"Noninjury.\" 2) satya: \"Truthfulness.\" 3) asteya: \"Nonstealing.\" 4) brahmacharya: \"Sexual purity.\" 5) kshama: \"Patience.\" 6) dhriti: \"Steadfastness.\" 7) daya: \"Compassion.\" 8) arjava: \"Honesty, straightforwardness.\" 9) mitahara: \"Moderate appetite.\" 10) shaucha: \"Purity.\" -- niyamas: 1) hri: \"Remorse.\" 2) santosha: \"Contentment.\" 3) dana: \"Giving.\" 4) astikya: \"Faith.\" 5) Ishvarapujana: \"Worship of the Lord.\" 6) siddhanta shravana: \"Scriptural listening.\" 7) mati: \"Cognition.\" 8) vrata: \"Sacred vows.\" 9) japa: \"Recitation.\" 10) tapas: \"Austerity.\"  ","word":"yama-niyama","see_also":["raja yoga","smriti","Yajnavalkya Smriti","Yajnavalkya Upanishad"],"production_notes":null},{"definition":"\"Vessel; container.\" A mystic diagram composed of geometric and alphabetic figures -- usually etched on small plates of gold, silver or copper. Sometimes rendered in three dimensions in stone or metal. The purpose of a yantra is to focus spiritual and mental energies according to computer-like yantric pattern, be it for health, wealth, childbearing or the invoking of one God or another. It is usually installed near or under the temple Deity. Psychically seen, the temple yantra is a magnificent three-dimensional edifice of light and sound in which the devas work. On the astral plane, it is much larger than the temple itself. -- Shri Chakra: The most well known yantra and a central image in Shakta worship. Consisting of nine interlocking triangles, it is the design of Siva-Shakti's multidimensional manifestations. Yantras are also used for meditation and sadhana, especially in the Shakta tradition. Installing them beneath Deities is a fairly modern practice, while the Agamas prescribe the placement of precious gems. For Saivites the Tiruambala Chakra yantra, representing Lord Nataraja, is most sacred.","word":"yantra","see_also":[null,"smriti","Yajnavalkya Smriti","Yajnavalkya Upanishad"],"production_notes":null},{"definition":null,"word":"yatra","see_also":["tirthayatra","smriti","Yajnavalkya Smriti","Yajnavalkya Upanishad"],"production_notes":null},{"definition":"Yes, indeed, truly.   ","word":"yea","see_also":["tirthayatra","smriti","Yajnavalkya Smriti","Yajnavalkya Upanishad"],"production_notes":null},{"definition":"To produce as a result of cultivation, such as fruit. To profit or give.  ","word":"yield","see_also":["tirthayatra","smriti","Yajnavalkya Smriti","Yajnavalkya Upanishad"],"production_notes":null},{"definition":"A Chinese philosophical concept of two polar energies that, by their interaction, are the cause of the universe. It is a symbol of the balance of opposites, feminine, masculine, dark, light, etc.  ","word":"yin-yang","see_also":["tirthayatra","smriti","Yajnavalkya Smriti","Yajnavalkya Upanishad"],"production_notes":null},{"definition":"A toy consisting of a string winding around a round device, that when thrown, comes back.  ","word":"yo-yo","see_also":["tirthayatra","smriti","Yajnavalkya Smriti","Yajnavalkya Upanishad"],"production_notes":null},{"definition":" \"Union.\" From yuj, \"to yoke, harness, unite.\" The philosophy, process, disciplines and practices whose purpose is the yoking of individual consciousness with transcendent or divine consciousness. One of the six darshanas, or systems of orthodox Hindu philosophy. Yoga was codified by Patanjali in his Yoga Sutras (ca 200 BCE) as the eight limbs (ashtanga) of raja yoga. It is essentially a one system but, historically, parts of raja yoga have been developed and emphasized as yogas in themselves. Prominent among the many forms of yoga are hatha yoga (emphasizing bodily perfection in preparation for meditation), kriya yoga (emphasizing breath control), as well as karma yoga (selfless service) and bhakti yoga (devotional practices) which could be regarded as an expression of raja yoga's first two limbs (yama and niyama). ","word":"yoga","see_also":["austerity","bhakti yoga","danda","hatha yoga","jivanmukta","raja yoga","shad darshana","siddha yoga","siddhi"],"production_notes":null},{"definition":"Taking time out during one's work routine to lie on the floor in the corpse pose, relaxing all tensions and stress for five minutes, a practice made famous by Indra Devi in the 1950s and '60s.  ","word":"yoga break","see_also":["austerity","bhakti yoga","danda","hatha yoga","jivanmukta","raja yoga","shad darshana","siddha yoga","siddhi"],"production_notes":null},{"definition":"\"The meditator\" is a special murti of Ganesha, seated in yogic pose holding a yoga staff and a strand of prayer beads. ","word":"Yoga Ganapati","see_also":["austerity","bhakti yoga","danda","hatha yoga","jivanmukta","raja yoga","shad darshana","siddha yoga","siddhi"],"production_notes":null},{"definition":"  ","word":"yoga marga","see_also":["yogapada","bhakti yoga","danda","hatha yoga","jivanmukta","raja yoga","shad darshana","siddha yoga","siddhi"],"production_notes":null},{"definition":"The third of the successive stages in spiritual unfoldment in Saiva Siddhanta, wherein the goal is Self Realization.  ","word":"yoga pada","see_also":["pada","yoga","danda","hatha yoga","jivanmukta","raja yoga","shad darshana","siddha yoga","siddhi"],"production_notes":null},{"definition":"The third of the successive stages in spiritual unfoldment in Saiva Siddhanta, wherein the goal is Self Realization.  ","word":"yoga pada","see_also":["pada","yoga","danda","hatha yoga","jivanmukta","raja yoga","shad darshana","siddha yoga","siddhi"],"production_notes":null},{"definition":"A term for Siddha Siddhanta.  ","word":"Yoga Sampradaya","see_also":["Saivism","yoga","danda","hatha yoga","jivanmukta","raja yoga","shad darshana","siddha yoga","siddhi"],"production_notes":null},{"definition":"The great work by Saivite Natha siddha Patanjali (ca 200 BCE), comprising some 200 aphorisms delineating ashtanga (eight-limbed), raja (kingly) or siddha (perfection) yoga. Still today, it is the foremost text on meditative yoga. ","word":"Yoga Sutras","see_also":["Kailasa Parampara","raja yoga","yoga","hatha yoga","jivanmukta","raja yoga","shad darshana","siddha yoga","siddhi"],"production_notes":null},{"definition":"\"Fiery union.\" Relentless, sustained yoga practice that awakens the fiery kundalini, bringing the transforming heat of tapas and ultimately the repeated experience of the Self God, leading to jnana, the wisdom state.  ","word":"yoga tapas","see_also":["Advaita Siddhanta","austerity","danda","jivanmukta","jnana","Kadaitswami","karma","penance","punya","siddhi","tapas","yama","yoga"],"production_notes":null},{"definition":"Poetic work of over 29,000 verses attributed to Valmiki. It is a dialog between Prince Rama and his teacher, Sage Vasishtha, in the form of 50 intriguing stories which present advaita and the concepts and ideals of yoga in elegant Sanskrit. (Variously dated between 500 and 1000 CE.)  ","word":"Yoga Vasishtha","see_also":["Advaita Siddhanta","austerity","danda","jivanmukta","jnana","Kadaitswami","karma","penance","punya","siddhi","tapas","yama","yoga"],"production_notes":null},{"definition":"\"Meditation staff.\" A curved arm rest used during meditation, usually made of wood and attached to a staff about two feet long. ","word":"yogadanda","see_also":["Advaita Siddhanta","austerity","danda","jivanmukta","jnana","Kadaitswami","karma","penance","punya","siddhi","tapas","yama","yoga"],"production_notes":null},{"definition":"The boyhood name of Satguru Siva Yogaswami.  ","word":"Yoganathan","see_also":["Advaita Siddhanta","austerity","danda","jivanmukta","jnana","Kadaitswami","karma","penance","punya","siddhi","tapas","yama","yoga"],"production_notes":null},{"definition":"\"Master of yoga.\" Sri Lanka's most renowned contemporary spiritual master (1872 -- 1964), a Sivajnani and Natha siddhar revered by both Hindus and Buddhists. He was trained in and practiced kundalini yoga under the guidance of Satguru Chellappaswami, from whom he received guru diksha. Sage Yogaswami was in turn the satguru of Sivaya Subramuniyaswami. Yogaswami conveyed his teachings in hundreds of songs, called Natchintanai, \"good thoughts,\" urging seekers to follow dharma and realize God within. Four great sayings capsulize his message: Thanai ari, \"Know thy Self by thyself;\" Sarvam Sivam Ceyal, \"Siva is doing it all;\" Sarvam Sivamaya, \"All is Siva;\" and Summa Iru, \"Be still.\"  ","word":"Yogaswami","see_also":["Kailasa Parampara","austerity","danda","jivanmukta","jnana","Kadaitswami","karma","penance","punya","siddhi","tapas","yama","yoga"],"production_notes":null},{"definition":"Scripture of 142 verses based on Advaita Vedanta and yoga practices, ca 1400.   ","word":"Yogatattva Upanishad","see_also":["Kailasa Parampara","austerity","danda","jivanmukta","jnana","Kadaitswami","karma","penance","punya","siddhi","tapas","yama","yoga"],"production_notes":null},{"definition":"(yogin) One who practices yoga, especially kundalini or raja yoga. In Gurudeva's monastic community, yogis, or tapasvins, are distinguished by their yellow robes and earnestness in the performance of sadhana and humble service. (Hindi and modern Indian vernaculars. Sanskrit: yogin.)  ","word":"yogi","see_also":["Kailasa Parampara","austerity","danda","jivanmukta","jnana","Kadaitswami","karma","penance","punya","siddhi","tapas","yama","yoga"],"production_notes":null},{"definition":"Feminine counterpart of yogi.  ","word":"yogini","see_also":["Kailasa Parampara","austerity","danda","jivanmukta","jnana","Kadaitswami","karma","penance","punya","siddhi","tapas","yama","yoga"],"production_notes":null},{"definition":"To harness; join securely as if with a yoke (a wooden bar fitted around the necks of a pair of oxen to harness them together.) Something like a yoke in shape or function.  ","word":"yoke","see_also":["Kailasa Parampara","austerity","danda","jivanmukta","jnana","Kadaitswami","karma","penance","punya","siddhi","tapas","yama","yoga"],"production_notes":null},{"definition":"Joining securely or closely uniting.  ","word":"yoking","see_also":["Kailasa Parampara","austerity","danda","jivanmukta","jnana","Kadaitswami","karma","penance","punya","siddhi","tapas","yama","yoga"],"production_notes":null},{"definition":"That or those (at a distance).  ","word":"yon","see_also":["Kailasa Parampara","austerity","danda","jivanmukta","jnana","Kadaitswami","karma","penance","punya","siddhi","tapas","yama","yoga"],"production_notes":null},{"definition":"\"Source, origin; womb.\" In certain tantric sects the Sivalinga is worshiped as a phallic symbol, and the base of the linga as a vulva, or yoni. While the linga represents the unmanifest or static Absolute of Siva, the yoni represents the dynamic, creative energy of Shakti, the womb of the universe. Metaphysically, in men and women, the yoni is the area between the anus and genitals. It is the lower counterpart to the door of Brahman in the cranium. It corresponds to Brahmadvara, the psychic passageway to the lower chakras. Likewise, it serves as the highest point of those who live totally in these counter-clockwise-spinning chakras. ","word":"yoni","see_also":["brahmacharya","brahmadvara","door of Brahman","Naraka","ojas","tantra","tejas","transmutation","Sivalinga","siddhi","tapas","yama","yoga"],"production_notes":null},{"definition":"Of yore: a long time ago, in a distant past.  ","word":"yore","see_also":["Sivalinga","tantrism","door of Brahman","Naraka","ojas","tantra","tejas","transmutation","Sivalinga","siddhi","tapas","yama","yoga"],"production_notes":null},{"definition":"A soul who has gone through only a few births, and is thus inexperienced or immature.  ","word":"young soul","see_also":["evolution of the soul","soul","door of Brahman","Naraka","ojas","tantra","tejas","transmutation","Sivalinga","siddhi","tapas","yama","yoga"],"production_notes":null},{"definition":"\"Eon,\" \"age.\" A time span, from tens of thousands to one million years, which is a single cycle within a four-yuga greater cycle. The four yugas are: Satya (or Krita), Treta, Dvapara and Kali. In the first period, dharma reigns supreme, but as the ages revolve, virtue diminishes and ignorance and injustice increases. At the end of the Kali Yuga, in which we are now, the cycle begins again with a new Satya Yuga. It is said in the Mahabharata that during the Satya Yuga all are brahmins, and the color of this yuga is white. In the Treta Yuga, righteousness decreases by one-fourth and men seek reward for their rites and gifts; the color is red and the consciousness of the kshatriya, sovereignty, prevails. In the Dvapara Yuga, the four varnas come fully into existence. The color is yellow. In the Kali Yuga, the color is black. Righteousness is one-tenth that of the Satya Yuga. True worship and sacrifice cease, and base, or shudra, consciousness is prominent. Calamities, disease, fatigue and faults such as anger and fear prevail. People decline and their motives grow weak.  ","word":"yuga","see_also":["cosmic cycle","mahapralaya","pralaya","Naraka","ojas","tantra","tejas","transmutation","Sivalinga","siddhi","tapas","yama","yoga"],"production_notes":null}],"results":38}